<?xml version="1.0"?>
<GCC_XML cvs_revision="1.135">

  <Struct id="_889" name="__darwin_i386_avx_state" context="_1" mangled="23__darwin_i386_avx_state" demangled="__darwin_i386_avx_state" location="f13:270" file="f13" line="270" artificial="1" size="5728" align="32" members="_1936 _1937 _1938 _1939 _1940 _1941 _1942 _1943 _1944 _1945 _1946 _1947 _1948 _1949 _1950 _1951 _1952 _1953 _1954 _1955 _1956 _1957 _1958 _1959 _1960 _1961 _1962 _1963 _1964 _1965 _1966 _1967 _1968 _1969 _1970 _1971 _1972 _1973 _1974 _1975 _1976 _1977 _1978 _1979 _1980 " bases=""/>
  <Typedef id="_890" name="__darwin_pthread_rwlock_t" type="_476" context="_1" location="f6:116" file="f6" line="116"/>
  <Typedef id="_891" name="__darwin_pthread_key_t" type="_106" context="_1" location="f6:112" file="f6" line="112"/>
  <Union id="_892" name="__sigaction_u" context="_1" mangled="13__sigaction_u" demangled="__sigaction_u" location="f24:268" file="f24" line="268" artificial="1" size="32" align="32" members="_1981 _1982 _1983 _1984 _1985 _1986 " bases=""/>
  <Function id="_893" name="memset_pattern16" returns="_977" context="_1" location="f18:158" file="f18" line="158" extern="1">
    <Argument type="_460" location="f18:158" file="f18" line="158"/>
    <Argument type="_976" location="f18:158" file="f18" line="158"/>
    <Argument type="_598" location="f18:158" file="f18" line="158"/>
  </Function>
  <Function id="_894" name="__builtin_sinf" returns="_910" context="_1" mangled="sinf" location="f3:76" file="f3" line="76" extern="1" attributes="nothrow pure no vops">
    <Argument type="_910" location="f3:76" file="f3" line="76"/>
  </Function>
  <Function id="_895" name="__builtin_sinh" returns="_909" context="_1" mangled="sinh" location="f3:77" file="f3" line="77" extern="1" attributes="nothrow pure no vops">
    <Argument type="_909" location="f3:77" file="f3" line="77"/>
  </Function>
  <Function id="_896" name="__builtin_sinl" returns="_911" context="_1" mangled="sinl" location="f3:80" file="f3" line="80" extern="1" attributes="nothrow pure no vops">
    <Argument type="_911" location="f3:80" file="f3" line="80"/>
  </Function>
  <Function id="_897" name="getloadavg" returns="_18" context="_1" location="f11:271" file="f11" line="271" extern="1">
    <Argument type="_1987" location="f11:271" file="f11" line="271"/>
    <Argument type="_18" location="f11:271" file="f11" line="271"/>
  </Function>
  <Variable id="_898" name="suboptarg" type="_266" context="_1" location="f11:315" file="f11" line="315" extern="1"/>
  <Function id="_899" name="setattrlist" returns="_18" context="_1" mangled="*_setattrlist" location="f0:717" file="f0" line="717" extern="1">
    <Argument type="_908" location="f0:717" file="f0" line="717"/>
    <Argument type="_460" location="f0:717" file="f0" line="717"/>
    <Argument type="_460" location="f0:717" file="f0" line="717"/>
    <Argument type="_598" location="f0:717" file="f0" line="717"/>
    <Argument type="_78" location="f0:717" file="f0" line="717"/>
  </Function>
  <Typedef id="_900" name="uint64_t" type="_25" context="_1" location="f12:110" file="f12" line="110"/>
  <Enumeration id="_901" name="XnBistError" context="_1" location="f2:390" file="f2" line="390" artificial="1" size="32" align="32">
    <EnumValue name="XN_BIST_RAM_TEST_FAILURE" init="1"/>
    <EnumValue name="XN_BIST_IR_CMOS_CONTROL_BUS_FAILURE" init="2"/>
    <EnumValue name="XN_BIST_IR_CMOS_DATA_BUS_FAILURE" init="4"/>
    <EnumValue name="XN_BIST_IR_CMOS_BAD_VERSION" init="8"/>
    <EnumValue name="XN_BIST_IR_CMOS_RESET_FAILUE" init="16"/>
    <EnumValue name="XN_BIST_IR_CMOS_TRIGGER_FAILURE" init="32"/>
    <EnumValue name="XN_BIST_IR_CMOS_STROBE_FAILURE" init="64"/>
    <EnumValue name="XN_BIST_COLOR_CMOS_CONTROL_BUS_FAILURE" init="128"/>
    <EnumValue name="XN_BIST_COLOR_CMOS_DATA_BUS_FAILURE" init="256"/>
    <EnumValue name="XN_BIST_COLOR_CMOS_BAD_VERSION" init="512"/>
    <EnumValue name="XN_BIST_COLOR_CMOS_RESET_FAILUE" init="1024"/>
    <EnumValue name="XN_BIST_FLASH_WRITE_LINE_FAILURE" init="2048"/>
    <EnumValue name="XN_BIST_FLASH_TEST_FAILURE" init="4096"/>
    <EnumValue name="XN_BIST_POTENTIOMETER_CONTROL_BUS_FAILURE" init="8192"/>
    <EnumValue name="XN_BIST_POTENTIOMETER_FAILURE" init="16384"/>
    <EnumValue name="XN_BIST_AUDIO_TEST_FAILURE" init="32768"/>
    <EnumValue name="XN_BIST_PROJECTOR_TEST_LD_FAIL" init="65536"/>
    <EnumValue name="XN_BIST_PROJECTOR_TEST_LD_FAILSAFE_TRIG_FAIL" init="131072"/>
    <EnumValue name="XN_BIST_PROJECTOR_TEST_FAILSAFE_HIGH_FAIL" init="262144"/>
    <EnumValue name="XN_BIST_PROJECTOR_TEST_FAILSAFE_LOW_FAIL" init="524288"/>
    <EnumValue name="XN_TEC_TEST_HEATER_CROSSED" init="1048576"/>
    <EnumValue name="XN_TEC_TEST_HEATER_DISCONNETED" init="2097152"/>
    <EnumValue name="XN_TEC_TEST_TEC_CROSSED" init="4194304"/>
    <EnumValue name="XN_TEC_TEST_TEC_FAULT" init="8388608"/>
  </Enumeration>
  <Typedef id="_902" name="XnBistError" type="_901" context="_1" location="f2:416" file="f2" line="416"/>
  <Function id="_903" name="__builtin_csin" returns="_1023" context="_1" mangled="csin" location="f3:115" file="f3" line="115" extern="1" attributes="nothrow pure no vops">
    <Argument type="_1023" location="f3:115" file="f3" line="115"/>
  </Function>
  <Function id="_904" name="getpass" returns="_266" context="_1" location="f0:557" file="f0" line="557" extern="1">
    <Argument type="_908" location="f0:557" file="f0" line="557"/>
  </Function>
  <Function id="_905" name="ftruncate" returns="_18" context="_1" location="f0:605" file="f0" line="605" extern="1">
    <Argument type="_18" location="f0:605" file="f0" line="605"/>
    <Argument type="_147" location="f0:605" file="f0" line="605"/>
  </Function>
  <Typedef id="_906" name="__int32_t" type="_18" context="_1" location="f20:44" file="f20" line="44"/>
  <Function id="_907" name="abs" returns="_18" context="_1" location="f11:129" file="f11" line="129" extern="1" attributes="nothrow const">
    <Argument type="_18" location="f11:129" file="f11" line="129"/>
  </Function>
  <PointerType id="_908" type="_1139c" size="32" align="32"/>
  <FundamentalType id="_909" name="double" size="64" align="64"/>
  <FundamentalType id="_910" name="float" size="32" align="32"/>
  <FundamentalType id="_911" name="long double" size="128" align="128"/>
  <Field id="_912" name="tv_sec" type="_608" offset="0" context="_12" access="public" location="f4:32" file="f4" line="32"/>
  <Field id="_913" name="tv_usec" type="_342" offset="32" context="_12" access="public" location="f4:33" file="f4" line="33"/>
  <Destructor id="_914" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalD1Ev *INTERNAL* " demangled="timeval::~timeval()" location="f4:31" file="f4" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_915" name="=" returns="_1989" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalaSERKS_" demangled="timeval::operator=(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_1990" location="f4:31" file="f4" line="31"/>
  </OperatorMethod>
  <Constructor id="_916" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalC1ERKS_ *INTERNAL* " demangled="timeval::timeval(timeval const&amp;)" location="f4:31" file="f4" line="31" endline="31" inline="1">
    <Argument type="_1990" location="f4:31" file="f4" line="31"/>
  </Constructor>
  <Constructor id="_917" name="timeval" artificial="1" throw="" context="_12" access="public" mangled="_ZN7timevalC1Ev *INTERNAL* " demangled="timeval::timeval()" location="f4:31" file="f4" line="31" inline="1"/>
  <Field id="_918" name="__routine" type="_601" offset="0" context="_15" access="public" location="f6:58" file="f6" line="58"/>
  <Field id="_919" name="__arg" type="_460" offset="32" context="_15" access="public" location="f6:59" file="f6" line="59"/>
  <Field id="_920" name="__next" type="_1991" offset="64" context="_15" access="public" location="f6:60" file="f6" line="60"/>
  <Destructor id="_921" name="__darwin_pthread_handler_rec" artificial="1" throw="" context="_15" access="public" mangled="_ZN28__darwin_pthread_handler_recD1Ev *INTERNAL* " demangled="__darwin_pthread_handler_rec::~__darwin_pthread_handler_rec()" location="f6:57" file="f6" line="57" endline="57" inline="1">
  </Destructor>
  <OperatorMethod id="_922" name="=" returns="_1992" artificial="1" throw="" context="_15" access="public" mangled="_ZN28__darwin_pthread_handler_recaSERKS_" demangled="__darwin_pthread_handler_rec::operator=(__darwin_pthread_handler_rec const&amp;)" location="f6:57" file="f6" line="57" endline="57" inline="1">
    <Argument type="_1993" location="f6:57" file="f6" line="57"/>
  </OperatorMethod>
  <Constructor id="_923" name="__darwin_pthread_handler_rec" artificial="1" throw="" context="_15" access="public" mangled="_ZN28__darwin_pthread_handler_recC1ERKS_ *INTERNAL* " demangled="__darwin_pthread_handler_rec::__darwin_pthread_handler_rec(__darwin_pthread_handler_rec const&amp;)" location="f6:57" file="f6" line="57" endline="57" inline="1">
    <Argument type="_1993" location="f6:57" file="f6" line="57"/>
  </Constructor>
  <Constructor id="_924" name="__darwin_pthread_handler_rec" artificial="1" throw="" context="_15" access="public" mangled="_ZN28__darwin_pthread_handler_recC1Ev *INTERNAL* " demangled="__darwin_pthread_handler_rec::__darwin_pthread_handler_rec()" location="f6:57" file="f6" line="57" inline="1"/>
  <Field id="_925" name="tm_sec" type="_18" offset="0" context="_17" access="public" location="f8:74" file="f8" line="74"/>
  <Field id="_926" name="tm_min" type="_18" offset="32" context="_17" access="public" location="f8:75" file="f8" line="75"/>
  <Field id="_927" name="tm_hour" type="_18" offset="64" context="_17" access="public" location="f8:76" file="f8" line="76"/>
  <Field id="_928" name="tm_mday" type="_18" offset="96" context="_17" access="public" location="f8:77" file="f8" line="77"/>
  <Field id="_929" name="tm_mon" type="_18" offset="128" context="_17" access="public" location="f8:78" file="f8" line="78"/>
  <Field id="_930" name="tm_year" type="_18" offset="160" context="_17" access="public" location="f8:79" file="f8" line="79"/>
  <Field id="_931" name="tm_wday" type="_18" offset="192" context="_17" access="public" location="f8:80" file="f8" line="80"/>
  <Field id="_932" name="tm_yday" type="_18" offset="224" context="_17" access="public" location="f8:81" file="f8" line="81"/>
  <Field id="_933" name="tm_isdst" type="_18" offset="256" context="_17" access="public" location="f8:82" file="f8" line="82"/>
  <Field id="_934" name="tm_gmtoff" type="_104" offset="288" context="_17" access="public" location="f8:83" file="f8" line="83"/>
  <Field id="_935" name="tm_zone" type="_266" offset="320" context="_17" access="public" location="f8:84" file="f8" line="84"/>
  <Destructor id="_936" name="tm" artificial="1" throw="" context="_17" access="public" mangled="_ZN2tmD1Ev *INTERNAL* " demangled="tm::~tm()" location="f8:73" file="f8" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_937" name="=" returns="_1994" artificial="1" throw="" context="_17" access="public" mangled="_ZN2tmaSERKS_" demangled="tm::operator=(tm const&amp;)" location="f8:73" file="f8" line="73" endline="73" inline="1">
    <Argument type="_1995" location="f8:73" file="f8" line="73"/>
  </OperatorMethod>
  <Constructor id="_938" name="tm" artificial="1" throw="" context="_17" access="public" mangled="_ZN2tmC1ERKS_ *INTERNAL* " demangled="tm::tm(tm const&amp;)" location="f8:73" file="f8" line="73" endline="73" inline="1">
    <Argument type="_1995" location="f8:73" file="f8" line="73"/>
  </Constructor>
  <Constructor id="_939" name="tm" artificial="1" throw="" context="_17" access="public" mangled="_ZN2tmC1Ev *INTERNAL* " demangled="tm::tm()" location="f8:73" file="f8" line="73" inline="1"/>
  <Field id="_940" name="pFiles" type="_1996" offset="0" context="_20" access="public" location="f2:613" file="f2" line="613"/>
  <Field id="_941" name="nFiles" type="_131" offset="32" context="_20" access="public" location="f2:614" file="f2" line="614"/>
  <Destructor id="_942" name="$_42" artificial="1" throw="" context="_20" access="public" mangled="_ZN15XnFlashFileListD1Ev *INTERNAL* " demangled="XnFlashFileList::~XnFlashFileList()" location="f2:615" file="f2" line="615" endline="615" inline="1">
  </Destructor>
  <OperatorMethod id="_943" name="=" returns="_1997" artificial="1" throw="" context="_20" access="public" mangled="_ZN15XnFlashFileListaSERKS_" demangled="XnFlashFileList::operator=(XnFlashFileList const&amp;)" location="f2:615" file="f2" line="615" endline="615" inline="1">
    <Argument type="_1998" location="f2:612" file="f2" line="612"/>
  </OperatorMethod>
  <Constructor id="_944" name="$_42" artificial="1" throw="" context="_20" access="public" mangled="_ZN15XnFlashFileListC1ERKS_ *INTERNAL* " demangled="XnFlashFileList::XnFlashFileList(XnFlashFileList const&amp;)" location="f2:615" file="f2" line="615" endline="615" inline="1">
    <Argument type="_1998" location="f2:612" file="f2" line="612"/>
  </Constructor>
  <Constructor id="_945" name="$_42" artificial="1" throw="" context="_20" access="public" mangled="_ZN15XnFlashFileListC1Ev *INTERNAL* " demangled="XnFlashFileList::XnFlashFileList()" location="f2:615" file="f2" line="615" inline="1"/>
  <PointerType id="_946" type="_508" size="32" align="32"/>
  <Field id="_947" name="__sig" type="_104" offset="0" context="_22" access="public" location="f6:69" file="f6" line="69"/>
  <Field id="_948" name="__opaque" type="_1999" offset="32" context="_22" access="public" location="f6:70" file="f6" line="70"/>
  <Destructor id="_949" name="_opaque_pthread_cond_t" artificial="1" throw="" context="_22" access="public" mangled="_ZN22_opaque_pthread_cond_tD1Ev *INTERNAL* " demangled="_opaque_pthread_cond_t::~_opaque_pthread_cond_t()" location="f6:68" file="f6" line="68" endline="68" inline="1">
  </Destructor>
  <OperatorMethod id="_950" name="=" returns="_2000" artificial="1" throw="" context="_22" access="public" mangled="_ZN22_opaque_pthread_cond_taSERKS_" demangled="_opaque_pthread_cond_t::operator=(_opaque_pthread_cond_t const&amp;)" location="f6:68" file="f6" line="68" endline="68" inline="1">
    <Argument type="_2001" location="f6:68" file="f6" line="68"/>
  </OperatorMethod>
  <Constructor id="_951" name="_opaque_pthread_cond_t" artificial="1" throw="" context="_22" access="public" mangled="_ZN22_opaque_pthread_cond_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_cond_t::_opaque_pthread_cond_t(_opaque_pthread_cond_t const&amp;)" location="f6:68" file="f6" line="68" endline="68" inline="1">
    <Argument type="_2001" location="f6:68" file="f6" line="68"/>
  </Constructor>
  <Constructor id="_952" name="_opaque_pthread_cond_t" artificial="1" throw="" context="_22" access="public" mangled="_ZN22_opaque_pthread_cond_tC1Ev *INTERNAL* " demangled="_opaque_pthread_cond_t::_opaque_pthread_cond_t()" location="f6:68" file="f6" line="68" inline="1"/>
  <Field id="_953" name="__dr0" type="_78" offset="0" context="_27" access="public" location="f13:424" file="f13" line="424"/>
  <Field id="_954" name="__dr1" type="_78" offset="32" context="_27" access="public" location="f13:425" file="f13" line="425"/>
  <Field id="_955" name="__dr2" type="_78" offset="64" context="_27" access="public" location="f13:426" file="f13" line="426"/>
  <Field id="_956" name="__dr3" type="_78" offset="96" context="_27" access="public" location="f13:427" file="f13" line="427"/>
  <Field id="_957" name="__dr4" type="_78" offset="128" context="_27" access="public" location="f13:428" file="f13" line="428"/>
  <Field id="_958" name="__dr5" type="_78" offset="160" context="_27" access="public" location="f13:429" file="f13" line="429"/>
  <Field id="_959" name="__dr6" type="_78" offset="192" context="_27" access="public" location="f13:430" file="f13" line="430"/>
  <Field id="_960" name="__dr7" type="_78" offset="224" context="_27" access="public" location="f13:431" file="f13" line="431"/>
  <Destructor id="_961" name="__darwin_x86_debug_state32" artificial="1" throw="" context="_27" access="public" mangled="_ZN26__darwin_x86_debug_state32D1Ev *INTERNAL* " demangled="__darwin_x86_debug_state32::~__darwin_x86_debug_state32()" location="f13:423" file="f13" line="423" endline="423" inline="1">
  </Destructor>
  <OperatorMethod id="_962" name="=" returns="_2002" artificial="1" throw="" context="_27" access="public" mangled="_ZN26__darwin_x86_debug_state32aSERKS_" demangled="__darwin_x86_debug_state32::operator=(__darwin_x86_debug_state32 const&amp;)" location="f13:423" file="f13" line="423" endline="423" inline="1">
    <Argument type="_2003" location="f13:423" file="f13" line="423"/>
  </OperatorMethod>
  <Constructor id="_963" name="__darwin_x86_debug_state32" artificial="1" throw="" context="_27" access="public" mangled="_ZN26__darwin_x86_debug_state32C1ERKS_ *INTERNAL* " demangled="__darwin_x86_debug_state32::__darwin_x86_debug_state32(__darwin_x86_debug_state32 const&amp;)" location="f13:423" file="f13" line="423" endline="423" inline="1">
    <Argument type="_2003" location="f13:423" file="f13" line="423"/>
  </Constructor>
  <Constructor id="_964" name="__darwin_x86_debug_state32" artificial="1" throw="" context="_27" access="public" mangled="_ZN26__darwin_x86_debug_state32C1Ev *INTERNAL* " demangled="__darwin_x86_debug_state32::__darwin_x86_debug_state32()" location="f13:423" file="f13" line="423" inline="1"/>
  <PointerType id="_965" type="_966" size="32" align="32"/>
  <FundamentalType id="_966" name="wchar_t" size="32" align="32"/>
  <Field id="_967" name="__es" type="_450" offset="0" context="_35" access="public" location="f14:40" file="f14" line="40"/>
  <Field id="_968" name="__ss" type="_294" offset="96" context="_35" access="public" location="f14:41" file="f14" line="41"/>
  <Field id="_969" name="__fs" type="_856" offset="608" context="_35" access="public" location="f14:42" file="f14" line="42"/>
  <Destructor id="_970" name="__darwin_mcontext32" artificial="1" throw="" context="_35" access="public" mangled="_ZN19__darwin_mcontext32D1Ev *INTERNAL* " demangled="__darwin_mcontext32::~__darwin_mcontext32()" location="f14:39" file="f14" line="39" endline="39" inline="1">
  </Destructor>
  <OperatorMethod id="_971" name="=" returns="_2004" artificial="1" throw="" context="_35" access="public" mangled="_ZN19__darwin_mcontext32aSERKS_" demangled="__darwin_mcontext32::operator=(__darwin_mcontext32 const&amp;)" location="f14:39" file="f14" line="39" endline="39" inline="1">
    <Argument type="_2005" location="f14:39" file="f14" line="39"/>
  </OperatorMethod>
  <Constructor id="_972" name="__darwin_mcontext32" artificial="1" throw="" context="_35" access="public" mangled="_ZN19__darwin_mcontext32C1ERKS_ *INTERNAL* " demangled="__darwin_mcontext32::__darwin_mcontext32(__darwin_mcontext32 const&amp;)" location="f14:39" file="f14" line="39" endline="39" inline="1">
    <Argument type="_2005" location="f14:39" file="f14" line="39"/>
  </Constructor>
  <Constructor id="_973" name="__darwin_mcontext32" artificial="1" throw="" context="_35" access="public" mangled="_ZN19__darwin_mcontext32C1Ev *INTERNAL* " demangled="__darwin_mcontext32::__darwin_mcontext32()" location="f14:39" file="f14" line="39" inline="1"/>
  <FundamentalType id="_974" name="complex float" size="64" align="32"/>
  <FundamentalType id="_975" name="complex long double" size="256" align="128"/>
  <PointerType id="_976" type="_977c" size="32" align="32"/>
  <FundamentalType id="_977" name="void" align="8"/>
  <PointerType id="_978" type="_280c" size="32" align="32"/>
  <PointerType id="_979" type="_266c" size="32" align="32"/>
  <Field id="_980" name="__es" type="_736" offset="0" context="_46" access="public" location="f14:78" file="f14" line="78"/>
  <Field id="_981" name="__ss" type="_552" offset="128" context="_46" access="public" location="f14:79" file="f14" line="79"/>
  <Field id="_982" name="__fs" type="_500" offset="1472" context="_46" access="public" location="f14:80" file="f14" line="80"/>
  <Destructor id="_983" name="__darwin_mcontext64" artificial="1" throw="" context="_46" access="public" mangled="_ZN19__darwin_mcontext64D1Ev *INTERNAL* " demangled="__darwin_mcontext64::~__darwin_mcontext64()" location="f14:77" file="f14" line="77" endline="77" inline="1">
  </Destructor>
  <OperatorMethod id="_984" name="=" returns="_2009" artificial="1" throw="" context="_46" access="public" mangled="_ZN19__darwin_mcontext64aSERKS_" demangled="__darwin_mcontext64::operator=(__darwin_mcontext64 const&amp;)" location="f14:77" file="f14" line="77" endline="77" inline="1">
    <Argument type="_2010" location="f14:77" file="f14" line="77"/>
  </OperatorMethod>
  <Constructor id="_985" name="__darwin_mcontext64" artificial="1" throw="" context="_46" access="public" mangled="_ZN19__darwin_mcontext64C1ERKS_ *INTERNAL* " demangled="__darwin_mcontext64::__darwin_mcontext64(__darwin_mcontext64 const&amp;)" location="f14:77" file="f14" line="77" endline="77" inline="1">
    <Argument type="_2010" location="f14:77" file="f14" line="77"/>
  </Constructor>
  <Constructor id="_986" name="__darwin_mcontext64" artificial="1" throw="" context="_46" access="public" mangled="_ZN19__darwin_mcontext64C1Ev *INTERNAL* " demangled="__darwin_mcontext64::__darwin_mcontext64()" location="f14:77" file="f14" line="77" inline="1"/>
  <Field id="_987" name="ss_sp" type="_460" offset="0" context="_54" access="public" location="f16:38" file="f16" line="38"/>
  <Field id="_988" name="ss_size" type="_217" offset="32" context="_54" access="public" location="f16:39" file="f16" line="39"/>
  <Field id="_989" name="ss_flags" type="_18" offset="64" context="_54" access="public" location="f16:40" file="f16" line="40"/>
  <Destructor id="_990" name="__darwin_sigaltstack" artificial="1" throw="" context="_54" access="public" mangled="_ZN20__darwin_sigaltstackD1Ev *INTERNAL* " demangled="__darwin_sigaltstack::~__darwin_sigaltstack()" location="f16:37" file="f16" line="37" endline="37" inline="1">
  </Destructor>
  <OperatorMethod id="_991" name="=" returns="_2011" artificial="1" throw="" context="_54" access="public" mangled="_ZN20__darwin_sigaltstackaSERKS_" demangled="__darwin_sigaltstack::operator=(__darwin_sigaltstack const&amp;)" location="f16:37" file="f16" line="37" endline="37" inline="1">
    <Argument type="_2012" location="f16:37" file="f16" line="37"/>
  </OperatorMethod>
  <Constructor id="_992" name="__darwin_sigaltstack" artificial="1" throw="" context="_54" access="public" mangled="_ZN20__darwin_sigaltstackC1ERKS_ *INTERNAL* " demangled="__darwin_sigaltstack::__darwin_sigaltstack(__darwin_sigaltstack const&amp;)" location="f16:37" file="f16" line="37" endline="37" inline="1">
    <Argument type="_2012" location="f16:37" file="f16" line="37"/>
  </Constructor>
  <Constructor id="_993" name="__darwin_sigaltstack" artificial="1" throw="" context="_54" access="public" mangled="_ZN20__darwin_sigaltstackC1Ev *INTERNAL* " demangled="__darwin_sigaltstack::__darwin_sigaltstack()" location="f16:37" file="f16" line="37" inline="1"/>
  <Field id="_994" name="__sig" type="_104" offset="0" context="_56" access="public" location="f6:79" file="f6" line="79"/>
  <Field id="_995" name="__opaque" type="_2013" offset="32" context="_56" access="public" location="f6:80" file="f6" line="80"/>
  <Destructor id="_996" name="_opaque_pthread_mutex_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN23_opaque_pthread_mutex_tD1Ev *INTERNAL* " demangled="_opaque_pthread_mutex_t::~_opaque_pthread_mutex_t()" location="f6:78" file="f6" line="78" endline="78" inline="1">
  </Destructor>
  <OperatorMethod id="_997" name="=" returns="_2014" artificial="1" throw="" context="_56" access="public" mangled="_ZN23_opaque_pthread_mutex_taSERKS_" demangled="_opaque_pthread_mutex_t::operator=(_opaque_pthread_mutex_t const&amp;)" location="f6:78" file="f6" line="78" endline="78" inline="1">
    <Argument type="_2015" location="f6:78" file="f6" line="78"/>
  </OperatorMethod>
  <Constructor id="_998" name="_opaque_pthread_mutex_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN23_opaque_pthread_mutex_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_mutex_t::_opaque_pthread_mutex_t(_opaque_pthread_mutex_t const&amp;)" location="f6:78" file="f6" line="78" endline="78" inline="1">
    <Argument type="_2015" location="f6:78" file="f6" line="78"/>
  </Constructor>
  <Constructor id="_999" name="_opaque_pthread_mutex_t" artificial="1" throw="" context="_56" access="public" mangled="_ZN23_opaque_pthread_mutex_tC1Ev *INTERNAL* " demangled="_opaque_pthread_mutex_t::_opaque_pthread_mutex_t()" location="f6:78" file="f6" line="78" inline="1"/>
  <Field id="_1000" name="nId" type="_131" offset="0" context="_58" access="public" location="f2:582" file="f2" line="582"/>
  <Field id="_1001" name="nAttribs" type="_131" offset="16" context="_58" access="public" location="f2:583" file="f2" line="583"/>
  <Destructor id="_1002" name="$_38" artificial="1" throw="" context="_58" access="public" mangled="_ZN16XnFileAttributesD1Ev *INTERNAL* " demangled="XnFileAttributes::~XnFileAttributes()" location="f2:584" file="f2" line="584" endline="584" inline="1">
  </Destructor>
  <OperatorMethod id="_1003" name="=" returns="_2016" artificial="1" throw="" context="_58" access="public" mangled="_ZN16XnFileAttributesaSERKS_" demangled="XnFileAttributes::operator=(XnFileAttributes const&amp;)" location="f2:584" file="f2" line="584" endline="584" inline="1">
    <Argument type="_2017" location="f2:581" file="f2" line="581"/>
  </OperatorMethod>
  <Constructor id="_1004" name="$_38" artificial="1" throw="" context="_58" access="public" mangled="_ZN16XnFileAttributesC1ERKS_ *INTERNAL* " demangled="XnFileAttributes::XnFileAttributes(XnFileAttributes const&amp;)" location="f2:584" file="f2" line="584" endline="584" inline="1">
    <Argument type="_2017" location="f2:581" file="f2" line="581"/>
  </Constructor>
  <Constructor id="_1005" name="$_38" artificial="1" throw="" context="_58" access="public" mangled="_ZN16XnFileAttributesC1Ev *INTERNAL* " demangled="XnFileAttributes::XnFileAttributes()" location="f2:584" file="f2" line="584" inline="1"/>
  <ArrayType id="_1006" min="0" max="" type="_266" align="32"/>
  <Field id="_1007" name="nParam" type="_130" offset="0" context="_66" access="public" location="f2:464" file="f2" line="464"/>
  <Field id="_1008" name="nValue" type="_130" offset="16" context="_66" access="public" location="f2:465" file="f2" line="465"/>
  <Destructor id="_1009" name="$_37" artificial="1" throw="" context="_66" access="public" mangled="_ZN16XnInnerParamDataD1Ev *INTERNAL* " demangled="XnInnerParamData::~XnInnerParamData()" location="f2:466" file="f2" line="466" endline="466" inline="1">
  </Destructor>
  <OperatorMethod id="_1010" name="=" returns="_2018" artificial="1" throw="" context="_66" access="public" mangled="_ZN16XnInnerParamDataaSERKS_" demangled="XnInnerParamData::operator=(XnInnerParamData const&amp;)" location="f2:466" file="f2" line="466" endline="466" inline="1">
    <Argument type="_2019" location="f2:463" file="f2" line="463"/>
  </OperatorMethod>
  <Constructor id="_1011" name="$_37" artificial="1" throw="" context="_66" access="public" mangled="_ZN16XnInnerParamDataC1ERKS_ *INTERNAL* " demangled="XnInnerParamData::XnInnerParamData(XnInnerParamData const&amp;)" location="f2:466" file="f2" line="466" endline="466" inline="1">
    <Argument type="_2019" location="f2:463" file="f2" line="463"/>
  </Constructor>
  <Constructor id="_1012" name="$_37" artificial="1" throw="" context="_66" access="public" mangled="_ZN16XnInnerParamDataC1Ev *INTERNAL* " demangled="XnInnerParamData::XnInnerParamData()" location="f2:466" file="f2" line="466" inline="1"/>
  <PointerType id="_1013" type="_18" size="32" align="32"/>
  <PointerType id="_1014" type="_280" size="32" align="32"/>
  <PointerType id="_1015" type="_266" size="32" align="32"/>
  <Field id="_1016" name="nBin" type="_130" offset="0" context="_80" access="public" location="f2:470" file="f2" line="470"/>
  <Field id="_1017" name="nMin" type="_130" offset="16" context="_80" access="public" location="f2:471" file="f2" line="471"/>
  <Field id="_1018" name="nMax" type="_130" offset="32" context="_80" access="public" location="f2:472" file="f2" line="472"/>
  <Destructor id="_1019" name="XnDepthAGCBin" artificial="1" throw="" context="_80" access="public" mangled="_ZN13XnDepthAGCBinD1Ev *INTERNAL* " demangled="XnDepthAGCBin::~XnDepthAGCBin()" location="f2:469" file="f2" line="469" endline="469" inline="1">
  </Destructor>
  <OperatorMethod id="_1020" name="=" returns="_2020" artificial="1" throw="" context="_80" access="public" mangled="_ZN13XnDepthAGCBinaSERKS_" demangled="XnDepthAGCBin::operator=(XnDepthAGCBin const&amp;)" location="f2:469" file="f2" line="469" endline="469" inline="1">
    <Argument type="_2021" location="f2:469" file="f2" line="469"/>
  </OperatorMethod>
  <Constructor id="_1021" name="XnDepthAGCBin" artificial="1" throw="" context="_80" access="public" mangled="_ZN13XnDepthAGCBinC1ERKS_ *INTERNAL* " demangled="XnDepthAGCBin::XnDepthAGCBin(XnDepthAGCBin const&amp;)" location="f2:469" file="f2" line="469" endline="469" inline="1">
    <Argument type="_2021" location="f2:469" file="f2" line="469"/>
  </Constructor>
  <Constructor id="_1022" name="XnDepthAGCBin" artificial="1" throw="" context="_80" access="public" mangled="_ZN13XnDepthAGCBinC1Ev *INTERNAL* " demangled="XnDepthAGCBin::XnDepthAGCBin()" location="f2:469" file="f2" line="469" inline="1"/>
  <FundamentalType id="_1023" name="complex double" size="128" align="64"/>
  <Field id="_1024" name="dataSize" type="_18" offset="0" context="_96" access="public" location="f19:97" file="f19" line="97"/>
  <Field id="_1025" name="data" type="_460" offset="32" context="_96" access="public" location="f19:98" file="f19" line="98"/>
  <Field id="_1026" name="sensorType" type="_653" offset="64" context="_96" access="public" location="f19:100" file="f19" line="100"/>
  <Field id="_1027" name="timestamp" type="_900" offset="96" context="_96" access="public" location="f19:101" file="f19" line="101"/>
  <Field id="_1028" name="frameIndex" type="_18" offset="160" context="_96" access="public" location="f19:102" file="f19" line="102"/>
  <Field id="_1029" name="width" type="_18" offset="192" context="_96" access="public" location="f19:104" file="f19" line="104"/>
  <Field id="_1030" name="height" type="_18" offset="224" context="_96" access="public" location="f19:105" file="f19" line="105"/>
  <Field id="_1031" name="videoMode" type="_303" offset="256" context="_96" access="public" location="f19:107" file="f19" line="107"/>
  <Field id="_1032" name="croppingEnabled" type="_297" offset="384" context="_96" access="public" location="f19:108" file="f19" line="108"/>
  <Field id="_1033" name="cropOriginX" type="_18" offset="416" context="_96" access="public" location="f19:109" file="f19" line="109"/>
  <Field id="_1034" name="cropOriginY" type="_18" offset="448" context="_96" access="public" location="f19:110" file="f19" line="110"/>
  <Field id="_1035" name="stride" type="_18" offset="480" context="_96" access="public" location="f19:112" file="f19" line="112"/>
  <Destructor id="_1036" name="$_17" artificial="1" throw="" context="_96" access="public" mangled="_ZN8OniFrameD1Ev *INTERNAL* " demangled="OniFrame::~OniFrame()" location="f19:113" file="f19" line="113" endline="113" inline="1">
  </Destructor>
  <OperatorMethod id="_1037" name="=" returns="_2022" artificial="1" throw="" context="_96" access="public" mangled="_ZN8OniFrameaSERKS_" demangled="OniFrame::operator=(OniFrame const&amp;)" location="f19:113" file="f19" line="113" endline="113" inline="1">
    <Argument type="_2023" location="f19:96" file="f19" line="96"/>
  </OperatorMethod>
  <Constructor id="_1038" name="$_17" artificial="1" throw="" context="_96" access="public" mangled="_ZN8OniFrameC1ERKS_ *INTERNAL* " demangled="OniFrame::OniFrame(OniFrame const&amp;)" location="f19:113" file="f19" line="113" endline="113" inline="1">
    <Argument type="_2023" location="f19:96" file="f19" line="96"/>
  </Constructor>
  <Constructor id="_1039" name="$_17" artificial="1" throw="" context="_96" access="public" mangled="_ZN8OniFrameC1Ev *INTERNAL* " demangled="OniFrame::OniFrame()" location="f19:113" file="f19" line="113" inline="1"/>
  <PointerType id="_1040" type="_130" size="32" align="32"/>
  <PointerType id="_1041" type="_873c" size="32" align="32"/>
  <PointerType id="_1042" type="_598" size="32" align="32"/>
  <Field id="_1043" name="si_signo" type="_18" offset="0" context="_128" access="public" location="f24:177" file="f24" line="177"/>
  <Field id="_1044" name="si_errno" type="_18" offset="32" context="_128" access="public" location="f24:178" file="f24" line="178"/>
  <Field id="_1045" name="si_code" type="_18" offset="64" context="_128" access="public" location="f24:179" file="f24" line="179"/>
  <Field id="_1046" name="si_pid" type="_546" offset="96" context="_128" access="public" location="f24:180" file="f24" line="180"/>
  <Field id="_1047" name="si_uid" type="_814" offset="128" context="_128" access="public" location="f24:181" file="f24" line="181"/>
  <Field id="_1048" name="si_status" type="_18" offset="160" context="_128" access="public" location="f24:182" file="f24" line="182"/>
  <Field id="_1049" name="si_addr" type="_460" offset="192" context="_128" access="public" location="f24:183" file="f24" line="183"/>
  <Field id="_1050" name="si_value" type="_488" offset="224" context="_128" access="public" location="f24:184" file="f24" line="184"/>
  <Field id="_1051" name="si_band" type="_104" offset="256" context="_128" access="public" location="f24:185" file="f24" line="185"/>
  <Field id="_1052" name="__pad" type="_2025" offset="288" context="_128" access="public" location="f24:186" file="f24" line="186"/>
  <Destructor id="_1053" name="__siginfo" artificial="1" throw="" context="_128" access="public" mangled="_ZN9__siginfoD1Ev *INTERNAL* " demangled="__siginfo::~__siginfo()" location="f24:176" file="f24" line="176" endline="176" inline="1">
  </Destructor>
  <OperatorMethod id="_1054" name="=" returns="_2026" artificial="1" throw="" context="_128" access="public" mangled="_ZN9__siginfoaSERKS_" demangled="__siginfo::operator=(__siginfo const&amp;)" location="f24:176" file="f24" line="176" endline="176" inline="1">
    <Argument type="_2027" location="f24:176" file="f24" line="176"/>
  </OperatorMethod>
  <Constructor id="_1055" name="__siginfo" artificial="1" throw="" context="_128" access="public" mangled="_ZN9__siginfoC1ERKS_ *INTERNAL* " demangled="__siginfo::__siginfo(__siginfo const&amp;)" location="f24:176" file="f24" line="176" endline="176" inline="1">
    <Argument type="_2027" location="f24:176" file="f24" line="176"/>
  </Constructor>
  <Constructor id="_1056" name="__siginfo" artificial="1" throw="" context="_128" access="public" mangled="_ZN9__siginfoC1Ev *INTERNAL* " demangled="__siginfo::__siginfo()" location="f24:176" file="f24" line="176" inline="1"/>
  <PointerType id="_1057" type="_966c" size="32" align="32"/>
  <PointerType id="_1058" type="_687c" size="32" align="32"/>
  <PointerType id="_1059" type="_687" size="32" align="32"/>
  <Field id="_1060" name="m_SetPointVoltage" type="_131" offset="0" context="_173" access="public" location="f2:539" file="f2" line="539"/>
  <Field id="_1061" name="m_CompensationVoltage" type="_131" offset="16" context="_173" access="public" location="f2:540" file="f2" line="540"/>
  <Field id="_1062" name="m_TecDutyCycle" type="_131" offset="32" context="_173" access="public" location="f2:541" file="f2" line="541"/>
  <Field id="_1063" name="m_HeatMode" type="_131" offset="48" context="_173" access="public" location="f2:542" file="f2" line="542"/>
  <Field id="_1064" name="m_ProportionalError" type="_684" offset="64" context="_173" access="public" location="f2:543" file="f2" line="543"/>
  <Field id="_1065" name="m_IntegralError" type="_684" offset="96" context="_173" access="public" location="f2:544" file="f2" line="544"/>
  <Field id="_1066" name="m_DerivativeError" type="_684" offset="128" context="_173" access="public" location="f2:545" file="f2" line="545"/>
  <Field id="_1067" name="m_ScanMode" type="_131" offset="160" context="_173" access="public" location="f2:546" file="f2" line="546"/>
  <Destructor id="_1068" name="XnTecData" artificial="1" throw="" context="_173" access="public" mangled="_ZN9XnTecDataD1Ev *INTERNAL* " demangled="XnTecData::~XnTecData()" location="f2:538" file="f2" line="538" endline="538" inline="1">
  </Destructor>
  <OperatorMethod id="_1069" name="=" returns="_2030" artificial="1" throw="" context="_173" access="public" mangled="_ZN9XnTecDataaSERKS_" demangled="XnTecData::operator=(XnTecData const&amp;)" location="f2:538" file="f2" line="538" endline="538" inline="1">
    <Argument type="_2031" location="f2:538" file="f2" line="538"/>
  </OperatorMethod>
  <Constructor id="_1070" name="XnTecData" artificial="1" throw="" context="_173" access="public" mangled="_ZN9XnTecDataC1ERKS_ *INTERNAL* " demangled="XnTecData::XnTecData(XnTecData const&amp;)" location="f2:538" file="f2" line="538" endline="538" inline="1">
    <Argument type="_2031" location="f2:538" file="f2" line="538"/>
  </Constructor>
  <Constructor id="_1071" name="XnTecData" artificial="1" throw="" context="_173" access="public" mangled="_ZN9XnTecDataC1Ev *INTERNAL* " demangled="XnTecData::XnTecData()" location="f2:538" file="f2" line="538" inline="1"/>
  <PointerType id="_1072" type="_12c" size="32" align="32"/>
  <PointerType id="_1073" type="_814" size="32" align="32"/>
  <PointerType id="_1074" type="_262" size="32" align="32"/>
  <PointerType id="_1075" type="_2033" size="32" align="32"/>
  <PointerType id="_1076" type="_104" size="32" align="32"/>
  <PointerType id="_1077" type="_2034" size="32" align="32"/>
  <PointerType id="_1078" type="_2035" size="32" align="32"/>
  <PointerType id="_1079" type="_2036" size="32" align="32"/>
  <PointerType id="_1080" type="_2037" size="32" align="32"/>
  <PointerType id="_1082" type="_17" size="32" align="32"/>
  <PointerType id="_1083" type="_105c" size="32" align="32"/>
  <PointerType id="_1084" type="_978" size="32" align="32"/>
  <Field id="_1085" name="_base" type="_1014" offset="0" context="_213" access="public" location="f10:89" file="f10" line="89"/>
  <Field id="_1086" name="_size" type="_18" offset="32" context="_213" access="public" location="f10:90" file="f10" line="90"/>
  <Destructor id="_1087" name="__sbuf" artificial="1" throw="" context="_213" access="public" mangled="_ZN6__sbufD1Ev *INTERNAL* " demangled="__sbuf::~__sbuf()" location="f10:88" file="f10" line="88" endline="88" inline="1">
  </Destructor>
  <OperatorMethod id="_1088" name="=" returns="_2039" artificial="1" throw="" context="_213" access="public" mangled="_ZN6__sbufaSERKS_" demangled="__sbuf::operator=(__sbuf const&amp;)" location="f10:88" file="f10" line="88" endline="88" inline="1">
    <Argument type="_2040" location="f10:88" file="f10" line="88"/>
  </OperatorMethod>
  <Constructor id="_1089" name="__sbuf" artificial="1" throw="" context="_213" access="public" mangled="_ZN6__sbufC1ERKS_ *INTERNAL* " demangled="__sbuf::__sbuf(__sbuf const&amp;)" location="f10:88" file="f10" line="88" endline="88" inline="1">
    <Argument type="_2040" location="f10:88" file="f10" line="88"/>
  </Constructor>
  <Constructor id="_1090" name="__sbuf" artificial="1" throw="" context="_213" access="public" mangled="_ZN6__sbufC1Ev *INTERNAL* " demangled="__sbuf::__sbuf()" location="f10:88" file="f10" line="88" inline="1"/>
  <Field id="_1091" name="__invalid" bits="1" type="_130" offset="0" context="_220" access="public" location="f13:91" file="f13" line="91"/>
  <Field id="_1092" name="__denorm" bits="1" type="_130" offset="1" context="_220" access="public" location="f13:92" file="f13" line="92"/>
  <Field id="_1093" name="__zdiv" bits="1" type="_130" offset="2" context="_220" access="public" location="f13:93" file="f13" line="93"/>
  <Field id="_1094" name="__ovrfl" bits="1" type="_130" offset="3" context="_220" access="public" location="f13:94" file="f13" line="94"/>
  <Field id="_1095" name="__undfl" bits="1" type="_130" offset="4" context="_220" access="public" location="f13:95" file="f13" line="95"/>
  <Field id="_1096" name="__precis" bits="1" type="_130" offset="5" context="_220" access="public" location="f13:96" file="f13" line="96"/>
  <Field id="_1097" name="" bits="2" type="_130" offset="6" context="_220" access="public" location="f13:97" file="f13" line="97"/>
  <Field id="_1098" name="__pc" bits="2" type="_130" offset="8" context="_220" access="public" location="f13:98" file="f13" line="98"/>
  <Field id="_1099" name="__rc" bits="2" type="_130" offset="10" context="_220" access="public" location="f13:104" file="f13" line="104"/>
  <Field id="_1100" name="" bits="1" type="_130" offset="12" context="_220" access="public" location="f13:111" file="f13" line="111"/>
  <Field id="_1101" name="" bits="3" type="_130" offset="13" context="_220" access="public" location="f13:112" file="f13" line="112"/>
  <Destructor id="_1102" name="__darwin_fp_control" artificial="1" throw="" context="_220" access="public" mangled="_ZN19__darwin_fp_controlD1Ev *INTERNAL* " demangled="__darwin_fp_control::~__darwin_fp_control()" location="f13:90" file="f13" line="90" endline="90" inline="1">
  </Destructor>
  <OperatorMethod id="_1103" name="=" returns="_2041" artificial="1" throw="" context="_220" access="public" mangled="_ZN19__darwin_fp_controlaSERKS_" demangled="__darwin_fp_control::operator=(__darwin_fp_control const&amp;)" location="f13:90" file="f13" line="90" endline="90" inline="1">
    <Argument type="_2042" location="f13:90" file="f13" line="90"/>
  </OperatorMethod>
  <Constructor id="_1104" name="__darwin_fp_control" artificial="1" throw="" context="_220" access="public" mangled="_ZN19__darwin_fp_controlC1ERKS_ *INTERNAL* " demangled="__darwin_fp_control::__darwin_fp_control(__darwin_fp_control const&amp;)" location="f13:90" file="f13" line="90" endline="90" inline="1">
    <Argument type="_2042" location="f13:90" file="f13" line="90"/>
  </Constructor>
  <Constructor id="_1105" name="__darwin_fp_control" artificial="1" throw="" context="_220" access="public" mangled="_ZN19__darwin_fp_controlC1Ev *INTERNAL* " demangled="__darwin_fp_control::__darwin_fp_control()" location="f13:90" file="f13" line="90" inline="1"/>
  <PointerType id="_1107" type="_2043" size="32" align="32"/>
  <PointerType id="_1108" type="_78" size="32" align="32"/>
  <Field id="_1109" name="uri" type="_2044" offset="0" context="_244" access="public" location="f19:78" file="f19" line="78"/>
  <Field id="_1110" name="vendor" type="_2044" offset="2048" context="_244" access="public" location="f19:79" file="f19" line="79"/>
  <Field id="_1111" name="name" type="_2044" offset="4096" context="_244" access="public" location="f19:80" file="f19" line="80"/>
  <Field id="_1112" name="usbVendorId" type="_131" offset="6144" context="_244" access="public" location="f19:81" file="f19" line="81"/>
  <Field id="_1113" name="usbProductId" type="_131" offset="6160" context="_244" access="public" location="f19:82" file="f19" line="82"/>
  <Destructor id="_1114" name="$_16" artificial="1" throw="" context="_244" access="public" mangled="_ZN13OniDeviceInfoD1Ev *INTERNAL* " demangled="OniDeviceInfo::~OniDeviceInfo()" location="f19:83" file="f19" line="83" endline="83" inline="1">
  </Destructor>
  <OperatorMethod id="_1115" name="=" returns="_2045" artificial="1" throw="" context="_244" access="public" mangled="_ZN13OniDeviceInfoaSERKS_" demangled="OniDeviceInfo::operator=(OniDeviceInfo const&amp;)" location="f19:83" file="f19" line="83" endline="83" inline="1">
    <Argument type="_2046" location="f19:77" file="f19" line="77"/>
  </OperatorMethod>
  <Constructor id="_1116" name="$_16" artificial="1" throw="" context="_244" access="public" mangled="_ZN13OniDeviceInfoC1ERKS_ *INTERNAL* " demangled="OniDeviceInfo::OniDeviceInfo(OniDeviceInfo const&amp;)" location="f19:83" file="f19" line="83" endline="83" inline="1">
    <Argument type="_2046" location="f19:77" file="f19" line="77"/>
  </Constructor>
  <Constructor id="_1117" name="$_16" artificial="1" throw="" context="_244" access="public" mangled="_ZN13OniDeviceInfoC1Ev *INTERNAL* " demangled="OniDeviceInfo::OniDeviceInfo()" location="f19:83" file="f19" line="83" inline="1"/>
  <PointerType id="_1118" type="_852" size="32" align="32"/>
  <PointerType id="_1119" type="_106" size="32" align="32"/>
  <PointerType id="_1120" type="_113" size="32" align="32"/>
  <Field id="_1121" name="__mbstate8" type="_2047" offset="0" context="_257" access="public" location="f20:77" file="f20" line="77"/>
  <Field id="_1122" name="_mbstateL" type="_13" offset="0" context="_257" access="public" location="f20:78" file="f20" line="78"/>
  <Destructor id="_1123" name="$_0" artificial="1" throw="" context="_257" access="public" mangled="_ZN11__mbstate_tD1Ev *INTERNAL* " demangled="__mbstate_t::~__mbstate_t()" location="f20:79" file="f20" line="79" endline="79" inline="1">
  </Destructor>
  <OperatorMethod id="_1124" name="=" returns="_2048" artificial="1" throw="" context="_257" access="public" mangled="_ZN11__mbstate_taSERKS_" demangled="__mbstate_t::operator=(__mbstate_t const&amp;)" location="f20:79" file="f20" line="79" endline="79" inline="1">
    <Argument type="_2049" location="f20:76" file="f20" line="76"/>
  </OperatorMethod>
  <Constructor id="_1125" name="$_0" artificial="1" throw="" context="_257" access="public" mangled="_ZN11__mbstate_tC1ERKS_ *INTERNAL* " demangled="__mbstate_t::__mbstate_t(__mbstate_t const&amp;)" location="f20:79" file="f20" line="79" endline="79" inline="1">
    <Argument type="_2049" location="f20:76" file="f20" line="76"/>
  </Constructor>
  <Constructor id="_1126" name="$_0" artificial="1" throw="" context="_257" access="public" mangled="_ZN11__mbstate_tC1Ev *INTERNAL* " demangled="__mbstate_t::__mbstate_t()" location="f20:79" file="f20" line="79" inline="1"/>
  <Field id="_1127" name="ss_sp" type="_266" offset="0" context="_260" access="public" location="f24:367" file="f24" line="367"/>
  <Field id="_1128" name="ss_onstack" type="_18" offset="32" context="_260" access="public" location="f24:368" file="f24" line="368"/>
  <Destructor id="_1129" name="sigstack" artificial="1" throw="" context="_260" access="public" mangled="_ZN8sigstackD1Ev *INTERNAL* " demangled="sigstack::~sigstack()" location="f24:366" file="f24" line="366" endline="366" inline="1">
  </Destructor>
  <OperatorMethod id="_1130" name="=" returns="_2050" artificial="1" throw="" context="_260" access="public" mangled="_ZN8sigstackaSERKS_" demangled="sigstack::operator=(sigstack const&amp;)" location="f24:366" file="f24" line="366" endline="366" inline="1">
    <Argument type="_2051" location="f24:366" file="f24" line="366"/>
  </OperatorMethod>
  <Constructor id="_1131" name="sigstack" artificial="1" throw="" context="_260" access="public" mangled="_ZN8sigstackC1ERKS_ *INTERNAL* " demangled="sigstack::sigstack(sigstack const&amp;)" location="f24:366" file="f24" line="366" endline="366" inline="1">
    <Argument type="_2051" location="f24:366" file="f24" line="366"/>
  </Constructor>
  <Constructor id="_1132" name="sigstack" artificial="1" throw="" context="_260" access="public" mangled="_ZN8sigstackC1Ev *INTERNAL* " demangled="sigstack::sigstack()" location="f24:366" file="f24" line="366" inline="1"/>
  <Field id="_1133" name="wm_flags" type="_371" offset="0" context="_265" access="public" location="f31:354" file="f31" line="354"/>
  <Field id="_1134" name="wm_rate" type="_684" offset="32" context="_265" access="public" location="f31:355" file="f31" line="355"/>
  <Destructor id="_1135" name="proc_rlimit_control_wakeupmon" artificial="1" throw="" context="_265" access="public" mangled="_ZN29proc_rlimit_control_wakeupmonD1Ev *INTERNAL* " demangled="proc_rlimit_control_wakeupmon::~proc_rlimit_control_wakeupmon()" location="f31:353" file="f31" line="353" endline="353" inline="1">
  </Destructor>
  <OperatorMethod id="_1136" name="=" returns="_2052" artificial="1" throw="" context="_265" access="public" mangled="_ZN29proc_rlimit_control_wakeupmonaSERKS_" demangled="proc_rlimit_control_wakeupmon::operator=(proc_rlimit_control_wakeupmon const&amp;)" location="f31:353" file="f31" line="353" endline="353" inline="1">
    <Argument type="_2053" location="f31:353" file="f31" line="353"/>
  </OperatorMethod>
  <Constructor id="_1137" name="proc_rlimit_control_wakeupmon" artificial="1" throw="" context="_265" access="public" mangled="_ZN29proc_rlimit_control_wakeupmonC1ERKS_ *INTERNAL* " demangled="proc_rlimit_control_wakeupmon::proc_rlimit_control_wakeupmon(proc_rlimit_control_wakeupmon const&amp;)" location="f31:353" file="f31" line="353" endline="353" inline="1">
    <Argument type="_2053" location="f31:353" file="f31" line="353"/>
  </Constructor>
  <Constructor id="_1138" name="proc_rlimit_control_wakeupmon" artificial="1" throw="" context="_265" access="public" mangled="_ZN29proc_rlimit_control_wakeupmonC1Ev *INTERNAL* " demangled="proc_rlimit_control_wakeupmon::proc_rlimit_control_wakeupmon()" location="f31:353" file="f31" line="353" inline="1"/>
  <CvQualifiedType id="_1082c" type="_1082" const="1"/>
  <PointerType id="_1141" type="_12" size="32" align="32"/>
  <Field id="_1142" name="nCmosID" type="_312" offset="0" context="_284" access="public" location="f2:507" file="f2" line="507"/>
  <Field id="_1143" name="nTimeInMilliseconds" type="_910" offset="32" context="_284" access="public" location="f2:508" file="f2" line="508"/>
  <Field id="_1144" name="nNumberOfFrames" type="_131" offset="64" context="_284" access="public" location="f2:509" file="f2" line="509"/>
  <Destructor id="_1145" name="XnCmosBlankingTime" artificial="1" throw="" context="_284" access="public" mangled="_ZN18XnCmosBlankingTimeD1Ev *INTERNAL* " demangled="XnCmosBlankingTime::~XnCmosBlankingTime()" location="f2:506" file="f2" line="506" endline="506" inline="1">
  </Destructor>
  <OperatorMethod id="_1146" name="=" returns="_2054" artificial="1" throw="" context="_284" access="public" mangled="_ZN18XnCmosBlankingTimeaSERKS_" demangled="XnCmosBlankingTime::operator=(XnCmosBlankingTime const&amp;)" location="f2:506" file="f2" line="506" endline="506" inline="1">
    <Argument type="_2055" location="f2:506" file="f2" line="506"/>
  </OperatorMethod>
  <Constructor id="_1147" name="XnCmosBlankingTime" artificial="1" throw="" context="_284" access="public" mangled="_ZN18XnCmosBlankingTimeC1ERKS_ *INTERNAL* " demangled="XnCmosBlankingTime::XnCmosBlankingTime(XnCmosBlankingTime const&amp;)" location="f2:506" file="f2" line="506" endline="506" inline="1">
    <Argument type="_2055" location="f2:506" file="f2" line="506"/>
  </Constructor>
  <Constructor id="_1148" name="XnCmosBlankingTime" artificial="1" throw="" context="_284" access="public" mangled="_ZN18XnCmosBlankingTimeC1Ev *INTERNAL* " demangled="XnCmosBlankingTime::XnCmosBlankingTime()" location="f2:506" file="f2" line="506" inline="1"/>
  <ArrayType id="_1149" min="0" max="" type="_908" align="32"/>
  <CvQualifiedType id="_1149c" type="_1149" const="1"/>
  <Field id="_1151" name="__eax" type="_78" offset="0" context="_294" access="public" location="f13:45" file="f13" line="45"/>
  <Field id="_1152" name="__ebx" type="_78" offset="32" context="_294" access="public" location="f13:46" file="f13" line="46"/>
  <Field id="_1153" name="__ecx" type="_78" offset="64" context="_294" access="public" location="f13:47" file="f13" line="47"/>
  <Field id="_1154" name="__edx" type="_78" offset="96" context="_294" access="public" location="f13:48" file="f13" line="48"/>
  <Field id="_1155" name="__edi" type="_78" offset="128" context="_294" access="public" location="f13:49" file="f13" line="49"/>
  <Field id="_1156" name="__esi" type="_78" offset="160" context="_294" access="public" location="f13:50" file="f13" line="50"/>
  <Field id="_1157" name="__ebp" type="_78" offset="192" context="_294" access="public" location="f13:51" file="f13" line="51"/>
  <Field id="_1158" name="__esp" type="_78" offset="224" context="_294" access="public" location="f13:52" file="f13" line="52"/>
  <Field id="_1159" name="__ss" type="_78" offset="256" context="_294" access="public" location="f13:53" file="f13" line="53"/>
  <Field id="_1160" name="__eflags" type="_78" offset="288" context="_294" access="public" location="f13:54" file="f13" line="54"/>
  <Field id="_1161" name="__eip" type="_78" offset="320" context="_294" access="public" location="f13:55" file="f13" line="55"/>
  <Field id="_1162" name="__cs" type="_78" offset="352" context="_294" access="public" location="f13:56" file="f13" line="56"/>
  <Field id="_1163" name="__ds" type="_78" offset="384" context="_294" access="public" location="f13:57" file="f13" line="57"/>
  <Field id="_1164" name="__es" type="_78" offset="416" context="_294" access="public" location="f13:58" file="f13" line="58"/>
  <Field id="_1165" name="__fs" type="_78" offset="448" context="_294" access="public" location="f13:59" file="f13" line="59"/>
  <Field id="_1166" name="__gs" type="_78" offset="480" context="_294" access="public" location="f13:60" file="f13" line="60"/>
  <Destructor id="_1167" name="__darwin_i386_thread_state" artificial="1" throw="" context="_294" access="public" mangled="_ZN26__darwin_i386_thread_stateD1Ev *INTERNAL* " demangled="__darwin_i386_thread_state::~__darwin_i386_thread_state()" location="f13:44" file="f13" line="44" endline="44" inline="1">
  </Destructor>
  <OperatorMethod id="_1168" name="=" returns="_2056" artificial="1" throw="" context="_294" access="public" mangled="_ZN26__darwin_i386_thread_stateaSERKS_" demangled="__darwin_i386_thread_state::operator=(__darwin_i386_thread_state const&amp;)" location="f13:44" file="f13" line="44" endline="44" inline="1">
    <Argument type="_2057" location="f13:44" file="f13" line="44"/>
  </OperatorMethod>
  <Constructor id="_1169" name="__darwin_i386_thread_state" artificial="1" throw="" context="_294" access="public" mangled="_ZN26__darwin_i386_thread_stateC1ERKS_ *INTERNAL* " demangled="__darwin_i386_thread_state::__darwin_i386_thread_state(__darwin_i386_thread_state const&amp;)" location="f13:44" file="f13" line="44" endline="44" inline="1">
    <Argument type="_2057" location="f13:44" file="f13" line="44"/>
  </Constructor>
  <Constructor id="_1170" name="__darwin_i386_thread_state" artificial="1" throw="" context="_294" access="public" mangled="_ZN26__darwin_i386_thread_stateC1Ev *INTERNAL* " demangled="__darwin_i386_thread_state::__darwin_i386_thread_state()" location="f13:44" file="f13" line="44" inline="1"/>
  <Field id="_1171" name="major" type="_18" offset="0" context="_302" access="public" location="f19:47" file="f19" line="47"/>
  <Field id="_1172" name="minor" type="_18" offset="32" context="_302" access="public" location="f19:49" file="f19" line="49"/>
  <Field id="_1173" name="maintenance" type="_18" offset="64" context="_302" access="public" location="f19:51" file="f19" line="51"/>
  <Field id="_1174" name="build" type="_18" offset="96" context="_302" access="public" location="f19:53" file="f19" line="53"/>
  <Destructor id="_1175" name="$_13" artificial="1" throw="" context="_302" access="public" mangled="_ZN10OniVersionD1Ev *INTERNAL* " demangled="OniVersion::~OniVersion()" location="f19:54" file="f19" line="54" endline="54" inline="1">
  </Destructor>
  <OperatorMethod id="_1176" name="=" returns="_2058" artificial="1" throw="" context="_302" access="public" mangled="_ZN10OniVersionaSERKS_" demangled="OniVersion::operator=(OniVersion const&amp;)" location="f19:54" file="f19" line="54" endline="54" inline="1">
    <Argument type="_2059" location="f19:45" file="f19" line="45"/>
  </OperatorMethod>
  <Constructor id="_1177" name="$_13" artificial="1" throw="" context="_302" access="public" mangled="_ZN10OniVersionC1ERKS_ *INTERNAL* " demangled="OniVersion::OniVersion(OniVersion const&amp;)" location="f19:54" file="f19" line="54" endline="54" inline="1">
    <Argument type="_2059" location="f19:45" file="f19" line="45"/>
  </Constructor>
  <Constructor id="_1178" name="$_13" artificial="1" throw="" context="_302" access="public" mangled="_ZN10OniVersionC1Ev *INTERNAL* " demangled="OniVersion::OniVersion()" location="f19:54" file="f19" line="54" inline="1"/>
  <Field id="_1179" name="pixelFormat" type="_126" offset="0" context="_303" access="public" location="f19:61" file="f19" line="61"/>
  <Field id="_1180" name="resolutionX" type="_18" offset="32" context="_303" access="public" location="f19:62" file="f19" line="62"/>
  <Field id="_1181" name="resolutionY" type="_18" offset="64" context="_303" access="public" location="f19:63" file="f19" line="63"/>
  <Field id="_1182" name="fps" type="_18" offset="96" context="_303" access="public" location="f19:64" file="f19" line="64"/>
  <Destructor id="_1183" name="$_14" artificial="1" throw="" context="_303" access="public" mangled="_ZN12OniVideoModeD1Ev *INTERNAL* " demangled="OniVideoMode::~OniVideoMode()" location="f19:65" file="f19" line="65" endline="65" inline="1">
  </Destructor>
  <OperatorMethod id="_1184" name="=" returns="_2060" artificial="1" throw="" context="_303" access="public" mangled="_ZN12OniVideoModeaSERKS_" demangled="OniVideoMode::operator=(OniVideoMode const&amp;)" location="f19:65" file="f19" line="65" endline="65" inline="1">
    <Argument type="_2061" location="f19:60" file="f19" line="60"/>
  </OperatorMethod>
  <Constructor id="_1185" name="$_14" artificial="1" throw="" context="_303" access="public" mangled="_ZN12OniVideoModeC1ERKS_ *INTERNAL* " demangled="OniVideoMode::OniVideoMode(OniVideoMode const&amp;)" location="f19:65" file="f19" line="65" endline="65" inline="1">
    <Argument type="_2061" location="f19:60" file="f19" line="60"/>
  </Constructor>
  <Constructor id="_1186" name="$_14" artificial="1" throw="" context="_303" access="public" mangled="_ZN12OniVideoModeC1Ev *INTERNAL* " demangled="OniVideoMode::OniVideoMode()" location="f19:65" file="f19" line="65" inline="1"/>
  <Field id="_1187" name="sensorType" type="_653" offset="0" context="_304" access="public" location="f19:70" file="f19" line="70"/>
  <Field id="_1188" name="numSupportedVideoModes" type="_18" offset="32" context="_304" access="public" location="f19:71" file="f19" line="71"/>
  <Field id="_1189" name="pSupportedVideoModes" type="_2062" offset="64" context="_304" access="public" location="f19:72" file="f19" line="72"/>
  <Destructor id="_1190" name="$_15" artificial="1" throw="" context="_304" access="public" mangled="_ZN13OniSensorInfoD1Ev *INTERNAL* " demangled="OniSensorInfo::~OniSensorInfo()" location="f19:73" file="f19" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_1191" name="=" returns="_2063" artificial="1" throw="" context="_304" access="public" mangled="_ZN13OniSensorInfoaSERKS_" demangled="OniSensorInfo::operator=(OniSensorInfo const&amp;)" location="f19:73" file="f19" line="73" endline="73" inline="1">
    <Argument type="_2064" location="f19:69" file="f19" line="69"/>
  </OperatorMethod>
  <Constructor id="_1192" name="$_15" artificial="1" throw="" context="_304" access="public" mangled="_ZN13OniSensorInfoC1ERKS_ *INTERNAL* " demangled="OniSensorInfo::OniSensorInfo(OniSensorInfo const&amp;)" location="f19:73" file="f19" line="73" endline="73" inline="1">
    <Argument type="_2064" location="f19:69" file="f19" line="69"/>
  </Constructor>
  <Constructor id="_1193" name="$_15" artificial="1" throw="" context="_304" access="public" mangled="_ZN13OniSensorInfoC1Ev *INTERNAL* " demangled="OniSensorInfo::OniSensorInfo()" location="f19:73" file="f19" line="73" inline="1"/>
  <Field id="_1194" name="deviceConnected" type="_340" offset="0" context="_305" access="public" location="f19:125" file="f19" line="125"/>
  <Field id="_1195" name="deviceDisconnected" type="_340" offset="32" context="_305" access="public" location="f19:126" file="f19" line="126"/>
  <Field id="_1196" name="deviceStateChanged" type="_671" offset="64" context="_305" access="public" location="f19:127" file="f19" line="127"/>
  <Destructor id="_1197" name="$_18" artificial="1" throw="" context="_305" access="public" mangled="_ZN18OniDeviceCallbacksD1Ev *INTERNAL* " demangled="OniDeviceCallbacks::~OniDeviceCallbacks()" location="f19:128" file="f19" line="128" endline="128" inline="1">
  </Destructor>
  <OperatorMethod id="_1198" name="=" returns="_2065" artificial="1" throw="" context="_305" access="public" mangled="_ZN18OniDeviceCallbacksaSERKS_" demangled="OniDeviceCallbacks::operator=(OniDeviceCallbacks const&amp;)" location="f19:128" file="f19" line="128" endline="128" inline="1">
    <Argument type="_2066" location="f19:124" file="f19" line="124"/>
  </OperatorMethod>
  <Constructor id="_1199" name="$_18" artificial="1" throw="" context="_305" access="public" mangled="_ZN18OniDeviceCallbacksC1ERKS_ *INTERNAL* " demangled="OniDeviceCallbacks::OniDeviceCallbacks(OniDeviceCallbacks const&amp;)" location="f19:128" file="f19" line="128" endline="128" inline="1">
    <Argument type="_2066" location="f19:124" file="f19" line="124"/>
  </Constructor>
  <Constructor id="_1200" name="$_18" artificial="1" throw="" context="_305" access="public" mangled="_ZN18OniDeviceCallbacksC1Ev *INTERNAL* " demangled="OniDeviceCallbacks::OniDeviceCallbacks()" location="f19:128" file="f19" line="128" inline="1"/>
  <Field id="_1201" name="enabled" type="_18" offset="0" context="_306" access="public" location="f19:132" file="f19" line="132"/>
  <Field id="_1202" name="originX" type="_18" offset="32" context="_306" access="public" location="f19:133" file="f19" line="133"/>
  <Field id="_1203" name="originY" type="_18" offset="64" context="_306" access="public" location="f19:134" file="f19" line="134"/>
  <Field id="_1204" name="width" type="_18" offset="96" context="_306" access="public" location="f19:135" file="f19" line="135"/>
  <Field id="_1205" name="height" type="_18" offset="128" context="_306" access="public" location="f19:136" file="f19" line="136"/>
  <Destructor id="_1206" name="$_19" artificial="1" throw="" context="_306" access="public" mangled="_ZN11OniCroppingD1Ev *INTERNAL* " demangled="OniCropping::~OniCropping()" location="f19:137" file="f19" line="137" endline="137" inline="1">
  </Destructor>
  <OperatorMethod id="_1207" name="=" returns="_2067" artificial="1" throw="" context="_306" access="public" mangled="_ZN11OniCroppingaSERKS_" demangled="OniCropping::operator=(OniCropping const&amp;)" location="f19:137" file="f19" line="137" endline="137" inline="1">
    <Argument type="_2068" location="f19:131" file="f19" line="131"/>
  </OperatorMethod>
  <Constructor id="_1208" name="$_19" artificial="1" throw="" context="_306" access="public" mangled="_ZN11OniCroppingC1ERKS_ *INTERNAL* " demangled="OniCropping::OniCropping(OniCropping const&amp;)" location="f19:137" file="f19" line="137" endline="137" inline="1">
    <Argument type="_2068" location="f19:131" file="f19" line="131"/>
  </Constructor>
  <Constructor id="_1209" name="$_19" artificial="1" throw="" context="_306" access="public" mangled="_ZN11OniCroppingC1Ev *INTERNAL* " demangled="OniCropping::OniCropping()" location="f19:137" file="f19" line="137" inline="1"/>
  <Field id="_1210" name="u" type="_743" offset="0" context="_309" access="public" location="f19:176" file="f19" line="176"/>
  <Field id="_1211" name="y1" type="_743" offset="8" context="_309" access="public" location="f19:178" file="f19" line="178"/>
  <Field id="_1212" name="v" type="_743" offset="16" context="_309" access="public" location="f19:180" file="f19" line="180"/>
  <Field id="_1213" name="y2" type="_743" offset="24" context="_309" access="public" location="f19:182" file="f19" line="182"/>
  <Destructor id="_1214" name="$_21" artificial="1" throw="" context="_309" access="public" mangled="_ZN20OniYUV422DoublePixelD1Ev *INTERNAL* " demangled="OniYUV422DoublePixel::~OniYUV422DoublePixel()" location="f19:183" file="f19" line="183" endline="183" inline="1">
  </Destructor>
  <OperatorMethod id="_1215" name="=" returns="_2069" artificial="1" throw="" context="_309" access="public" mangled="_ZN20OniYUV422DoublePixelaSERKS_" demangled="OniYUV422DoublePixel::operator=(OniYUV422DoublePixel const&amp;)" location="f19:183" file="f19" line="183" endline="183" inline="1">
    <Argument type="_2070" location="f19:174" file="f19" line="174"/>
  </OperatorMethod>
  <Constructor id="_1216" name="$_21" artificial="1" throw="" context="_309" access="public" mangled="_ZN20OniYUV422DoublePixelC1ERKS_ *INTERNAL* " demangled="OniYUV422DoublePixel::OniYUV422DoublePixel(OniYUV422DoublePixel const&amp;)" location="f19:183" file="f19" line="183" endline="183" inline="1">
    <Argument type="_2070" location="f19:174" file="f19" line="174"/>
  </Constructor>
  <Constructor id="_1217" name="$_21" artificial="1" throw="" context="_309" access="public" mangled="_ZN20OniYUV422DoublePixelC1Ev *INTERNAL* " demangled="OniYUV422DoublePixel::OniYUV422DoublePixel()" location="f19:183" file="f19" line="183" inline="1"/>
  <PointerType id="_1218" type="_728" size="32" align="32"/>
  <Field id="_1219" name="nOffset" type="_371" offset="0" context="_325" access="public" location="f2:588" file="f2" line="588"/>
  <Field id="_1220" name="strFileName" type="_908" offset="32" context="_325" access="public" location="f2:589" file="f2" line="589"/>
  <Field id="_1221" name="nAttributes" type="_131" offset="64" context="_325" access="public" location="f2:590" file="f2" line="590"/>
  <Destructor id="_1222" name="$_39" artificial="1" throw="" context="_325" access="public" mangled="_ZN15XnParamFileDataD1Ev *INTERNAL* " demangled="XnParamFileData::~XnParamFileData()" location="f2:591" file="f2" line="591" endline="591" inline="1">
  </Destructor>
  <OperatorMethod id="_1223" name="=" returns="_2071" artificial="1" throw="" context="_325" access="public" mangled="_ZN15XnParamFileDataaSERKS_" demangled="XnParamFileData::operator=(XnParamFileData const&amp;)" location="f2:591" file="f2" line="591" endline="591" inline="1">
    <Argument type="_2072" location="f2:587" file="f2" line="587"/>
  </OperatorMethod>
  <Constructor id="_1224" name="$_39" artificial="1" throw="" context="_325" access="public" mangled="_ZN15XnParamFileDataC1ERKS_ *INTERNAL* " demangled="XnParamFileData::XnParamFileData(XnParamFileData const&amp;)" location="f2:591" file="f2" line="591" endline="591" inline="1">
    <Argument type="_2072" location="f2:587" file="f2" line="587"/>
  </Constructor>
  <Constructor id="_1225" name="$_39" artificial="1" throw="" context="_325" access="public" mangled="_ZN15XnParamFileDataC1Ev *INTERNAL* " demangled="XnParamFileData::XnParamFileData()" location="f2:591" file="f2" line="591" inline="1"/>
  <Field id="_1226" name="nId" type="_131" offset="0" context="_330" access="public" location="f2:601" file="f2" line="601"/>
  <Field id="_1227" name="nType" type="_131" offset="16" context="_330" access="public" location="f2:602" file="f2" line="602"/>
  <Field id="_1228" name="nVersion" type="_371" offset="32" context="_330" access="public" location="f2:603" file="f2" line="603"/>
  <Field id="_1229" name="nOffset" type="_371" offset="64" context="_330" access="public" location="f2:604" file="f2" line="604"/>
  <Field id="_1230" name="nSize" type="_371" offset="96" context="_330" access="public" location="f2:605" file="f2" line="605"/>
  <Field id="_1231" name="nCrc" type="_131" offset="128" context="_330" access="public" location="f2:606" file="f2" line="606"/>
  <Field id="_1232" name="nAttributes" type="_131" offset="144" context="_330" access="public" location="f2:607" file="f2" line="607"/>
  <Field id="_1233" name="nReserve" type="_131" offset="160" context="_330" access="public" location="f2:608" file="f2" line="608"/>
  <Destructor id="_1234" name="$_41" artificial="1" throw="" context="_330" access="public" mangled="_ZN11XnFlashFileD1Ev *INTERNAL* " demangled="XnFlashFile::~XnFlashFile()" location="f2:609" file="f2" line="609" endline="609" inline="1">
  </Destructor>
  <OperatorMethod id="_1235" name="=" returns="_2073" artificial="1" throw="" context="_330" access="public" mangled="_ZN11XnFlashFileaSERKS_" demangled="XnFlashFile::operator=(XnFlashFile const&amp;)" location="f2:609" file="f2" line="609" endline="609" inline="1">
    <Argument type="_2074" location="f2:600" file="f2" line="600"/>
  </OperatorMethod>
  <Constructor id="_1236" name="$_41" artificial="1" throw="" context="_330" access="public" mangled="_ZN11XnFlashFileC1ERKS_ *INTERNAL* " demangled="XnFlashFile::XnFlashFile(XnFlashFile const&amp;)" location="f2:609" file="f2" line="609" endline="609" inline="1">
    <Argument type="_2074" location="f2:600" file="f2" line="600"/>
  </Constructor>
  <Constructor id="_1237" name="$_41" artificial="1" throw="" context="_330" access="public" mangled="_ZN11XnFlashFileC1Ev *INTERNAL* " demangled="XnFlashFile::XnFlashFile()" location="f2:609" file="f2" line="609" inline="1"/>
  <Field id="_1241" name="uc_onstack" type="_18" offset="0" context="_354" access="public" location="f33:36" file="f33" line="36"/>
  <Field id="_1242" name="uc_sigmask" type="_150" offset="32" context="_354" access="public" location="f33:37" file="f33" line="37"/>
  <Field id="_1243" name="uc_stack" type="_54" offset="64" context="_354" access="public" location="f33:38" file="f33" line="38"/>
  <Field id="_1244" name="uc_link" type="_2075" offset="160" context="_354" access="public" location="f33:39" file="f33" line="39"/>
  <Field id="_1245" name="uc_mcsize" type="_217" offset="192" context="_354" access="public" location="f33:40" file="f33" line="40"/>
  <Field id="_1246" name="uc_mcontext" type="_433" offset="224" context="_354" access="public" location="f33:41" file="f33" line="41"/>
  <Destructor id="_1247" name="__darwin_ucontext" artificial="1" throw="" context="_354" access="public" mangled="_ZN17__darwin_ucontextD1Ev *INTERNAL* " demangled="__darwin_ucontext::~__darwin_ucontext()" location="f33:35" file="f33" line="35" endline="35" inline="1">
  </Destructor>
  <OperatorMethod id="_1248" name="=" returns="_2076" artificial="1" throw="" context="_354" access="public" mangled="_ZN17__darwin_ucontextaSERKS_" demangled="__darwin_ucontext::operator=(__darwin_ucontext const&amp;)" location="f33:35" file="f33" line="35" endline="35" inline="1">
    <Argument type="_2077" location="f33:35" file="f33" line="35"/>
  </OperatorMethod>
  <Constructor id="_1249" name="__darwin_ucontext" artificial="1" throw="" context="_354" access="public" mangled="_ZN17__darwin_ucontextC1ERKS_ *INTERNAL* " demangled="__darwin_ucontext::__darwin_ucontext(__darwin_ucontext const&amp;)" location="f33:35" file="f33" line="35" endline="35" inline="1">
    <Argument type="_2077" location="f33:35" file="f33" line="35"/>
  </Constructor>
  <Constructor id="_1250" name="__darwin_ucontext" artificial="1" throw="" context="_354" access="public" mangled="_ZN17__darwin_ucontextC1Ev *INTERNAL* " demangled="__darwin_ucontext::__darwin_ucontext()" location="f33:35" file="f33" line="35" inline="1"/>
  <PointerType id="_1251" type="_910" size="32" align="32"/>
  <PointerType id="_1252" type="_911" size="32" align="32"/>
  <Field id="_1253" name="nRegister" type="_130" offset="0" context="_375" access="public" location="f2:477" file="f2" line="477"/>
  <Field id="_1254" name="nValue" type="_130" offset="16" context="_375" access="public" location="f2:478" file="f2" line="478"/>
  <Destructor id="_1255" name="XnControlProcessingData" artificial="1" throw="" context="_375" access="public" mangled="_ZN23XnControlProcessingDataD1Ev *INTERNAL* " demangled="XnControlProcessingData::~XnControlProcessingData()" location="f2:476" file="f2" line="476" endline="476" inline="1">
  </Destructor>
  <OperatorMethod id="_1256" name="=" returns="_2078" artificial="1" throw="" context="_375" access="public" mangled="_ZN23XnControlProcessingDataaSERKS_" demangled="XnControlProcessingData::operator=(XnControlProcessingData const&amp;)" location="f2:476" file="f2" line="476" endline="476" inline="1">
    <Argument type="_2079" location="f2:476" file="f2" line="476"/>
  </OperatorMethod>
  <Constructor id="_1257" name="XnControlProcessingData" artificial="1" throw="" context="_375" access="public" mangled="_ZN23XnControlProcessingDataC1ERKS_ *INTERNAL* " demangled="XnControlProcessingData::XnControlProcessingData(XnControlProcessingData const&amp;)" location="f2:476" file="f2" line="476" endline="476" inline="1">
    <Argument type="_2079" location="f2:476" file="f2" line="476"/>
  </Constructor>
  <Constructor id="_1258" name="XnControlProcessingData" artificial="1" throw="" context="_375" access="public" mangled="_ZN23XnControlProcessingDataC1Ev *INTERNAL* " demangled="XnControlProcessingData::XnControlProcessingData()" location="f2:476" file="f2" line="476" inline="1"/>
  <PointerType id="_1259" type="_626c" size="32" align="32"/>
  <PointerType id="_1260" type="_17c" size="32" align="32"/>
  <Field id="_1261" name="__invalid" bits="1" type="_130" offset="0" context="_390" access="public" location="f13:149" file="f13" line="149"/>
  <Field id="_1262" name="__denorm" bits="1" type="_130" offset="1" context="_390" access="public" location="f13:150" file="f13" line="150"/>
  <Field id="_1263" name="__zdiv" bits="1" type="_130" offset="2" context="_390" access="public" location="f13:151" file="f13" line="151"/>
  <Field id="_1264" name="__ovrfl" bits="1" type="_130" offset="3" context="_390" access="public" location="f13:152" file="f13" line="152"/>
  <Field id="_1265" name="__undfl" bits="1" type="_130" offset="4" context="_390" access="public" location="f13:153" file="f13" line="153"/>
  <Field id="_1266" name="__precis" bits="1" type="_130" offset="5" context="_390" access="public" location="f13:154" file="f13" line="154"/>
  <Field id="_1267" name="__stkflt" bits="1" type="_130" offset="6" context="_390" access="public" location="f13:155" file="f13" line="155"/>
  <Field id="_1268" name="__errsumm" bits="1" type="_130" offset="7" context="_390" access="public" location="f13:156" file="f13" line="156"/>
  <Field id="_1269" name="__c0" bits="1" type="_130" offset="8" context="_390" access="public" location="f13:157" file="f13" line="157"/>
  <Field id="_1270" name="__c1" bits="1" type="_130" offset="9" context="_390" access="public" location="f13:158" file="f13" line="158"/>
  <Field id="_1271" name="__c2" bits="1" type="_130" offset="10" context="_390" access="public" location="f13:159" file="f13" line="159"/>
  <Field id="_1272" name="__tos" bits="3" type="_130" offset="11" context="_390" access="public" location="f13:160" file="f13" line="160"/>
  <Field id="_1273" name="__c3" bits="1" type="_130" offset="14" context="_390" access="public" location="f13:161" file="f13" line="161"/>
  <Field id="_1274" name="__busy" bits="1" type="_130" offset="15" context="_390" access="public" location="f13:162" file="f13" line="162"/>
  <Destructor id="_1275" name="__darwin_fp_status" artificial="1" throw="" context="_390" access="public" mangled="_ZN18__darwin_fp_statusD1Ev *INTERNAL* " demangled="__darwin_fp_status::~__darwin_fp_status()" location="f13:148" file="f13" line="148" endline="148" inline="1">
  </Destructor>
  <OperatorMethod id="_1276" name="=" returns="_2082" artificial="1" throw="" context="_390" access="public" mangled="_ZN18__darwin_fp_statusaSERKS_" demangled="__darwin_fp_status::operator=(__darwin_fp_status const&amp;)" location="f13:148" file="f13" line="148" endline="148" inline="1">
    <Argument type="_2083" location="f13:148" file="f13" line="148"/>
  </OperatorMethod>
  <Constructor id="_1277" name="__darwin_fp_status" artificial="1" throw="" context="_390" access="public" mangled="_ZN18__darwin_fp_statusC1ERKS_ *INTERNAL* " demangled="__darwin_fp_status::__darwin_fp_status(__darwin_fp_status const&amp;)" location="f13:148" file="f13" line="148" endline="148" inline="1">
    <Argument type="_2083" location="f13:148" file="f13" line="148"/>
  </Constructor>
  <Constructor id="_1278" name="__darwin_fp_status" artificial="1" throw="" context="_390" access="public" mangled="_ZN18__darwin_fp_statusC1Ev *INTERNAL* " demangled="__darwin_fp_status::__darwin_fp_status()" location="f13:148" file="f13" line="148" inline="1"/>
  <Field id="_1279" name="__sigaction_u" type="_892" offset="0" context="_393" access="public" location="f24:286" file="f24" line="286"/>
  <Field id="_1280" name="sa_mask" type="_79" offset="32" context="_393" access="public" location="f24:287" file="f24" line="287"/>
  <Field id="_1281" name="sa_flags" type="_18" offset="64" context="_393" access="public" location="f24:288" file="f24" line="288"/>
  <Destructor id="_1282" name="sigaction" artificial="1" throw="" context="_393" access="public" mangled="_ZN9sigactionD1Ev *INTERNAL* " demangled="sigaction::~sigaction()" location="f24:285" file="f24" line="285" endline="285" inline="1">
  </Destructor>
  <OperatorMethod id="_1283" name="=" returns="_2084" artificial="1" throw="" context="_393" access="public" mangled="_ZN9sigactionaSERKS_" demangled="sigaction::operator=(sigaction const&amp;)" location="f24:285" file="f24" line="285" endline="285" inline="1">
    <Argument type="_2085" location="f24:285" file="f24" line="285"/>
  </OperatorMethod>
  <Constructor id="_1284" name="sigaction" artificial="1" throw="" context="_393" access="public" mangled="_ZN9sigactionC1ERKS_ *INTERNAL* " demangled="sigaction::sigaction(sigaction const&amp;)" location="f24:285" file="f24" line="285" endline="285" inline="1">
    <Argument type="_2085" location="f24:285" file="f24" line="285"/>
  </Constructor>
  <Constructor id="_1285" name="sigaction" artificial="1" throw="" context="_393" access="public" mangled="_ZN9sigactionC1Ev *INTERNAL* " demangled="sigaction::sigaction()" location="f24:285" file="f24" line="285" inline="1"/>
  <Field id="_1286" name="nMajor" type="_280" offset="0" context="_401" access="public" location="f2:440" file="f2" line="440"/>
  <Field id="_1287" name="nMinor" type="_280" offset="8" context="_401" access="public" location="f2:441" file="f2" line="441"/>
  <Field id="_1288" name="nMaintenance" type="_280" offset="16" context="_401" access="public" location="f2:442" file="f2" line="442"/>
  <Field id="_1289" name="nBuild" type="_130" offset="24" context="_401" access="public" location="f2:443" file="f2" line="443"/>
  <Destructor id="_1290" name="XnSDKVersion" artificial="1" throw="" context="_401" access="public" mangled="_ZN12XnSDKVersionD1Ev *INTERNAL* " demangled="XnSDKVersion::~XnSDKVersion()" location="f2:439" file="f2" line="439" endline="439" inline="1">
  </Destructor>
  <OperatorMethod id="_1291" name="=" returns="_2086" artificial="1" throw="" context="_401" access="public" mangled="_ZN12XnSDKVersionaSERKS_" demangled="XnSDKVersion::operator=(XnSDKVersion const&amp;)" location="f2:439" file="f2" line="439" endline="439" inline="1">
    <Argument type="_2087" location="f2:439" file="f2" line="439"/>
  </OperatorMethod>
  <Constructor id="_1292" name="XnSDKVersion" artificial="1" throw="" context="_401" access="public" mangled="_ZN12XnSDKVersionC1ERKS_ *INTERNAL* " demangled="XnSDKVersion::XnSDKVersion(XnSDKVersion const&amp;)" location="f2:439" file="f2" line="439" endline="439" inline="1">
    <Argument type="_2087" location="f2:439" file="f2" line="439"/>
  </Constructor>
  <Constructor id="_1293" name="XnSDKVersion" artificial="1" throw="" context="_401" access="public" mangled="_ZN12XnSDKVersionC1Ev *INTERNAL* " demangled="XnSDKVersion::XnSDKVersion()" location="f2:439" file="f2" line="439" inline="1"/>
  <Field id="_1294" name="nCmosID" type="_312" offset="0" context="_412" access="public" location="f2:514" file="f2" line="514"/>
  <Field id="_1295" name="nUnits" type="_131" offset="32" context="_412" access="public" location="f2:515" file="f2" line="515"/>
  <Field id="_1296" name="nNumberOfFrames" type="_131" offset="48" context="_412" access="public" location="f2:516" file="f2" line="516"/>
  <Destructor id="_1297" name="XnCmosBlankingUnits" artificial="1" throw="" context="_412" access="public" mangled="_ZN19XnCmosBlankingUnitsD1Ev *INTERNAL* " demangled="XnCmosBlankingUnits::~XnCmosBlankingUnits()" location="f2:513" file="f2" line="513" endline="513" inline="1">
  </Destructor>
  <OperatorMethod id="_1298" name="=" returns="_2088" artificial="1" throw="" context="_412" access="public" mangled="_ZN19XnCmosBlankingUnitsaSERKS_" demangled="XnCmosBlankingUnits::operator=(XnCmosBlankingUnits const&amp;)" location="f2:513" file="f2" line="513" endline="513" inline="1">
    <Argument type="_2089" location="f2:513" file="f2" line="513"/>
  </OperatorMethod>
  <Constructor id="_1299" name="XnCmosBlankingUnits" artificial="1" throw="" context="_412" access="public" mangled="_ZN19XnCmosBlankingUnitsC1ERKS_ *INTERNAL* " demangled="XnCmosBlankingUnits::XnCmosBlankingUnits(XnCmosBlankingUnits const&amp;)" location="f2:513" file="f2" line="513" endline="513" inline="1">
    <Argument type="_2089" location="f2:513" file="f2" line="513"/>
  </Constructor>
  <Constructor id="_1300" name="XnCmosBlankingUnits" artificial="1" throw="" context="_412" access="public" mangled="_ZN19XnCmosBlankingUnitsC1Ev *INTERNAL* " demangled="XnCmosBlankingUnits::XnCmosBlankingUnits()" location="f2:513" file="f2" line="513" inline="1"/>
  <Field id="_1301" name="w_status" type="_18" offset="0" context="_417" access="public" location="f37:195" file="f37" line="195"/>
  <Field id="_1302" name="w_T" type="_1304" offset="0" context="_417" access="public" location="f37:212" file="f37" line="212"/>
  <Field id="_1303" name="w_S" type="_1305" offset="0" context="_417" access="public" location="f37:229" file="f37" line="229"/>
  <Struct id="_1304" context="_417" access="public" mangled="N4wait3$_2E" demangled="wait::$_2" location="f37:199" file="f37" line="199" artificial="1" size="32" align="32" members="_2090 _2091 _2092 _2093 _2094 _2095 _2096 _2097 " bases=""/>
  <Struct id="_1305" context="_417" access="public" mangled="N4wait3$_3E" demangled="wait::$_3" location="f37:218" file="f37" line="218" artificial="1" size="32" align="32" members="_2098 _2099 _2100 _2101 _2102 _2103 _2104 " bases=""/>
  <Destructor id="_1306" name="wait" artificial="1" throw="" context="_417" access="public" mangled="_ZN4waitD1Ev *INTERNAL* " demangled="wait::~wait()" location="f37:194" file="f37" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_1307" name="=" returns="_2105" artificial="1" throw="" context="_417" access="public" mangled="_ZN4waitaSERKS_" demangled="wait::operator=(wait const&amp;)" location="f37:194" file="f37" line="194" endline="194" inline="1">
    <Argument type="_2106" location="f37:194" file="f37" line="194"/>
  </OperatorMethod>
  <Constructor id="_1308" name="wait" artificial="1" throw="" context="_417" access="public" mangled="_ZN4waitC1ERKS_ *INTERNAL* " demangled="wait::wait(wait const&amp;)" location="f37:194" file="f37" line="194" endline="194" inline="1">
    <Argument type="_2106" location="f37:194" file="f37" line="194"/>
  </Constructor>
  <Constructor id="_1309" name="wait" artificial="1" throw="" context="_417" access="public" mangled="_ZN4waitC1Ev *INTERNAL* " demangled="wait::wait()" location="f37:194" file="f37" line="194" inline="1"/>
  <Field id="_1310" name="__sig" type="_104" offset="0" context="_419" access="public" location="f6:64" file="f6" line="64"/>
  <Field id="_1311" name="__opaque" type="_2013" offset="32" context="_419" access="public" location="f6:65" file="f6" line="65"/>
  <Destructor id="_1312" name="_opaque_pthread_attr_t" artificial="1" throw="" context="_419" access="public" mangled="_ZN22_opaque_pthread_attr_tD1Ev *INTERNAL* " demangled="_opaque_pthread_attr_t::~_opaque_pthread_attr_t()" location="f6:63" file="f6" line="63" endline="63" inline="1">
  </Destructor>
  <OperatorMethod id="_1313" name="=" returns="_2107" artificial="1" throw="" context="_419" access="public" mangled="_ZN22_opaque_pthread_attr_taSERKS_" demangled="_opaque_pthread_attr_t::operator=(_opaque_pthread_attr_t const&amp;)" location="f6:63" file="f6" line="63" endline="63" inline="1">
    <Argument type="_2108" location="f6:63" file="f6" line="63"/>
  </OperatorMethod>
  <Constructor id="_1314" name="_opaque_pthread_attr_t" artificial="1" throw="" context="_419" access="public" mangled="_ZN22_opaque_pthread_attr_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_attr_t::_opaque_pthread_attr_t(_opaque_pthread_attr_t const&amp;)" location="f6:63" file="f6" line="63" endline="63" inline="1">
    <Argument type="_2108" location="f6:63" file="f6" line="63"/>
  </Constructor>
  <Constructor id="_1315" name="_opaque_pthread_attr_t" artificial="1" throw="" context="_419" access="public" mangled="_ZN22_opaque_pthread_attr_tC1Ev *INTERNAL* " demangled="_opaque_pthread_attr_t::_opaque_pthread_attr_t()" location="f6:63" file="f6" line="63" inline="1"/>
  <Field id="_1316" name="quot" type="_13" offset="0" context="_440" access="public" location="f11:94" file="f11" line="94"/>
  <Field id="_1317" name="rem" type="_13" offset="64" context="_440" access="public" location="f11:95" file="f11" line="95"/>
  <Destructor id="_1318" name="$_6" artificial="1" throw="" context="_440" access="public" mangled="_ZN7lldiv_tD1Ev *INTERNAL* " demangled="lldiv_t::~lldiv_t()" location="f11:96" file="f11" line="96" endline="96" inline="1">
  </Destructor>
  <OperatorMethod id="_1319" name="=" returns="_2109" artificial="1" throw="" context="_440" access="public" mangled="_ZN7lldiv_taSERKS_" demangled="lldiv_t::operator=(lldiv_t const&amp;)" location="f11:96" file="f11" line="96" endline="96" inline="1">
    <Argument type="_2110" location="f11:93" file="f11" line="93"/>
  </OperatorMethod>
  <Constructor id="_1320" name="$_6" artificial="1" throw="" context="_440" access="public" mangled="_ZN7lldiv_tC1ERKS_ *INTERNAL* " demangled="lldiv_t::lldiv_t(lldiv_t const&amp;)" location="f11:96" file="f11" line="96" endline="96" inline="1">
    <Argument type="_2110" location="f11:93" file="f11" line="93"/>
  </Constructor>
  <Constructor id="_1321" name="$_6" artificial="1" throw="" context="_440" access="public" mangled="_ZN7lldiv_tC1Ev *INTERNAL* " demangled="lldiv_t::lldiv_t()" location="f11:96" file="f11" line="96" inline="1"/>
  <Field id="_1322" name="nRegister" type="_78" offset="0" context="_441" access="public" location="f2:483" file="f2" line="483"/>
  <Field id="_1323" name="nValue" type="_78" offset="32" context="_441" access="public" location="f2:484" file="f2" line="484"/>
  <Field id="_1324" name="nMask" type="_78" offset="64" context="_441" access="public" location="f2:485" file="f2" line="485"/>
  <Destructor id="_1325" name="XnAHBData" artificial="1" throw="" context="_441" access="public" mangled="_ZN9XnAHBDataD1Ev *INTERNAL* " demangled="XnAHBData::~XnAHBData()" location="f2:482" file="f2" line="482" endline="482" inline="1">
  </Destructor>
  <OperatorMethod id="_1326" name="=" returns="_2111" artificial="1" throw="" context="_441" access="public" mangled="_ZN9XnAHBDataaSERKS_" demangled="XnAHBData::operator=(XnAHBData const&amp;)" location="f2:482" file="f2" line="482" endline="482" inline="1">
    <Argument type="_2112" location="f2:482" file="f2" line="482"/>
  </OperatorMethod>
  <Constructor id="_1327" name="XnAHBData" artificial="1" throw="" context="_441" access="public" mangled="_ZN9XnAHBDataC1ERKS_ *INTERNAL* " demangled="XnAHBData::XnAHBData(XnAHBData const&amp;)" location="f2:482" file="f2" line="482" endline="482" inline="1">
    <Argument type="_2112" location="f2:482" file="f2" line="482"/>
  </Constructor>
  <Constructor id="_1328" name="XnAHBData" artificial="1" throw="" context="_441" access="public" mangled="_ZN9XnAHBDataC1Ev *INTERNAL* " demangled="XnAHBData::XnAHBData()" location="f2:482" file="f2" line="482" inline="1"/>
  <Field id="_1329" name="__trapno" type="_192" offset="0" context="_450" access="public" location="f13:404" file="f13" line="404"/>
  <Field id="_1330" name="__cpu" type="_192" offset="16" context="_450" access="public" location="f13:405" file="f13" line="405"/>
  <Field id="_1331" name="__err" type="_445" offset="32" context="_450" access="public" location="f13:406" file="f13" line="406"/>
  <Field id="_1332" name="__faultvaddr" type="_445" offset="64" context="_450" access="public" location="f13:407" file="f13" line="407"/>
  <Destructor id="_1333" name="__darwin_i386_exception_state" artificial="1" throw="" context="_450" access="public" mangled="_ZN29__darwin_i386_exception_stateD1Ev *INTERNAL* " demangled="__darwin_i386_exception_state::~__darwin_i386_exception_state()" location="f13:403" file="f13" line="403" endline="403" inline="1">
  </Destructor>
  <OperatorMethod id="_1334" name="=" returns="_2113" artificial="1" throw="" context="_450" access="public" mangled="_ZN29__darwin_i386_exception_stateaSERKS_" demangled="__darwin_i386_exception_state::operator=(__darwin_i386_exception_state const&amp;)" location="f13:403" file="f13" line="403" endline="403" inline="1">
    <Argument type="_2114" location="f13:403" file="f13" line="403"/>
  </OperatorMethod>
  <Constructor id="_1335" name="__darwin_i386_exception_state" artificial="1" throw="" context="_450" access="public" mangled="_ZN29__darwin_i386_exception_stateC1ERKS_ *INTERNAL* " demangled="__darwin_i386_exception_state::__darwin_i386_exception_state(__darwin_i386_exception_state const&amp;)" location="f13:403" file="f13" line="403" endline="403" inline="1">
    <Argument type="_2114" location="f13:403" file="f13" line="403"/>
  </Constructor>
  <Constructor id="_1336" name="__darwin_i386_exception_state" artificial="1" throw="" context="_450" access="public" mangled="_ZN29__darwin_i386_exception_stateC1Ev *INTERNAL* " demangled="__darwin_i386_exception_state::__darwin_i386_exception_state()" location="f13:403" file="f13" line="403" inline="1"/>
  <PointerType id="_1337" type="_728c" size="32" align="32"/>
  <Field id="_1338" name="nOffset" type="_371" offset="0" context="_459" access="public" location="f2:595" file="f2" line="595"/>
  <Field id="_1339" name="nSize" type="_371" offset="32" context="_459" access="public" location="f2:596" file="f2" line="596"/>
  <Field id="_1340" name="pData" type="_1014" offset="64" context="_459" access="public" location="f2:597" file="f2" line="597"/>
  <Destructor id="_1341" name="$_40" artificial="1" throw="" context="_459" access="public" mangled="_ZN16XnParamFlashDataD1Ev *INTERNAL* " demangled="XnParamFlashData::~XnParamFlashData()" location="f2:598" file="f2" line="598" endline="598" inline="1">
  </Destructor>
  <OperatorMethod id="_1342" name="=" returns="_2116" artificial="1" throw="" context="_459" access="public" mangled="_ZN16XnParamFlashDataaSERKS_" demangled="XnParamFlashData::operator=(XnParamFlashData const&amp;)" location="f2:598" file="f2" line="598" endline="598" inline="1">
    <Argument type="_2117" location="f2:594" file="f2" line="594"/>
  </OperatorMethod>
  <Constructor id="_1343" name="$_40" artificial="1" throw="" context="_459" access="public" mangled="_ZN16XnParamFlashDataC1ERKS_ *INTERNAL* " demangled="XnParamFlashData::XnParamFlashData(XnParamFlashData const&amp;)" location="f2:598" file="f2" line="598" endline="598" inline="1">
    <Argument type="_2117" location="f2:594" file="f2" line="594"/>
  </Constructor>
  <Constructor id="_1344" name="$_40" artificial="1" throw="" context="_459" access="public" mangled="_ZN16XnParamFlashDataC1Ev *INTERNAL* " demangled="XnParamFlashData::XnParamFlashData()" location="f2:598" file="f2" line="598" inline="1"/>
  <PointerType id="_1345" type="_262c" size="32" align="32"/>
  <Field id="_1346" name="__sig" type="_104" offset="0" context="_476" access="public" location="f6:94" file="f6" line="94"/>
  <Field id="_1347" name="__opaque" type="_2119" offset="32" context="_476" access="public" location="f6:95" file="f6" line="95"/>
  <Destructor id="_1348" name="_opaque_pthread_rwlock_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN24_opaque_pthread_rwlock_tD1Ev *INTERNAL* " demangled="_opaque_pthread_rwlock_t::~_opaque_pthread_rwlock_t()" location="f6:93" file="f6" line="93" endline="93" inline="1">
  </Destructor>
  <OperatorMethod id="_1349" name="=" returns="_2120" artificial="1" throw="" context="_476" access="public" mangled="_ZN24_opaque_pthread_rwlock_taSERKS_" demangled="_opaque_pthread_rwlock_t::operator=(_opaque_pthread_rwlock_t const&amp;)" location="f6:93" file="f6" line="93" endline="93" inline="1">
    <Argument type="_2121" location="f6:93" file="f6" line="93"/>
  </OperatorMethod>
  <Constructor id="_1350" name="_opaque_pthread_rwlock_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN24_opaque_pthread_rwlock_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_rwlock_t::_opaque_pthread_rwlock_t(_opaque_pthread_rwlock_t const&amp;)" location="f6:93" file="f6" line="93" endline="93" inline="1">
    <Argument type="_2121" location="f6:93" file="f6" line="93"/>
  </Constructor>
  <Constructor id="_1351" name="_opaque_pthread_rwlock_t" artificial="1" throw="" context="_476" access="public" mangled="_ZN24_opaque_pthread_rwlock_tC1Ev *INTERNAL* " demangled="_opaque_pthread_rwlock_t::_opaque_pthread_rwlock_t()" location="f6:93" file="f6" line="93" inline="1"/>
  <Field id="_1352" name="tv_sec" type="_608" offset="0" context="_477" access="public" location="f40:32" file="f40" line="32"/>
  <Field id="_1353" name="tv_nsec" type="_104" offset="32" context="_477" access="public" location="f40:33" file="f40" line="33"/>
  <Destructor id="_1354" name="timespec" artificial="1" throw="" context="_477" access="public" mangled="_ZN8timespecD1Ev *INTERNAL* " demangled="timespec::~timespec()" location="f40:31" file="f40" line="31" endline="31" inline="1">
  </Destructor>
  <OperatorMethod id="_1355" name="=" returns="_2122" artificial="1" throw="" context="_477" access="public" mangled="_ZN8timespecaSERKS_" demangled="timespec::operator=(timespec const&amp;)" location="f40:31" file="f40" line="31" endline="31" inline="1">
    <Argument type="_2123" location="f40:31" file="f40" line="31"/>
  </OperatorMethod>
  <Constructor id="_1356" name="timespec" artificial="1" throw="" context="_477" access="public" mangled="_ZN8timespecC1ERKS_ *INTERNAL* " demangled="timespec::timespec(timespec const&amp;)" location="f40:31" file="f40" line="31" endline="31" inline="1">
    <Argument type="_2123" location="f40:31" file="f40" line="31"/>
  </Constructor>
  <Constructor id="_1357" name="timespec" artificial="1" throw="" context="_477" access="public" mangled="_ZN8timespecC1Ev *INTERNAL* " demangled="timespec::timespec()" location="f40:31" file="f40" line="31" inline="1"/>
  <PointerType id="_1358" type="_879" size="32" align="32"/>
  <PointerType id="_1359" type="_477c" size="32" align="32"/>
  <PointerType id="_1360" type="_79c" size="32" align="32"/>
  <Field id="_1361" name="sival_int" type="_18" offset="0" context="_488" access="public" location="f24:159" file="f24" line="159"/>
  <Field id="_1362" name="sival_ptr" type="_460" offset="0" context="_488" access="public" location="f24:160" file="f24" line="160"/>
  <Destructor id="_1363" name="sigval" artificial="1" throw="" context="_488" access="public" mangled="_ZN6sigvalD1Ev *INTERNAL* " demangled="sigval::~sigval()" location="f24:157" file="f24" line="157" endline="157" inline="1">
  </Destructor>
  <OperatorMethod id="_1364" name="=" returns="_2126" artificial="1" throw="" context="_488" access="public" mangled="_ZN6sigvalaSERKS_" demangled="sigval::operator=(sigval const&amp;)" location="f24:157" file="f24" line="157" endline="157" inline="1">
    <Argument type="_2127" location="f24:157" file="f24" line="157"/>
  </OperatorMethod>
  <Constructor id="_1365" name="sigval" artificial="1" throw="" context="_488" access="public" mangled="_ZN6sigvalC1ERKS_ *INTERNAL* " demangled="sigval::sigval(sigval const&amp;)" location="f24:157" file="f24" line="157" endline="157" inline="1">
    <Argument type="_2127" location="f24:157" file="f24" line="157"/>
  </Constructor>
  <Constructor id="_1366" name="sigval" artificial="1" throw="" context="_488" access="public" mangled="_ZN6sigvalC1Ev *INTERNAL* " demangled="sigval::sigval()" location="f24:157" file="f24" line="157" inline="1"/>
  <Field id="_1367" name="__fpu_reserved" type="_2128" offset="0" context="_500" access="public" location="f13:511" file="f13" line="511"/>
  <Field id="_1368" name="__fpu_fcw" type="_220" offset="64" context="_500" access="public" location="f13:512" file="f13" line="512"/>
  <Field id="_1369" name="__fpu_fsw" type="_390" offset="80" context="_500" access="public" location="f13:513" file="f13" line="513"/>
  <Field id="_1370" name="__fpu_ftw" type="_634" offset="96" context="_500" access="public" location="f13:514" file="f13" line="514"/>
  <Field id="_1371" name="__fpu_rsrv1" type="_634" offset="104" context="_500" access="public" location="f13:515" file="f13" line="515"/>
  <Field id="_1372" name="__fpu_fop" type="_192" offset="112" context="_500" access="public" location="f13:516" file="f13" line="516"/>
  <Field id="_1373" name="__fpu_ip" type="_445" offset="128" context="_500" access="public" location="f13:519" file="f13" line="519"/>
  <Field id="_1374" name="__fpu_cs" type="_192" offset="160" context="_500" access="public" location="f13:520" file="f13" line="520"/>
  <Field id="_1375" name="__fpu_rsrv2" type="_192" offset="176" context="_500" access="public" location="f13:522" file="f13" line="522"/>
  <Field id="_1376" name="__fpu_dp" type="_445" offset="192" context="_500" access="public" location="f13:525" file="f13" line="525"/>
  <Field id="_1377" name="__fpu_ds" type="_192" offset="224" context="_500" access="public" location="f13:526" file="f13" line="526"/>
  <Field id="_1378" name="__fpu_rsrv3" type="_192" offset="240" context="_500" access="public" location="f13:528" file="f13" line="528"/>
  <Field id="_1379" name="__fpu_mxcsr" type="_445" offset="256" context="_500" access="public" location="f13:529" file="f13" line="529"/>
  <Field id="_1380" name="__fpu_mxcsrmask" type="_445" offset="288" context="_500" access="public" location="f13:530" file="f13" line="530"/>
  <Field id="_1381" name="__fpu_stmm0" type="_585" offset="320" context="_500" access="public" location="f13:531" file="f13" line="531"/>
  <Field id="_1382" name="__fpu_stmm1" type="_585" offset="448" context="_500" access="public" location="f13:532" file="f13" line="532"/>
  <Field id="_1383" name="__fpu_stmm2" type="_585" offset="576" context="_500" access="public" location="f13:533" file="f13" line="533"/>
  <Field id="_1384" name="__fpu_stmm3" type="_585" offset="704" context="_500" access="public" location="f13:534" file="f13" line="534"/>
  <Field id="_1385" name="__fpu_stmm4" type="_585" offset="832" context="_500" access="public" location="f13:535" file="f13" line="535"/>
  <Field id="_1386" name="__fpu_stmm5" type="_585" offset="960" context="_500" access="public" location="f13:536" file="f13" line="536"/>
  <Field id="_1387" name="__fpu_stmm6" type="_585" offset="1088" context="_500" access="public" location="f13:537" file="f13" line="537"/>
  <Field id="_1388" name="__fpu_stmm7" type="_585" offset="1216" context="_500" access="public" location="f13:538" file="f13" line="538"/>
  <Field id="_1389" name="__fpu_xmm0" type="_805" offset="1344" context="_500" access="public" location="f13:539" file="f13" line="539"/>
  <Field id="_1390" name="__fpu_xmm1" type="_805" offset="1472" context="_500" access="public" location="f13:540" file="f13" line="540"/>
  <Field id="_1391" name="__fpu_xmm2" type="_805" offset="1600" context="_500" access="public" location="f13:541" file="f13" line="541"/>
  <Field id="_1392" name="__fpu_xmm3" type="_805" offset="1728" context="_500" access="public" location="f13:542" file="f13" line="542"/>
  <Field id="_1393" name="__fpu_xmm4" type="_805" offset="1856" context="_500" access="public" location="f13:543" file="f13" line="543"/>
  <Field id="_1394" name="__fpu_xmm5" type="_805" offset="1984" context="_500" access="public" location="f13:544" file="f13" line="544"/>
  <Field id="_1395" name="__fpu_xmm6" type="_805" offset="2112" context="_500" access="public" location="f13:545" file="f13" line="545"/>
  <Field id="_1396" name="__fpu_xmm7" type="_805" offset="2240" context="_500" access="public" location="f13:546" file="f13" line="546"/>
  <Field id="_1397" name="__fpu_xmm8" type="_805" offset="2368" context="_500" access="public" location="f13:547" file="f13" line="547"/>
  <Field id="_1398" name="__fpu_xmm9" type="_805" offset="2496" context="_500" access="public" location="f13:548" file="f13" line="548"/>
  <Field id="_1399" name="__fpu_xmm10" type="_805" offset="2624" context="_500" access="public" location="f13:549" file="f13" line="549"/>
  <Field id="_1400" name="__fpu_xmm11" type="_805" offset="2752" context="_500" access="public" location="f13:550" file="f13" line="550"/>
  <Field id="_1401" name="__fpu_xmm12" type="_805" offset="2880" context="_500" access="public" location="f13:551" file="f13" line="551"/>
  <Field id="_1402" name="__fpu_xmm13" type="_805" offset="3008" context="_500" access="public" location="f13:552" file="f13" line="552"/>
  <Field id="_1403" name="__fpu_xmm14" type="_805" offset="3136" context="_500" access="public" location="f13:553" file="f13" line="553"/>
  <Field id="_1404" name="__fpu_xmm15" type="_805" offset="3264" context="_500" access="public" location="f13:554" file="f13" line="554"/>
  <Field id="_1405" name="__fpu_rsrv4" type="_2129" offset="3392" context="_500" access="public" location="f13:555" file="f13" line="555"/>
  <Field id="_1406" name="__fpu_reserved1" type="_18" offset="4160" context="_500" access="public" location="f13:556" file="f13" line="556"/>
  <Destructor id="_1407" name="__darwin_x86_float_state64" artificial="1" throw="" context="_500" access="public" mangled="_ZN26__darwin_x86_float_state64D1Ev *INTERNAL* " demangled="__darwin_x86_float_state64::~__darwin_x86_float_state64()" location="f13:510" file="f13" line="510" endline="510" inline="1">
  </Destructor>
  <OperatorMethod id="_1408" name="=" returns="_2130" artificial="1" throw="" context="_500" access="public" mangled="_ZN26__darwin_x86_float_state64aSERKS_" demangled="__darwin_x86_float_state64::operator=(__darwin_x86_float_state64 const&amp;)" location="f13:510" file="f13" line="510" endline="510" inline="1">
    <Argument type="_2131" location="f13:510" file="f13" line="510"/>
  </OperatorMethod>
  <Constructor id="_1409" name="__darwin_x86_float_state64" artificial="1" throw="" context="_500" access="public" mangled="_ZN26__darwin_x86_float_state64C1ERKS_ *INTERNAL* " demangled="__darwin_x86_float_state64::__darwin_x86_float_state64(__darwin_x86_float_state64 const&amp;)" location="f13:510" file="f13" line="510" endline="510" inline="1">
    <Argument type="_2131" location="f13:510" file="f13" line="510"/>
  </Constructor>
  <Constructor id="_1410" name="__darwin_x86_float_state64" artificial="1" throw="" context="_500" access="public" mangled="_ZN26__darwin_x86_float_state64C1Ev *INTERNAL* " demangled="__darwin_x86_float_state64::__darwin_x86_float_state64()" location="f13:510" file="f13" line="510" inline="1"/>
  <Field id="_1411" name="__sig" type="_104" offset="0" context="_504" access="public" location="f6:89" file="f6" line="89"/>
  <Field id="_1412" name="__opaque" type="_2132" offset="32" context="_504" access="public" location="f6:90" file="f6" line="90"/>
  <Destructor id="_1413" name="_opaque_pthread_once_t" artificial="1" throw="" context="_504" access="public" mangled="_ZN22_opaque_pthread_once_tD1Ev *INTERNAL* " demangled="_opaque_pthread_once_t::~_opaque_pthread_once_t()" location="f6:88" file="f6" line="88" endline="88" inline="1">
  </Destructor>
  <OperatorMethod id="_1414" name="=" returns="_2133" artificial="1" throw="" context="_504" access="public" mangled="_ZN22_opaque_pthread_once_taSERKS_" demangled="_opaque_pthread_once_t::operator=(_opaque_pthread_once_t const&amp;)" location="f6:88" file="f6" line="88" endline="88" inline="1">
    <Argument type="_2134" location="f6:88" file="f6" line="88"/>
  </OperatorMethod>
  <Constructor id="_1415" name="_opaque_pthread_once_t" artificial="1" throw="" context="_504" access="public" mangled="_ZN22_opaque_pthread_once_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_once_t::_opaque_pthread_once_t(_opaque_pthread_once_t const&amp;)" location="f6:88" file="f6" line="88" endline="88" inline="1">
    <Argument type="_2134" location="f6:88" file="f6" line="88"/>
  </Constructor>
  <Constructor id="_1416" name="_opaque_pthread_once_t" artificial="1" throw="" context="_504" access="public" mangled="_ZN22_opaque_pthread_once_tC1Ev *INTERNAL* " demangled="_opaque_pthread_once_t::_opaque_pthread_once_t()" location="f6:88" file="f6" line="88" inline="1"/>
  <Field id="_1417" name="sv_handler" type="_199" offset="0" context="_506" access="public" location="f24:348" file="f24" line="348"/>
  <Field id="_1418" name="sv_mask" type="_18" offset="32" context="_506" access="public" location="f24:349" file="f24" line="349"/>
  <Field id="_1419" name="sv_flags" type="_18" offset="64" context="_506" access="public" location="f24:350" file="f24" line="350"/>
  <Destructor id="_1420" name="sigvec" artificial="1" throw="" context="_506" access="public" mangled="_ZN6sigvecD1Ev *INTERNAL* " demangled="sigvec::~sigvec()" location="f24:347" file="f24" line="347" endline="347" inline="1">
  </Destructor>
  <OperatorMethod id="_1421" name="=" returns="_2135" artificial="1" throw="" context="_506" access="public" mangled="_ZN6sigvecaSERKS_" demangled="sigvec::operator=(sigvec const&amp;)" location="f24:347" file="f24" line="347" endline="347" inline="1">
    <Argument type="_2136" location="f24:347" file="f24" line="347"/>
  </OperatorMethod>
  <Constructor id="_1422" name="sigvec" artificial="1" throw="" context="_506" access="public" mangled="_ZN6sigvecC1ERKS_ *INTERNAL* " demangled="sigvec::sigvec(sigvec const&amp;)" location="f24:347" file="f24" line="347" endline="347" inline="1">
    <Argument type="_2136" location="f24:347" file="f24" line="347"/>
  </Constructor>
  <Constructor id="_1423" name="sigvec" artificial="1" throw="" context="_506" access="public" mangled="_ZN6sigvecC1Ev *INTERNAL* " demangled="sigvec::sigvec()" location="f24:347" file="f24" line="347" inline="1"/>
  <Field id="_1424" name="_p" type="_1014" offset="0" context="_507" access="public" location="f10:123" file="f10" line="123"/>
  <Field id="_1425" name="_r" type="_18" offset="32" context="_507" access="public" location="f10:124" file="f10" line="124"/>
  <Field id="_1426" name="_w" type="_18" offset="64" context="_507" access="public" location="f10:125" file="f10" line="125"/>
  <Field id="_1427" name="_flags" type="_135" offset="96" context="_507" access="public" location="f10:126" file="f10" line="126"/>
  <Field id="_1428" name="_file" type="_135" offset="112" context="_507" access="public" location="f10:127" file="f10" line="127"/>
  <Field id="_1429" name="_bf" type="_213" offset="128" context="_507" access="public" location="f10:128" file="f10" line="128"/>
  <Field id="_1430" name="_lbfsize" type="_18" offset="192" context="_507" access="public" location="f10:129" file="f10" line="129"/>
  <Field id="_1431" name="_cookie" type="_460" offset="224" context="_507" access="public" location="f10:132" file="f10" line="132"/>
  <Field id="_1432" name="_close" type="_1080" offset="256" context="_507" access="public" location="f10:133" file="f10" line="133"/>
  <Field id="_1433" name="_read" type="_1077" offset="288" context="_507" access="public" location="f10:134" file="f10" line="134"/>
  <Field id="_1434" name="_seek" type="_1079" offset="320" context="_507" access="public" location="f10:135" file="f10" line="135"/>
  <Field id="_1435" name="_write" type="_1078" offset="352" context="_507" access="public" location="f10:136" file="f10" line="136"/>
  <Field id="_1436" name="_ub" type="_213" offset="384" context="_507" access="public" location="f10:139" file="f10" line="139"/>
  <Field id="_1437" name="_extra" type="_2137" offset="448" context="_507" access="public" location="f10:140" file="f10" line="140"/>
  <Field id="_1438" name="_ur" type="_18" offset="480" context="_507" access="public" location="f10:141" file="f10" line="141"/>
  <Field id="_1439" name="_ubuf" type="_2138" offset="512" context="_507" access="public" location="f10:144" file="f10" line="144"/>
  <Field id="_1440" name="_nbuf" type="_2139" offset="536" context="_507" access="public" location="f10:145" file="f10" line="145"/>
  <Field id="_1441" name="_lb" type="_213" offset="544" context="_507" access="public" location="f10:148" file="f10" line="148"/>
  <Field id="_1442" name="_blksize" type="_18" offset="608" context="_507" access="public" location="f10:151" file="f10" line="151"/>
  <Field id="_1443" name="_offset" type="_728" offset="640" context="_507" access="public" location="f10:152" file="f10" line="152"/>
  <Destructor id="_1444" name="__sFILE" artificial="1" throw="" context="_507" access="public" mangled="_ZN7__sFILED1Ev *INTERNAL* " demangled="__sFILE::~__sFILE()" location="f10:122" file="f10" line="122" endline="122" inline="1">
  </Destructor>
  <OperatorMethod id="_1445" name="=" returns="_2140" artificial="1" throw="" context="_507" access="public" mangled="_ZN7__sFILEaSERKS_" demangled="__sFILE::operator=(__sFILE const&amp;)" location="f10:122" file="f10" line="122" endline="122" inline="1">
    <Argument type="_2141" location="f10:122" file="f10" line="122"/>
  </OperatorMethod>
  <Constructor id="_1446" name="__sFILE" artificial="1" throw="" context="_507" access="public" mangled="_ZN7__sFILEC1ERKS_ *INTERNAL* " demangled="__sFILE::__sFILE(__sFILE const&amp;)" location="f10:122" file="f10" line="122" endline="122" inline="1">
    <Argument type="_2141" location="f10:122" file="f10" line="122"/>
  </Constructor>
  <Constructor id="_1447" name="__sFILE" artificial="1" throw="" context="_507" access="public" mangled="_ZN7__sFILEC1Ev *INTERNAL* " demangled="__sFILE::__sFILE()" location="f10:122" file="f10" line="122" inline="1"/>
  <Field id="_1448" name="__dr0" type="_99" offset="0" context="_510" access="public" location="f13:773" file="f13" line="773"/>
  <Field id="_1449" name="__dr1" type="_99" offset="64" context="_510" access="public" location="f13:774" file="f13" line="774"/>
  <Field id="_1450" name="__dr2" type="_99" offset="128" context="_510" access="public" location="f13:775" file="f13" line="775"/>
  <Field id="_1451" name="__dr3" type="_99" offset="192" context="_510" access="public" location="f13:776" file="f13" line="776"/>
  <Field id="_1452" name="__dr4" type="_99" offset="256" context="_510" access="public" location="f13:777" file="f13" line="777"/>
  <Field id="_1453" name="__dr5" type="_99" offset="320" context="_510" access="public" location="f13:778" file="f13" line="778"/>
  <Field id="_1454" name="__dr6" type="_99" offset="384" context="_510" access="public" location="f13:779" file="f13" line="779"/>
  <Field id="_1455" name="__dr7" type="_99" offset="448" context="_510" access="public" location="f13:780" file="f13" line="780"/>
  <Destructor id="_1456" name="__darwin_x86_debug_state64" artificial="1" throw="" context="_510" access="public" mangled="_ZN26__darwin_x86_debug_state64D1Ev *INTERNAL* " demangled="__darwin_x86_debug_state64::~__darwin_x86_debug_state64()" location="f13:772" file="f13" line="772" endline="772" inline="1">
  </Destructor>
  <OperatorMethod id="_1457" name="=" returns="_2142" artificial="1" throw="" context="_510" access="public" mangled="_ZN26__darwin_x86_debug_state64aSERKS_" demangled="__darwin_x86_debug_state64::operator=(__darwin_x86_debug_state64 const&amp;)" location="f13:772" file="f13" line="772" endline="772" inline="1">
    <Argument type="_2143" location="f13:772" file="f13" line="772"/>
  </OperatorMethod>
  <Constructor id="_1458" name="__darwin_x86_debug_state64" artificial="1" throw="" context="_510" access="public" mangled="_ZN26__darwin_x86_debug_state64C1ERKS_ *INTERNAL* " demangled="__darwin_x86_debug_state64::__darwin_x86_debug_state64(__darwin_x86_debug_state64 const&amp;)" location="f13:772" file="f13" line="772" endline="772" inline="1">
    <Argument type="_2143" location="f13:772" file="f13" line="772"/>
  </Constructor>
  <Constructor id="_1459" name="__darwin_x86_debug_state64" artificial="1" throw="" context="_510" access="public" mangled="_ZN26__darwin_x86_debug_state64C1Ev *INTERNAL* " demangled="__darwin_x86_debug_state64::__darwin_x86_debug_state64()" location="f13:772" file="f13" line="772" inline="1"/>
  <Field id="_1460" name="r" type="_743" offset="0" context="_533" access="public" location="f19:161" file="f19" line="161"/>
  <Field id="_1461" name="g" type="_743" offset="8" context="_533" access="public" location="f19:163" file="f19" line="163"/>
  <Field id="_1462" name="b" type="_743" offset="16" context="_533" access="public" location="f19:165" file="f19" line="165"/>
  <Destructor id="_1463" name="$_20" artificial="1" throw="" context="_533" access="public" mangled="_ZN14OniRGB888PixelD1Ev *INTERNAL* " demangled="OniRGB888Pixel::~OniRGB888Pixel()" location="f19:166" file="f19" line="166" endline="166" inline="1">
  </Destructor>
  <OperatorMethod id="_1464" name="=" returns="_2144" artificial="1" throw="" context="_533" access="public" mangled="_ZN14OniRGB888PixelaSERKS_" demangled="OniRGB888Pixel::operator=(OniRGB888Pixel const&amp;)" location="f19:166" file="f19" line="166" endline="166" inline="1">
    <Argument type="_2145" location="f19:159" file="f19" line="159"/>
  </OperatorMethod>
  <Constructor id="_1465" name="$_20" artificial="1" throw="" context="_533" access="public" mangled="_ZN14OniRGB888PixelC1ERKS_ *INTERNAL* " demangled="OniRGB888Pixel::OniRGB888Pixel(OniRGB888Pixel const&amp;)" location="f19:166" file="f19" line="166" endline="166" inline="1">
    <Argument type="_2145" location="f19:159" file="f19" line="159"/>
  </Constructor>
  <Constructor id="_1466" name="$_20" artificial="1" throw="" context="_533" access="public" mangled="_ZN14OniRGB888PixelC1Ev *INTERNAL* " demangled="OniRGB888Pixel::OniRGB888Pixel()" location="f19:166" file="f19" line="166" inline="1"/>
  <Field id="_1467" name="m_State" type="_131" offset="0" context="_547" access="public" location="f2:566" file="f2" line="566"/>
  <Field id="_1468" name="m_SetPointVoltage" type="_131" offset="16" context="_547" access="public" location="f2:567" file="f2" line="567"/>
  <Field id="_1469" name="m_SetPointClocks" type="_131" offset="32" context="_547" access="public" location="f2:568" file="f2" line="568"/>
  <Field id="_1470" name="m_PD_Reading" type="_131" offset="48" context="_547" access="public" location="f2:569" file="f2" line="569"/>
  <Field id="_1471" name="m_EmitterSet" type="_131" offset="64" context="_547" access="public" location="f2:570" file="f2" line="570"/>
  <Field id="_1472" name="m_EmitterSettingLogic" type="_131" offset="80" context="_547" access="public" location="f2:571" file="f2" line="571"/>
  <Field id="_1473" name="m_LightMeasureLogic" type="_131" offset="96" context="_547" access="public" location="f2:572" file="f2" line="572"/>
  <Field id="_1474" name="m_IsAPCEnabled" type="_131" offset="112" context="_547" access="public" location="f2:573" file="f2" line="573"/>
  <Field id="_1475" name="m_EmitterSetStepSize" type="_131" offset="128" context="_547" access="public" location="f2:574" file="f2" line="574"/>
  <Field id="_1476" name="m_ApcTolerance" type="_131" offset="144" context="_547" access="public" location="f2:575" file="f2" line="575"/>
  <Field id="_1477" name="m_SubClocking" type="_131" offset="160" context="_547" access="public" location="f2:576" file="f2" line="576"/>
  <Field id="_1478" name="m_Precision" type="_131" offset="176" context="_547" access="public" location="f2:577" file="f2" line="577"/>
  <Destructor id="_1479" name="XnEmitterData" artificial="1" throw="" context="_547" access="public" mangled="_ZN13XnEmitterDataD1Ev *INTERNAL* " demangled="XnEmitterData::~XnEmitterData()" location="f2:565" file="f2" line="565" endline="565" inline="1">
  </Destructor>
  <OperatorMethod id="_1480" name="=" returns="_2146" artificial="1" throw="" context="_547" access="public" mangled="_ZN13XnEmitterDataaSERKS_" demangled="XnEmitterData::operator=(XnEmitterData const&amp;)" location="f2:565" file="f2" line="565" endline="565" inline="1">
    <Argument type="_2147" location="f2:565" file="f2" line="565"/>
  </OperatorMethod>
  <Constructor id="_1481" name="XnEmitterData" artificial="1" throw="" context="_547" access="public" mangled="_ZN13XnEmitterDataC1ERKS_ *INTERNAL* " demangled="XnEmitterData::XnEmitterData(XnEmitterData const&amp;)" location="f2:565" file="f2" line="565" endline="565" inline="1">
    <Argument type="_2147" location="f2:565" file="f2" line="565"/>
  </Constructor>
  <Constructor id="_1482" name="XnEmitterData" artificial="1" throw="" context="_547" access="public" mangled="_ZN13XnEmitterDataC1Ev *INTERNAL* " demangled="XnEmitterData::XnEmitterData()" location="f2:565" file="f2" line="565" inline="1"/>
  <Field id="_1483" name="__rax" type="_99" offset="0" context="_552" access="public" location="f13:456" file="f13" line="456"/>
  <Field id="_1484" name="__rbx" type="_99" offset="64" context="_552" access="public" location="f13:457" file="f13" line="457"/>
  <Field id="_1485" name="__rcx" type="_99" offset="128" context="_552" access="public" location="f13:458" file="f13" line="458"/>
  <Field id="_1486" name="__rdx" type="_99" offset="192" context="_552" access="public" location="f13:459" file="f13" line="459"/>
  <Field id="_1487" name="__rdi" type="_99" offset="256" context="_552" access="public" location="f13:460" file="f13" line="460"/>
  <Field id="_1488" name="__rsi" type="_99" offset="320" context="_552" access="public" location="f13:461" file="f13" line="461"/>
  <Field id="_1489" name="__rbp" type="_99" offset="384" context="_552" access="public" location="f13:462" file="f13" line="462"/>
  <Field id="_1490" name="__rsp" type="_99" offset="448" context="_552" access="public" location="f13:463" file="f13" line="463"/>
  <Field id="_1491" name="__r8" type="_99" offset="512" context="_552" access="public" location="f13:464" file="f13" line="464"/>
  <Field id="_1492" name="__r9" type="_99" offset="576" context="_552" access="public" location="f13:465" file="f13" line="465"/>
  <Field id="_1493" name="__r10" type="_99" offset="640" context="_552" access="public" location="f13:466" file="f13" line="466"/>
  <Field id="_1494" name="__r11" type="_99" offset="704" context="_552" access="public" location="f13:467" file="f13" line="467"/>
  <Field id="_1495" name="__r12" type="_99" offset="768" context="_552" access="public" location="f13:468" file="f13" line="468"/>
  <Field id="_1496" name="__r13" type="_99" offset="832" context="_552" access="public" location="f13:469" file="f13" line="469"/>
  <Field id="_1497" name="__r14" type="_99" offset="896" context="_552" access="public" location="f13:470" file="f13" line="470"/>
  <Field id="_1498" name="__r15" type="_99" offset="960" context="_552" access="public" location="f13:471" file="f13" line="471"/>
  <Field id="_1499" name="__rip" type="_99" offset="1024" context="_552" access="public" location="f13:472" file="f13" line="472"/>
  <Field id="_1500" name="__rflags" type="_99" offset="1088" context="_552" access="public" location="f13:473" file="f13" line="473"/>
  <Field id="_1501" name="__cs" type="_99" offset="1152" context="_552" access="public" location="f13:474" file="f13" line="474"/>
  <Field id="_1502" name="__fs" type="_99" offset="1216" context="_552" access="public" location="f13:475" file="f13" line="475"/>
  <Field id="_1503" name="__gs" type="_99" offset="1280" context="_552" access="public" location="f13:476" file="f13" line="476"/>
  <Destructor id="_1504" name="__darwin_x86_thread_state64" artificial="1" throw="" context="_552" access="public" mangled="_ZN27__darwin_x86_thread_state64D1Ev *INTERNAL* " demangled="__darwin_x86_thread_state64::~__darwin_x86_thread_state64()" location="f13:455" file="f13" line="455" endline="455" inline="1">
  </Destructor>
  <OperatorMethod id="_1505" name="=" returns="_2148" artificial="1" throw="" context="_552" access="public" mangled="_ZN27__darwin_x86_thread_state64aSERKS_" demangled="__darwin_x86_thread_state64::operator=(__darwin_x86_thread_state64 const&amp;)" location="f13:455" file="f13" line="455" endline="455" inline="1">
    <Argument type="_2149" location="f13:455" file="f13" line="455"/>
  </OperatorMethod>
  <Constructor id="_1506" name="__darwin_x86_thread_state64" artificial="1" throw="" context="_552" access="public" mangled="_ZN27__darwin_x86_thread_state64C1ERKS_ *INTERNAL* " demangled="__darwin_x86_thread_state64::__darwin_x86_thread_state64(__darwin_x86_thread_state64 const&amp;)" location="f13:455" file="f13" line="455" endline="455" inline="1">
    <Argument type="_2149" location="f13:455" file="f13" line="455"/>
  </Constructor>
  <Constructor id="_1507" name="__darwin_x86_thread_state64" artificial="1" throw="" context="_552" access="public" mangled="_ZN27__darwin_x86_thread_state64C1Ev *INTERNAL* " demangled="__darwin_x86_thread_state64::__darwin_x86_thread_state64()" location="f13:455" file="f13" line="455" inline="1"/>
  <Field id="_1508" name="frameIndex" type="_18" offset="0" context="_561" access="public" location="f19:189" file="f19" line="189"/>
  <Field id="_1509" name="stream" type="_683" offset="32" context="_561" access="public" location="f19:190" file="f19" line="190"/>
  <Destructor id="_1510" name="$_22" artificial="1" throw="" context="_561" access="public" mangled="_ZN7OniSeekD1Ev *INTERNAL* " demangled="OniSeek::~OniSeek()" location="f19:191" file="f19" line="191" endline="191" inline="1">
  </Destructor>
  <OperatorMethod id="_1511" name="=" returns="_2150" artificial="1" throw="" context="_561" access="public" mangled="_ZN7OniSeekaSERKS_" demangled="OniSeek::operator=(OniSeek const&amp;)" location="f19:191" file="f19" line="191" endline="191" inline="1">
    <Argument type="_2151" location="f19:188" file="f19" line="188"/>
  </OperatorMethod>
  <Constructor id="_1512" name="$_22" artificial="1" throw="" context="_561" access="public" mangled="_ZN7OniSeekC1ERKS_ *INTERNAL* " demangled="OniSeek::OniSeek(OniSeek const&amp;)" location="f19:191" file="f19" line="191" endline="191" inline="1">
    <Argument type="_2151" location="f19:188" file="f19" line="188"/>
  </Constructor>
  <Constructor id="_1513" name="$_22" artificial="1" throw="" context="_561" access="public" mangled="_ZN7OniSeekC1Ev *INTERNAL* " demangled="OniSeek::OniSeek()" location="f19:191" file="f19" line="191" inline="1"/>
  <Field id="_1514" name="__sig" type="_104" offset="0" context="_564" access="public" location="f6:74" file="f6" line="74"/>
  <Field id="_1515" name="__opaque" type="_2132" offset="32" context="_564" access="public" location="f6:75" file="f6" line="75"/>
  <Destructor id="_1516" name="_opaque_pthread_condattr_t" artificial="1" throw="" context="_564" access="public" mangled="_ZN26_opaque_pthread_condattr_tD1Ev *INTERNAL* " demangled="_opaque_pthread_condattr_t::~_opaque_pthread_condattr_t()" location="f6:73" file="f6" line="73" endline="73" inline="1">
  </Destructor>
  <OperatorMethod id="_1517" name="=" returns="_2152" artificial="1" throw="" context="_564" access="public" mangled="_ZN26_opaque_pthread_condattr_taSERKS_" demangled="_opaque_pthread_condattr_t::operator=(_opaque_pthread_condattr_t const&amp;)" location="f6:73" file="f6" line="73" endline="73" inline="1">
    <Argument type="_2153" location="f6:73" file="f6" line="73"/>
  </OperatorMethod>
  <Constructor id="_1518" name="_opaque_pthread_condattr_t" artificial="1" throw="" context="_564" access="public" mangled="_ZN26_opaque_pthread_condattr_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_condattr_t::_opaque_pthread_condattr_t(_opaque_pthread_condattr_t const&amp;)" location="f6:73" file="f6" line="73" endline="73" inline="1">
    <Argument type="_2153" location="f6:73" file="f6" line="73"/>
  </Constructor>
  <Constructor id="_1519" name="_opaque_pthread_condattr_t" artificial="1" throw="" context="_564" access="public" mangled="_ZN26_opaque_pthread_condattr_tC1Ev *INTERNAL* " demangled="_opaque_pthread_condattr_t::_opaque_pthread_condattr_t()" location="f6:73" file="f6" line="73" inline="1"/>
  <Field id="_1520" name="rlim_cur" type="_424" offset="0" context="_568" access="public" location="f31:326" file="f31" line="326"/>
  <Field id="_1521" name="rlim_max" type="_424" offset="64" context="_568" access="public" location="f31:327" file="f31" line="327"/>
  <Destructor id="_1522" name="rlimit" artificial="1" throw="" context="_568" access="public" mangled="_ZN6rlimitD1Ev *INTERNAL* " demangled="rlimit::~rlimit()" location="f31:325" file="f31" line="325" endline="325" inline="1">
  </Destructor>
  <OperatorMethod id="_1523" name="=" returns="_2154" artificial="1" throw="" context="_568" access="public" mangled="_ZN6rlimitaSERKS_" demangled="rlimit::operator=(rlimit const&amp;)" location="f31:325" file="f31" line="325" endline="325" inline="1">
    <Argument type="_2155" location="f31:325" file="f31" line="325"/>
  </OperatorMethod>
  <Constructor id="_1524" name="rlimit" artificial="1" throw="" context="_568" access="public" mangled="_ZN6rlimitC1ERKS_ *INTERNAL* " demangled="rlimit::rlimit(rlimit const&amp;)" location="f31:325" file="f31" line="325" endline="325" inline="1">
    <Argument type="_2155" location="f31:325" file="f31" line="325"/>
  </Constructor>
  <Constructor id="_1525" name="rlimit" artificial="1" throw="" context="_568" access="public" mangled="_ZN6rlimitC1Ev *INTERNAL* " demangled="rlimit::rlimit()" location="f31:325" file="f31" line="325" inline="1"/>
  <Field id="_1526" name="ri_uuid" type="_2156" offset="0" context="_574" access="public" location="f31:251" file="f31" line="251"/>
  <Field id="_1527" name="ri_user_time" type="_900" offset="128" context="_574" access="public" location="f31:252" file="f31" line="252"/>
  <Field id="_1528" name="ri_system_time" type="_900" offset="192" context="_574" access="public" location="f31:253" file="f31" line="253"/>
  <Field id="_1529" name="ri_pkg_idle_wkups" type="_900" offset="256" context="_574" access="public" location="f31:254" file="f31" line="254"/>
  <Field id="_1530" name="ri_interrupt_wkups" type="_900" offset="320" context="_574" access="public" location="f31:255" file="f31" line="255"/>
  <Field id="_1531" name="ri_pageins" type="_900" offset="384" context="_574" access="public" location="f31:256" file="f31" line="256"/>
  <Field id="_1532" name="ri_wired_size" type="_900" offset="448" context="_574" access="public" location="f31:257" file="f31" line="257"/>
  <Field id="_1533" name="ri_resident_size" type="_900" offset="512" context="_574" access="public" location="f31:258" file="f31" line="258"/>
  <Field id="_1534" name="ri_phys_footprint" type="_900" offset="576" context="_574" access="public" location="f31:259" file="f31" line="259"/>
  <Field id="_1535" name="ri_proc_start_abstime" type="_900" offset="640" context="_574" access="public" location="f31:260" file="f31" line="260"/>
  <Field id="_1536" name="ri_proc_exit_abstime" type="_900" offset="704" context="_574" access="public" location="f31:261" file="f31" line="261"/>
  <Field id="_1537" name="ri_child_user_time" type="_900" offset="768" context="_574" access="public" location="f31:262" file="f31" line="262"/>
  <Field id="_1538" name="ri_child_system_time" type="_900" offset="832" context="_574" access="public" location="f31:263" file="f31" line="263"/>
  <Field id="_1539" name="ri_child_pkg_idle_wkups" type="_900" offset="896" context="_574" access="public" location="f31:264" file="f31" line="264"/>
  <Field id="_1540" name="ri_child_interrupt_wkups" type="_900" offset="960" context="_574" access="public" location="f31:265" file="f31" line="265"/>
  <Field id="_1541" name="ri_child_pageins" type="_900" offset="1024" context="_574" access="public" location="f31:266" file="f31" line="266"/>
  <Field id="_1542" name="ri_child_elapsed_abstime" type="_900" offset="1088" context="_574" access="public" location="f31:267" file="f31" line="267"/>
  <Field id="_1543" name="ri_diskio_bytesread" type="_900" offset="1152" context="_574" access="public" location="f31:268" file="f31" line="268"/>
  <Field id="_1544" name="ri_diskio_byteswritten" type="_900" offset="1216" context="_574" access="public" location="f31:269" file="f31" line="269"/>
  <Field id="_1545" name="ri_cpu_time_qos_default" type="_900" offset="1280" context="_574" access="public" location="f31:270" file="f31" line="270"/>
  <Field id="_1546" name="ri_cpu_time_qos_maintenance" type="_900" offset="1344" context="_574" access="public" location="f31:271" file="f31" line="271"/>
  <Field id="_1547" name="ri_cpu_time_qos_background" type="_900" offset="1408" context="_574" access="public" location="f31:272" file="f31" line="272"/>
  <Field id="_1548" name="ri_cpu_time_qos_utility" type="_900" offset="1472" context="_574" access="public" location="f31:273" file="f31" line="273"/>
  <Field id="_1549" name="ri_cpu_time_qos_legacy" type="_900" offset="1536" context="_574" access="public" location="f31:274" file="f31" line="274"/>
  <Field id="_1550" name="ri_cpu_time_qos_user_initiated" type="_900" offset="1600" context="_574" access="public" location="f31:275" file="f31" line="275"/>
  <Field id="_1551" name="ri_cpu_time_qos_user_interactive" type="_900" offset="1664" context="_574" access="public" location="f31:276" file="f31" line="276"/>
  <Field id="_1552" name="ri_billed_system_time" type="_900" offset="1728" context="_574" access="public" location="f31:277" file="f31" line="277"/>
  <Field id="_1553" name="ri_serviced_system_time" type="_900" offset="1792" context="_574" access="public" location="f31:278" file="f31" line="278"/>
  <Destructor id="_1554" name="rusage_info_v3" artificial="1" throw="" context="_574" access="public" mangled="_ZN14rusage_info_v3D1Ev *INTERNAL* " demangled="rusage_info_v3::~rusage_info_v3()" location="f31:250" file="f31" line="250" endline="250" inline="1">
  </Destructor>
  <OperatorMethod id="_1555" name="=" returns="_2157" artificial="1" throw="" context="_574" access="public" mangled="_ZN14rusage_info_v3aSERKS_" demangled="rusage_info_v3::operator=(rusage_info_v3 const&amp;)" location="f31:250" file="f31" line="250" endline="250" inline="1">
    <Argument type="_2158" location="f31:250" file="f31" line="250"/>
  </OperatorMethod>
  <Constructor id="_1556" name="rusage_info_v3" artificial="1" throw="" context="_574" access="public" mangled="_ZN14rusage_info_v3C1ERKS_ *INTERNAL* " demangled="rusage_info_v3::rusage_info_v3(rusage_info_v3 const&amp;)" location="f31:250" file="f31" line="250" endline="250" inline="1">
    <Argument type="_2158" location="f31:250" file="f31" line="250"/>
  </Constructor>
  <Constructor id="_1557" name="rusage_info_v3" artificial="1" throw="" context="_574" access="public" mangled="_ZN14rusage_info_v3C1Ev *INTERNAL* " demangled="rusage_info_v3::rusage_info_v3()" location="f31:250" file="f31" line="250" inline="1"/>
  <Field id="_1558" name="__mmst_reg" type="_2159" offset="0" context="_585" access="public" location="f13:193" file="f13" line="193"/>
  <Field id="_1559" name="__mmst_rsrv" type="_2160" offset="80" context="_585" access="public" location="f13:194" file="f13" line="194"/>
  <Destructor id="_1560" name="__darwin_mmst_reg" artificial="1" throw="" context="_585" access="public" mangled="_ZN17__darwin_mmst_regD1Ev *INTERNAL* " demangled="__darwin_mmst_reg::~__darwin_mmst_reg()" location="f13:192" file="f13" line="192" endline="192" inline="1">
  </Destructor>
  <OperatorMethod id="_1561" name="=" returns="_2161" artificial="1" throw="" context="_585" access="public" mangled="_ZN17__darwin_mmst_regaSERKS_" demangled="__darwin_mmst_reg::operator=(__darwin_mmst_reg const&amp;)" location="f13:192" file="f13" line="192" endline="192" inline="1">
    <Argument type="_2162" location="f13:192" file="f13" line="192"/>
  </OperatorMethod>
  <Constructor id="_1562" name="__darwin_mmst_reg" artificial="1" throw="" context="_585" access="public" mangled="_ZN17__darwin_mmst_regC1ERKS_ *INTERNAL* " demangled="__darwin_mmst_reg::__darwin_mmst_reg(__darwin_mmst_reg const&amp;)" location="f13:192" file="f13" line="192" endline="192" inline="1">
    <Argument type="_2162" location="f13:192" file="f13" line="192"/>
  </Constructor>
  <Constructor id="_1563" name="__darwin_mmst_reg" artificial="1" throw="" context="_585" access="public" mangled="_ZN17__darwin_mmst_regC1Ev *INTERNAL* " demangled="__darwin_mmst_reg::__darwin_mmst_reg()" location="f13:192" file="f13" line="192" inline="1"/>
  <PointerType id="_1564" type="_568c" size="32" align="32"/>
  <Field id="_1565" name="__es" type="_450" offset="0" context="_597" access="public" location="f14:48" file="f14" line="48"/>
  <Field id="_1566" name="__ss" type="_294" offset="96" context="_597" access="public" location="f14:49" file="f14" line="49"/>
  <Field id="_1567" name="__fs" type="_889" offset="608" context="_597" access="public" location="f14:50" file="f14" line="50"/>
  <Destructor id="_1568" name="__darwin_mcontext_avx32" artificial="1" throw="" context="_597" access="public" mangled="_ZN23__darwin_mcontext_avx32D1Ev *INTERNAL* " demangled="__darwin_mcontext_avx32::~__darwin_mcontext_avx32()" location="f14:47" file="f14" line="47" endline="47" inline="1">
  </Destructor>
  <OperatorMethod id="_1569" name="=" returns="_2164" artificial="1" throw="" context="_597" access="public" mangled="_ZN23__darwin_mcontext_avx32aSERKS_" demangled="__darwin_mcontext_avx32::operator=(__darwin_mcontext_avx32 const&amp;)" location="f14:47" file="f14" line="47" endline="47" inline="1">
    <Argument type="_2165" location="f14:47" file="f14" line="47"/>
  </OperatorMethod>
  <Constructor id="_1570" name="__darwin_mcontext_avx32" artificial="1" throw="" context="_597" access="public" mangled="_ZN23__darwin_mcontext_avx32C1ERKS_ *INTERNAL* " demangled="__darwin_mcontext_avx32::__darwin_mcontext_avx32(__darwin_mcontext_avx32 const&amp;)" location="f14:47" file="f14" line="47" endline="47" inline="1">
    <Argument type="_2165" location="f14:47" file="f14" line="47"/>
  </Constructor>
  <Constructor id="_1571" name="__darwin_mcontext_avx32" artificial="1" throw="" context="_597" access="public" mangled="_ZN23__darwin_mcontext_avx32C1Ev *INTERNAL* " demangled="__darwin_mcontext_avx32::__darwin_mcontext_avx32()" location="f14:47" file="f14" line="47" inline="1"/>
  <Field id="_1573" name="nMajor" type="_280" offset="0" context="_605" access="public" location="f2:447" file="f2" line="447"/>
  <Field id="_1574" name="nMinor" type="_280" offset="8" context="_605" access="public" location="f2:448" file="f2" line="448"/>
  <Field id="_1575" name="nBuild" type="_130" offset="16" context="_605" access="public" location="f2:449" file="f2" line="449"/>
  <Field id="_1576" name="nChip" type="_78" offset="32" context="_605" access="public" location="f2:450" file="f2" line="450"/>
  <Field id="_1577" name="nFPGA" type="_130" offset="64" context="_605" access="public" location="f2:451" file="f2" line="451"/>
  <Field id="_1578" name="nSystemVersion" type="_130" offset="80" context="_605" access="public" location="f2:452" file="f2" line="452"/>
  <Field id="_1579" name="SDK" type="_402" offset="96" context="_605" access="public" location="f2:454" file="f2" line="454"/>
  <Field id="_1580" name="HWVer" type="_536" offset="136" context="_605" access="public" location="f2:456" file="f2" line="456"/>
  <Field id="_1581" name="FWVer" type="_534" offset="168" context="_605" access="public" location="f2:457" file="f2" line="457"/>
  <Field id="_1582" name="SensorVer" type="_247" offset="200" context="_605" access="public" location="f2:458" file="f2" line="458"/>
  <Field id="_1583" name="ChipVer" type="_311" offset="232" context="_605" access="public" location="f2:459" file="f2" line="459"/>
  <Destructor id="_1584" name="$_36" artificial="1" throw="" context="_605" access="public" mangled="_ZN10XnVersionsD1Ev *INTERNAL* " demangled="XnVersions::~XnVersions()" location="f2:460" file="f2" line="460" endline="460" inline="1">
  </Destructor>
  <OperatorMethod id="_1585" name="=" returns="_2166" artificial="1" throw="" context="_605" access="public" mangled="_ZN10XnVersionsaSERKS_" demangled="XnVersions::operator=(XnVersions const&amp;)" location="f2:460" file="f2" line="460" endline="460" inline="1">
    <Argument type="_2167" location="f2:446" file="f2" line="446"/>
  </OperatorMethod>
  <Constructor id="_1586" name="$_36" artificial="1" throw="" context="_605" access="public" mangled="_ZN10XnVersionsC1ERKS_ *INTERNAL* " demangled="XnVersions::XnVersions(XnVersions const&amp;)" location="f2:460" file="f2" line="460" endline="460" inline="1">
    <Argument type="_2167" location="f2:446" file="f2" line="446"/>
  </Constructor>
  <Constructor id="_1587" name="$_36" artificial="1" throw="" context="_605" access="public" mangled="_ZN10XnVersionsC1Ev *INTERNAL* " demangled="XnVersions::XnVersions()" location="f2:460" file="f2" line="460" inline="1"/>
  <Field id="_1588" name="__es" type="_736" offset="0" context="_607" access="public" location="f14:86" file="f14" line="86"/>
  <Field id="_1589" name="__ss" type="_552" offset="128" context="_607" access="public" location="f14:87" file="f14" line="87"/>
  <Field id="_1590" name="__fs" type="_870" offset="1472" context="_607" access="public" location="f14:88" file="f14" line="88"/>
  <Destructor id="_1591" name="__darwin_mcontext_avx64" artificial="1" throw="" context="_607" access="public" mangled="_ZN23__darwin_mcontext_avx64D1Ev *INTERNAL* " demangled="__darwin_mcontext_avx64::~__darwin_mcontext_avx64()" location="f14:85" file="f14" line="85" endline="85" inline="1">
  </Destructor>
  <OperatorMethod id="_1592" name="=" returns="_2168" artificial="1" throw="" context="_607" access="public" mangled="_ZN23__darwin_mcontext_avx64aSERKS_" demangled="__darwin_mcontext_avx64::operator=(__darwin_mcontext_avx64 const&amp;)" location="f14:85" file="f14" line="85" endline="85" inline="1">
    <Argument type="_2169" location="f14:85" file="f14" line="85"/>
  </OperatorMethod>
  <Constructor id="_1593" name="__darwin_mcontext_avx64" artificial="1" throw="" context="_607" access="public" mangled="_ZN23__darwin_mcontext_avx64C1ERKS_ *INTERNAL* " demangled="__darwin_mcontext_avx64::__darwin_mcontext_avx64(__darwin_mcontext_avx64 const&amp;)" location="f14:85" file="f14" line="85" endline="85" inline="1">
    <Argument type="_2169" location="f14:85" file="f14" line="85"/>
  </Constructor>
  <Constructor id="_1594" name="__darwin_mcontext_avx64" artificial="1" throw="" context="_607" access="public" mangled="_ZN23__darwin_mcontext_avx64C1Ev *INTERNAL* " demangled="__darwin_mcontext_avx64::__darwin_mcontext_avx64()" location="f14:85" file="f14" line="85" inline="1"/>
  <Field id="_1595" name="__sig" type="_104" offset="0" context="_609" access="public" location="f6:99" file="f6" line="99"/>
  <Field id="_1596" name="__opaque" type="_2170" offset="32" context="_609" access="public" location="f6:100" file="f6" line="100"/>
  <Destructor id="_1597" name="_opaque_pthread_rwlockattr_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN28_opaque_pthread_rwlockattr_tD1Ev *INTERNAL* " demangled="_opaque_pthread_rwlockattr_t::~_opaque_pthread_rwlockattr_t()" location="f6:98" file="f6" line="98" endline="98" inline="1">
  </Destructor>
  <OperatorMethod id="_1598" name="=" returns="_2171" artificial="1" throw="" context="_609" access="public" mangled="_ZN28_opaque_pthread_rwlockattr_taSERKS_" demangled="_opaque_pthread_rwlockattr_t::operator=(_opaque_pthread_rwlockattr_t const&amp;)" location="f6:98" file="f6" line="98" endline="98" inline="1">
    <Argument type="_2172" location="f6:98" file="f6" line="98"/>
  </OperatorMethod>
  <Constructor id="_1599" name="_opaque_pthread_rwlockattr_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN28_opaque_pthread_rwlockattr_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_rwlockattr_t::_opaque_pthread_rwlockattr_t(_opaque_pthread_rwlockattr_t const&amp;)" location="f6:98" file="f6" line="98" endline="98" inline="1">
    <Argument type="_2172" location="f6:98" file="f6" line="98"/>
  </Constructor>
  <Constructor id="_1600" name="_opaque_pthread_rwlockattr_t" artificial="1" throw="" context="_609" access="public" mangled="_ZN28_opaque_pthread_rwlockattr_tC1Ev *INTERNAL* " demangled="_opaque_pthread_rwlockattr_t::_opaque_pthread_rwlockattr_t()" location="f6:98" file="f6" line="98" inline="1"/>
  <PointerType id="_1601" type="_629" size="32" align="32"/>
  <Field id="_1602" name="tz_minuteswest" type="_18" offset="0" context="_626" access="public" location="f29:125" file="f29" line="125"/>
  <Field id="_1603" name="tz_dsttime" type="_18" offset="32" context="_626" access="public" location="f29:126" file="f29" line="126"/>
  <Destructor id="_1604" name="timezone" artificial="1" throw="" context="_626" access="public" mangled="_ZN8timezoneD1Ev *INTERNAL* " demangled="timezone::~timezone()" location="f29:124" file="f29" line="124" endline="124" inline="1">
  </Destructor>
  <OperatorMethod id="_1605" name="=" returns="_2173" artificial="1" throw="" context="_626" access="public" mangled="_ZN8timezoneaSERKS_" demangled="timezone::operator=(timezone const&amp;)" location="f29:124" file="f29" line="124" endline="124" inline="1">
    <Argument type="_2174" location="f29:124" file="f29" line="124"/>
  </OperatorMethod>
  <Constructor id="_1606" name="timezone" artificial="1" throw="" context="_626" access="public" mangled="_ZN8timezoneC1ERKS_ *INTERNAL* " demangled="timezone::timezone(timezone const&amp;)" location="f29:124" file="f29" line="124" endline="124" inline="1">
    <Argument type="_2174" location="f29:124" file="f29" line="124"/>
  </Constructor>
  <Constructor id="_1607" name="timezone" artificial="1" throw="" context="_626" access="public" mangled="_ZN8timezoneC1Ev *INTERNAL* " demangled="timezone::timezone()" location="f29:124" file="f29" line="124" inline="1"/>
  <Field id="_1608" name="ri_uuid" type="_2156" offset="0" context="_627" access="public" location="f31:209" file="f31" line="209"/>
  <Field id="_1609" name="ri_user_time" type="_900" offset="128" context="_627" access="public" location="f31:210" file="f31" line="210"/>
  <Field id="_1610" name="ri_system_time" type="_900" offset="192" context="_627" access="public" location="f31:211" file="f31" line="211"/>
  <Field id="_1611" name="ri_pkg_idle_wkups" type="_900" offset="256" context="_627" access="public" location="f31:212" file="f31" line="212"/>
  <Field id="_1612" name="ri_interrupt_wkups" type="_900" offset="320" context="_627" access="public" location="f31:213" file="f31" line="213"/>
  <Field id="_1613" name="ri_pageins" type="_900" offset="384" context="_627" access="public" location="f31:214" file="f31" line="214"/>
  <Field id="_1614" name="ri_wired_size" type="_900" offset="448" context="_627" access="public" location="f31:215" file="f31" line="215"/>
  <Field id="_1615" name="ri_resident_size" type="_900" offset="512" context="_627" access="public" location="f31:216" file="f31" line="216"/>
  <Field id="_1616" name="ri_phys_footprint" type="_900" offset="576" context="_627" access="public" location="f31:217" file="f31" line="217"/>
  <Field id="_1617" name="ri_proc_start_abstime" type="_900" offset="640" context="_627" access="public" location="f31:218" file="f31" line="218"/>
  <Field id="_1618" name="ri_proc_exit_abstime" type="_900" offset="704" context="_627" access="public" location="f31:219" file="f31" line="219"/>
  <Field id="_1619" name="ri_child_user_time" type="_900" offset="768" context="_627" access="public" location="f31:220" file="f31" line="220"/>
  <Field id="_1620" name="ri_child_system_time" type="_900" offset="832" context="_627" access="public" location="f31:221" file="f31" line="221"/>
  <Field id="_1621" name="ri_child_pkg_idle_wkups" type="_900" offset="896" context="_627" access="public" location="f31:222" file="f31" line="222"/>
  <Field id="_1622" name="ri_child_interrupt_wkups" type="_900" offset="960" context="_627" access="public" location="f31:223" file="f31" line="223"/>
  <Field id="_1623" name="ri_child_pageins" type="_900" offset="1024" context="_627" access="public" location="f31:224" file="f31" line="224"/>
  <Field id="_1624" name="ri_child_elapsed_abstime" type="_900" offset="1088" context="_627" access="public" location="f31:225" file="f31" line="225"/>
  <Destructor id="_1625" name="rusage_info_v1" artificial="1" throw="" context="_627" access="public" mangled="_ZN14rusage_info_v1D1Ev *INTERNAL* " demangled="rusage_info_v1::~rusage_info_v1()" location="f31:208" file="f31" line="208" endline="208" inline="1">
  </Destructor>
  <OperatorMethod id="_1626" name="=" returns="_2175" artificial="1" throw="" context="_627" access="public" mangled="_ZN14rusage_info_v1aSERKS_" demangled="rusage_info_v1::operator=(rusage_info_v1 const&amp;)" location="f31:208" file="f31" line="208" endline="208" inline="1">
    <Argument type="_2176" location="f31:208" file="f31" line="208"/>
  </OperatorMethod>
  <Constructor id="_1627" name="rusage_info_v1" artificial="1" throw="" context="_627" access="public" mangled="_ZN14rusage_info_v1C1ERKS_ *INTERNAL* " demangled="rusage_info_v1::rusage_info_v1(rusage_info_v1 const&amp;)" location="f31:208" file="f31" line="208" endline="208" inline="1">
    <Argument type="_2176" location="f31:208" file="f31" line="208"/>
  </Constructor>
  <Constructor id="_1628" name="rusage_info_v1" artificial="1" throw="" context="_627" access="public" mangled="_ZN14rusage_info_v1C1Ev *INTERNAL* " demangled="rusage_info_v1::rusage_info_v1()" location="f31:208" file="f31" line="208" inline="1"/>
  <Field id="_1629" name="ri_uuid" type="_2156" offset="0" context="_628" access="public" location="f31:229" file="f31" line="229"/>
  <Field id="_1630" name="ri_user_time" type="_900" offset="128" context="_628" access="public" location="f31:230" file="f31" line="230"/>
  <Field id="_1631" name="ri_system_time" type="_900" offset="192" context="_628" access="public" location="f31:231" file="f31" line="231"/>
  <Field id="_1632" name="ri_pkg_idle_wkups" type="_900" offset="256" context="_628" access="public" location="f31:232" file="f31" line="232"/>
  <Field id="_1633" name="ri_interrupt_wkups" type="_900" offset="320" context="_628" access="public" location="f31:233" file="f31" line="233"/>
  <Field id="_1634" name="ri_pageins" type="_900" offset="384" context="_628" access="public" location="f31:234" file="f31" line="234"/>
  <Field id="_1635" name="ri_wired_size" type="_900" offset="448" context="_628" access="public" location="f31:235" file="f31" line="235"/>
  <Field id="_1636" name="ri_resident_size" type="_900" offset="512" context="_628" access="public" location="f31:236" file="f31" line="236"/>
  <Field id="_1637" name="ri_phys_footprint" type="_900" offset="576" context="_628" access="public" location="f31:237" file="f31" line="237"/>
  <Field id="_1638" name="ri_proc_start_abstime" type="_900" offset="640" context="_628" access="public" location="f31:238" file="f31" line="238"/>
  <Field id="_1639" name="ri_proc_exit_abstime" type="_900" offset="704" context="_628" access="public" location="f31:239" file="f31" line="239"/>
  <Field id="_1640" name="ri_child_user_time" type="_900" offset="768" context="_628" access="public" location="f31:240" file="f31" line="240"/>
  <Field id="_1641" name="ri_child_system_time" type="_900" offset="832" context="_628" access="public" location="f31:241" file="f31" line="241"/>
  <Field id="_1642" name="ri_child_pkg_idle_wkups" type="_900" offset="896" context="_628" access="public" location="f31:242" file="f31" line="242"/>
  <Field id="_1643" name="ri_child_interrupt_wkups" type="_900" offset="960" context="_628" access="public" location="f31:243" file="f31" line="243"/>
  <Field id="_1644" name="ri_child_pageins" type="_900" offset="1024" context="_628" access="public" location="f31:244" file="f31" line="244"/>
  <Field id="_1645" name="ri_child_elapsed_abstime" type="_900" offset="1088" context="_628" access="public" location="f31:245" file="f31" line="245"/>
  <Field id="_1646" name="ri_diskio_bytesread" type="_900" offset="1152" context="_628" access="public" location="f31:246" file="f31" line="246"/>
  <Field id="_1647" name="ri_diskio_byteswritten" type="_900" offset="1216" context="_628" access="public" location="f31:247" file="f31" line="247"/>
  <Destructor id="_1648" name="rusage_info_v2" artificial="1" throw="" context="_628" access="public" mangled="_ZN14rusage_info_v2D1Ev *INTERNAL* " demangled="rusage_info_v2::~rusage_info_v2()" location="f31:228" file="f31" line="228" endline="228" inline="1">
  </Destructor>
  <OperatorMethod id="_1649" name="=" returns="_2177" artificial="1" throw="" context="_628" access="public" mangled="_ZN14rusage_info_v2aSERKS_" demangled="rusage_info_v2::operator=(rusage_info_v2 const&amp;)" location="f31:228" file="f31" line="228" endline="228" inline="1">
    <Argument type="_2178" location="f31:228" file="f31" line="228"/>
  </OperatorMethod>
  <Constructor id="_1650" name="rusage_info_v2" artificial="1" throw="" context="_628" access="public" mangled="_ZN14rusage_info_v2C1ERKS_ *INTERNAL* " demangled="rusage_info_v2::rusage_info_v2(rusage_info_v2 const&amp;)" location="f31:228" file="f31" line="228" endline="228" inline="1">
    <Argument type="_2178" location="f31:228" file="f31" line="228"/>
  </Constructor>
  <Constructor id="_1651" name="rusage_info_v2" artificial="1" throw="" context="_628" access="public" mangled="_ZN14rusage_info_v2C1Ev *INTERNAL* " demangled="rusage_info_v2::rusage_info_v2()" location="f31:228" file="f31" line="228" inline="1"/>
  <Field id="_1652" name="ru_utime" type="_12" offset="0" context="_629" access="public" location="f31:153" file="f31" line="153"/>
  <Field id="_1653" name="ru_stime" type="_12" offset="64" context="_629" access="public" location="f31:154" file="f31" line="154"/>
  <Field id="_1654" name="ru_maxrss" type="_104" offset="128" context="_629" access="public" location="f31:163" file="f31" line="163"/>
  <Field id="_1655" name="ru_ixrss" type="_104" offset="160" context="_629" access="public" location="f31:165" file="f31" line="165"/>
  <Field id="_1656" name="ru_idrss" type="_104" offset="192" context="_629" access="public" location="f31:166" file="f31" line="166"/>
  <Field id="_1657" name="ru_isrss" type="_104" offset="224" context="_629" access="public" location="f31:167" file="f31" line="167"/>
  <Field id="_1658" name="ru_minflt" type="_104" offset="256" context="_629" access="public" location="f31:168" file="f31" line="168"/>
  <Field id="_1659" name="ru_majflt" type="_104" offset="288" context="_629" access="public" location="f31:169" file="f31" line="169"/>
  <Field id="_1660" name="ru_nswap" type="_104" offset="320" context="_629" access="public" location="f31:170" file="f31" line="170"/>
  <Field id="_1661" name="ru_inblock" type="_104" offset="352" context="_629" access="public" location="f31:171" file="f31" line="171"/>
  <Field id="_1662" name="ru_oublock" type="_104" offset="384" context="_629" access="public" location="f31:172" file="f31" line="172"/>
  <Field id="_1663" name="ru_msgsnd" type="_104" offset="416" context="_629" access="public" location="f31:173" file="f31" line="173"/>
  <Field id="_1664" name="ru_msgrcv" type="_104" offset="448" context="_629" access="public" location="f31:174" file="f31" line="174"/>
  <Field id="_1665" name="ru_nsignals" type="_104" offset="480" context="_629" access="public" location="f31:175" file="f31" line="175"/>
  <Field id="_1666" name="ru_nvcsw" type="_104" offset="512" context="_629" access="public" location="f31:176" file="f31" line="176"/>
  <Field id="_1667" name="ru_nivcsw" type="_104" offset="544" context="_629" access="public" location="f31:177" file="f31" line="177"/>
  <Destructor id="_1668" name="rusage" artificial="1" throw="" context="_629" access="public" mangled="_ZN6rusageD1Ev *INTERNAL* " demangled="rusage::~rusage()" location="f31:152" file="f31" line="152" endline="152" inline="1">
  </Destructor>
  <OperatorMethod id="_1669" name="=" returns="_2179" artificial="1" throw="" context="_629" access="public" mangled="_ZN6rusageaSERKS_" demangled="rusage::operator=(rusage const&amp;)" location="f31:152" file="f31" line="152" endline="152" inline="1">
    <Argument type="_2180" location="f31:152" file="f31" line="152"/>
  </OperatorMethod>
  <Constructor id="_1670" name="rusage" artificial="1" throw="" context="_629" access="public" mangled="_ZN6rusageC1ERKS_ *INTERNAL* " demangled="rusage::rusage(rusage const&amp;)" location="f31:152" file="f31" line="152" endline="152" inline="1">
    <Argument type="_2180" location="f31:152" file="f31" line="152"/>
  </Constructor>
  <Constructor id="_1671" name="rusage" artificial="1" throw="" context="_629" access="public" mangled="_ZN6rusageC1Ev *INTERNAL* " demangled="rusage::rusage()" location="f31:152" file="f31" line="152" inline="1"/>
  <PointerType id="_1672" type="_460" size="32" align="32"/>
  <PointerType id="_1673" type="_872" size="32" align="32"/>
  <Field id="_1674" name="quot" type="_18" offset="0" context="_646" access="public" location="f11:83" file="f11" line="83"/>
  <Field id="_1675" name="rem" type="_18" offset="32" context="_646" access="public" location="f11:84" file="f11" line="84"/>
  <Destructor id="_1676" name="$_4" artificial="1" throw="" context="_646" access="public" mangled="_ZN5div_tD1Ev *INTERNAL* " demangled="div_t::~div_t()" location="f11:85" file="f11" line="85" endline="85" inline="1">
  </Destructor>
  <OperatorMethod id="_1677" name="=" returns="_2181" artificial="1" throw="" context="_646" access="public" mangled="_ZN5div_taSERKS_" demangled="div_t::operator=(div_t const&amp;)" location="f11:85" file="f11" line="85" endline="85" inline="1">
    <Argument type="_2182" location="f11:82" file="f11" line="82"/>
  </OperatorMethod>
  <Constructor id="_1678" name="$_4" artificial="1" throw="" context="_646" access="public" mangled="_ZN5div_tC1ERKS_ *INTERNAL* " demangled="div_t::div_t(div_t const&amp;)" location="f11:85" file="f11" line="85" endline="85" inline="1">
    <Argument type="_2182" location="f11:82" file="f11" line="82"/>
  </Constructor>
  <Constructor id="_1679" name="$_4" artificial="1" throw="" context="_646" access="public" mangled="_ZN5div_tC1Ev *INTERNAL* " demangled="div_t::div_t()" location="f11:85" file="f11" line="85" inline="1"/>
  <PointerType id="_1680" type="_568" size="32" align="32"/>
  <FundamentalType id="_1139" name="char" size="8" align="8"/>
  <Field id="_1682" name="__sig" type="_104" offset="0" context="_678" access="public" location="f6:84" file="f6" line="84"/>
  <Field id="_1683" name="__opaque" type="_2132" offset="32" context="_678" access="public" location="f6:85" file="f6" line="85"/>
  <Destructor id="_1684" name="_opaque_pthread_mutexattr_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN27_opaque_pthread_mutexattr_tD1Ev *INTERNAL* " demangled="_opaque_pthread_mutexattr_t::~_opaque_pthread_mutexattr_t()" location="f6:83" file="f6" line="83" endline="83" inline="1">
  </Destructor>
  <OperatorMethod id="_1685" name="=" returns="_2183" artificial="1" throw="" context="_678" access="public" mangled="_ZN27_opaque_pthread_mutexattr_taSERKS_" demangled="_opaque_pthread_mutexattr_t::operator=(_opaque_pthread_mutexattr_t const&amp;)" location="f6:83" file="f6" line="83" endline="83" inline="1">
    <Argument type="_2184" location="f6:83" file="f6" line="83"/>
  </OperatorMethod>
  <Constructor id="_1686" name="_opaque_pthread_mutexattr_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN27_opaque_pthread_mutexattr_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_mutexattr_t::_opaque_pthread_mutexattr_t(_opaque_pthread_mutexattr_t const&amp;)" location="f6:83" file="f6" line="83" endline="83" inline="1">
    <Argument type="_2184" location="f6:83" file="f6" line="83"/>
  </Constructor>
  <Constructor id="_1687" name="_opaque_pthread_mutexattr_t" artificial="1" throw="" context="_678" access="public" mangled="_ZN27_opaque_pthread_mutexattr_tC1Ev *INTERNAL* " demangled="_opaque_pthread_mutexattr_t::_opaque_pthread_mutexattr_t()" location="f6:83" file="f6" line="83" inline="1"/>
  <Field id="_1688" name="nDepthX" type="_78" offset="0" context="_679" access="public" location="f2:490" file="f2" line="490"/>
  <Field id="_1689" name="nDepthY" type="_78" offset="32" context="_679" access="public" location="f2:491" file="f2" line="491"/>
  <Field id="_1690" name="nDepthValue" type="_131" offset="64" context="_679" access="public" location="f2:492" file="f2" line="492"/>
  <Field id="_1691" name="nImageXRes" type="_78" offset="80" context="_679" access="public" location="f2:493" file="f2" line="493"/>
  <Field id="_1692" name="nImageYRes" type="_78" offset="112" context="_679" access="public" location="f2:494" file="f2" line="494"/>
  <Field id="_1693" name="nImageX" type="_78" offset="144" context="_679" access="public" location="f2:495" file="f2" line="495"/>
  <Field id="_1694" name="nImageY" type="_78" offset="176" context="_679" access="public" location="f2:496" file="f2" line="496"/>
  <Destructor id="_1695" name="XnPixelRegistration" artificial="1" throw="" context="_679" access="public" mangled="_ZN19XnPixelRegistrationD1Ev *INTERNAL* " demangled="XnPixelRegistration::~XnPixelRegistration()" location="f2:489" file="f2" line="489" endline="489" inline="1">
  </Destructor>
  <OperatorMethod id="_1696" name="=" returns="_2185" artificial="1" throw="" context="_679" access="public" mangled="_ZN19XnPixelRegistrationaSERKS_" demangled="XnPixelRegistration::operator=(XnPixelRegistration const&amp;)" location="f2:489" file="f2" line="489" endline="489" inline="1">
    <Argument type="_2186" location="f2:489" file="f2" line="489"/>
  </OperatorMethod>
  <Constructor id="_1697" name="XnPixelRegistration" artificial="1" throw="" context="_679" access="public" mangled="_ZN19XnPixelRegistrationC1ERKS_ *INTERNAL* " demangled="XnPixelRegistration::XnPixelRegistration(XnPixelRegistration const&amp;)" location="f2:489" file="f2" line="489" endline="489" inline="1">
    <Argument type="_2186" location="f2:489" file="f2" line="489"/>
  </Constructor>
  <Constructor id="_1698" name="XnPixelRegistration" artificial="1" throw="" context="_679" access="public" mangled="_ZN19XnPixelRegistrationC1Ev *INTERNAL* " demangled="XnPixelRegistration::XnPixelRegistration()" location="f2:489" file="f2" line="489" inline="1"/>
  <Field id="_1699" name="it_interval" type="_12" offset="0" context="_687" access="public" location="f29:87" file="f29" line="87"/>
  <Field id="_1700" name="it_value" type="_12" offset="64" context="_687" access="public" location="f29:88" file="f29" line="88"/>
  <Destructor id="_1701" name="itimerval" artificial="1" throw="" context="_687" access="public" mangled="_ZN9itimervalD1Ev *INTERNAL* " demangled="itimerval::~itimerval()" location="f29:86" file="f29" line="86" endline="86" inline="1">
  </Destructor>
  <OperatorMethod id="_1702" name="=" returns="_2187" artificial="1" throw="" context="_687" access="public" mangled="_ZN9itimervalaSERKS_" demangled="itimerval::operator=(itimerval const&amp;)" location="f29:86" file="f29" line="86" endline="86" inline="1">
    <Argument type="_2188" location="f29:86" file="f29" line="86"/>
  </OperatorMethod>
  <Constructor id="_1703" name="itimerval" artificial="1" throw="" context="_687" access="public" mangled="_ZN9itimervalC1ERKS_ *INTERNAL* " demangled="itimerval::itimerval(itimerval const&amp;)" location="f29:86" file="f29" line="86" endline="86" inline="1">
    <Argument type="_2188" location="f29:86" file="f29" line="86"/>
  </Constructor>
  <Constructor id="_1704" name="itimerval" artificial="1" throw="" context="_687" access="public" mangled="_ZN9itimervalC1Ev *INTERNAL* " demangled="itimerval::itimerval()" location="f29:86" file="f29" line="86" inline="1"/>
  <Field id="_1705" name="m_SetPointTemperature" type="_455" offset="0" context="_689" access="public" location="f2:551" file="f2" line="551"/>
  <Field id="_1706" name="m_MeasuredTemperature" type="_455" offset="16" context="_689" access="public" location="f2:553" file="f2" line="553"/>
  <Field id="_1707" name="m_ProportionalError" type="_684" offset="32" context="_689" access="public" location="f2:555" file="f2" line="555"/>
  <Field id="_1708" name="m_IntegralError" type="_684" offset="64" context="_689" access="public" location="f2:556" file="f2" line="556"/>
  <Field id="_1709" name="m_DerivativeError" type="_684" offset="96" context="_689" access="public" location="f2:557" file="f2" line="557"/>
  <Field id="_1710" name="m_ScanMode" type="_131" offset="128" context="_689" access="public" location="f2:558" file="f2" line="558"/>
  <Field id="_1711" name="m_HeatMode" type="_131" offset="144" context="_689" access="public" location="f2:559" file="f2" line="559"/>
  <Field id="_1712" name="m_TecDutyCycle" type="_131" offset="160" context="_689" access="public" location="f2:560" file="f2" line="560"/>
  <Field id="_1713" name="m_TemperatureRange" type="_131" offset="176" context="_689" access="public" location="f2:561" file="f2" line="561"/>
  <Destructor id="_1714" name="XnTecFastConvergenceData" artificial="1" throw="" context="_689" access="public" mangled="_ZN24XnTecFastConvergenceDataD1Ev *INTERNAL* " demangled="XnTecFastConvergenceData::~XnTecFastConvergenceData()" location="f2:550" file="f2" line="550" endline="550" inline="1">
  </Destructor>
  <OperatorMethod id="_1715" name="=" returns="_2189" artificial="1" throw="" context="_689" access="public" mangled="_ZN24XnTecFastConvergenceDataaSERKS_" demangled="XnTecFastConvergenceData::operator=(XnTecFastConvergenceData const&amp;)" location="f2:550" file="f2" line="550" endline="550" inline="1">
    <Argument type="_2190" location="f2:550" file="f2" line="550"/>
  </OperatorMethod>
  <Constructor id="_1716" name="XnTecFastConvergenceData" artificial="1" throw="" context="_689" access="public" mangled="_ZN24XnTecFastConvergenceDataC1ERKS_ *INTERNAL* " demangled="XnTecFastConvergenceData::XnTecFastConvergenceData(XnTecFastConvergenceData const&amp;)" location="f2:550" file="f2" line="550" endline="550" inline="1">
    <Argument type="_2190" location="f2:550" file="f2" line="550"/>
  </Constructor>
  <Constructor id="_1717" name="XnTecFastConvergenceData" artificial="1" throw="" context="_689" access="public" mangled="_ZN24XnTecFastConvergenceDataC1Ev *INTERNAL* " demangled="XnTecFastConvergenceData::XnTecFastConvergenceData()" location="f2:550" file="f2" line="550" inline="1"/>
  <Field id="_1718" name="nMinThreshold" type="_131" offset="0" context="_699" access="public" location="f2:619" file="f2" line="619"/>
  <Field id="_1719" name="nMaxThreshold" type="_131" offset="16" context="_699" access="public" location="f2:620" file="f2" line="620"/>
  <Field id="_1720" name="bProjectorFaultEvent" type="_684" offset="32" context="_699" access="public" location="f2:621" file="f2" line="621"/>
  <Destructor id="_1721" name="XnProjectorFaultData" artificial="1" throw="" context="_699" access="public" mangled="_ZN20XnProjectorFaultDataD1Ev *INTERNAL* " demangled="XnProjectorFaultData::~XnProjectorFaultData()" location="f2:618" file="f2" line="618" endline="618" inline="1">
  </Destructor>
  <OperatorMethod id="_1722" name="=" returns="_2191" artificial="1" throw="" context="_699" access="public" mangled="_ZN20XnProjectorFaultDataaSERKS_" demangled="XnProjectorFaultData::operator=(XnProjectorFaultData const&amp;)" location="f2:618" file="f2" line="618" endline="618" inline="1">
    <Argument type="_2192" location="f2:618" file="f2" line="618"/>
  </OperatorMethod>
  <Constructor id="_1723" name="XnProjectorFaultData" artificial="1" throw="" context="_699" access="public" mangled="_ZN20XnProjectorFaultDataC1ERKS_ *INTERNAL* " demangled="XnProjectorFaultData::XnProjectorFaultData(XnProjectorFaultData const&amp;)" location="f2:618" file="f2" line="618" endline="618" inline="1">
    <Argument type="_2192" location="f2:618" file="f2" line="618"/>
  </Constructor>
  <Constructor id="_1724" name="XnProjectorFaultData" artificial="1" throw="" context="_699" access="public" mangled="_ZN20XnProjectorFaultDataC1Ev *INTERNAL* " demangled="XnProjectorFaultData::XnProjectorFaultData()" location="f2:618" file="f2" line="618" inline="1"/>
  <Field id="_1725" name="nLedID" type="_131" offset="0" context="_716" access="public" location="f2:501" file="f2" line="501"/>
  <Field id="_1726" name="nState" type="_131" offset="16" context="_716" access="public" location="f2:502" file="f2" line="502"/>
  <Destructor id="_1727" name="XnLedState" artificial="1" throw="" context="_716" access="public" mangled="_ZN10XnLedStateD1Ev *INTERNAL* " demangled="XnLedState::~XnLedState()" location="f2:500" file="f2" line="500" endline="500" inline="1">
  </Destructor>
  <OperatorMethod id="_1728" name="=" returns="_2193" artificial="1" throw="" context="_716" access="public" mangled="_ZN10XnLedStateaSERKS_" demangled="XnLedState::operator=(XnLedState const&amp;)" location="f2:500" file="f2" line="500" endline="500" inline="1">
    <Argument type="_2194" location="f2:500" file="f2" line="500"/>
  </OperatorMethod>
  <Constructor id="_1729" name="XnLedState" artificial="1" throw="" context="_716" access="public" mangled="_ZN10XnLedStateC1ERKS_ *INTERNAL* " demangled="XnLedState::XnLedState(XnLedState const&amp;)" location="f2:500" file="f2" line="500" endline="500" inline="1">
    <Argument type="_2194" location="f2:500" file="f2" line="500"/>
  </Constructor>
  <Constructor id="_1730" name="XnLedState" artificial="1" throw="" context="_716" access="public" mangled="_ZN10XnLedStateC1Ev *INTERNAL* " demangled="XnLedState::XnLedState()" location="f2:500" file="f2" line="500" inline="1"/>
  <PointerType id="_1731" type="_477" size="32" align="32"/>
  <CvQualifiedType id="_18c" type="_18" const="1"/>
  <Field id="_1733" name="ri_uuid" type="_2156" offset="0" context="_726" access="public" location="f31:195" file="f31" line="195"/>
  <Field id="_1734" name="ri_user_time" type="_900" offset="128" context="_726" access="public" location="f31:196" file="f31" line="196"/>
  <Field id="_1735" name="ri_system_time" type="_900" offset="192" context="_726" access="public" location="f31:197" file="f31" line="197"/>
  <Field id="_1736" name="ri_pkg_idle_wkups" type="_900" offset="256" context="_726" access="public" location="f31:198" file="f31" line="198"/>
  <Field id="_1737" name="ri_interrupt_wkups" type="_900" offset="320" context="_726" access="public" location="f31:199" file="f31" line="199"/>
  <Field id="_1738" name="ri_pageins" type="_900" offset="384" context="_726" access="public" location="f31:200" file="f31" line="200"/>
  <Field id="_1739" name="ri_wired_size" type="_900" offset="448" context="_726" access="public" location="f31:201" file="f31" line="201"/>
  <Field id="_1740" name="ri_resident_size" type="_900" offset="512" context="_726" access="public" location="f31:202" file="f31" line="202"/>
  <Field id="_1741" name="ri_phys_footprint" type="_900" offset="576" context="_726" access="public" location="f31:203" file="f31" line="203"/>
  <Field id="_1742" name="ri_proc_start_abstime" type="_900" offset="640" context="_726" access="public" location="f31:204" file="f31" line="204"/>
  <Field id="_1743" name="ri_proc_exit_abstime" type="_900" offset="704" context="_726" access="public" location="f31:205" file="f31" line="205"/>
  <Destructor id="_1744" name="rusage_info_v0" artificial="1" throw="" context="_726" access="public" mangled="_ZN14rusage_info_v0D1Ev *INTERNAL* " demangled="rusage_info_v0::~rusage_info_v0()" location="f31:194" file="f31" line="194" endline="194" inline="1">
  </Destructor>
  <OperatorMethod id="_1745" name="=" returns="_2195" artificial="1" throw="" context="_726" access="public" mangled="_ZN14rusage_info_v0aSERKS_" demangled="rusage_info_v0::operator=(rusage_info_v0 const&amp;)" location="f31:194" file="f31" line="194" endline="194" inline="1">
    <Argument type="_2196" location="f31:194" file="f31" line="194"/>
  </OperatorMethod>
  <Constructor id="_1746" name="rusage_info_v0" artificial="1" throw="" context="_726" access="public" mangled="_ZN14rusage_info_v0C1ERKS_ *INTERNAL* " demangled="rusage_info_v0::rusage_info_v0(rusage_info_v0 const&amp;)" location="f31:194" file="f31" line="194" endline="194" inline="1">
    <Argument type="_2196" location="f31:194" file="f31" line="194"/>
  </Constructor>
  <Constructor id="_1747" name="rusage_info_v0" artificial="1" throw="" context="_726" access="public" mangled="_ZN14rusage_info_v0C1Ev *INTERNAL* " demangled="rusage_info_v0::rusage_info_v0()" location="f31:194" file="f31" line="194" inline="1"/>
  <Field id="_1748" name="__trapno" type="_192" offset="0" context="_736" access="public" location="f13:753" file="f13" line="753"/>
  <Field id="_1749" name="__cpu" type="_192" offset="16" context="_736" access="public" location="f13:754" file="f13" line="754"/>
  <Field id="_1750" name="__err" type="_445" offset="32" context="_736" access="public" location="f13:755" file="f13" line="755"/>
  <Field id="_1751" name="__faultvaddr" type="_99" offset="64" context="_736" access="public" location="f13:756" file="f13" line="756"/>
  <Destructor id="_1752" name="__darwin_x86_exception_state64" artificial="1" throw="" context="_736" access="public" mangled="_ZN30__darwin_x86_exception_state64D1Ev *INTERNAL* " demangled="__darwin_x86_exception_state64::~__darwin_x86_exception_state64()" location="f13:752" file="f13" line="752" endline="752" inline="1">
  </Destructor>
  <OperatorMethod id="_1753" name="=" returns="_2197" artificial="1" throw="" context="_736" access="public" mangled="_ZN30__darwin_x86_exception_state64aSERKS_" demangled="__darwin_x86_exception_state64::operator=(__darwin_x86_exception_state64 const&amp;)" location="f13:752" file="f13" line="752" endline="752" inline="1">
    <Argument type="_2198" location="f13:752" file="f13" line="752"/>
  </OperatorMethod>
  <Constructor id="_1754" name="__darwin_x86_exception_state64" artificial="1" throw="" context="_736" access="public" mangled="_ZN30__darwin_x86_exception_state64C1ERKS_ *INTERNAL* " demangled="__darwin_x86_exception_state64::__darwin_x86_exception_state64(__darwin_x86_exception_state64 const&amp;)" location="f13:752" file="f13" line="752" endline="752" inline="1">
    <Argument type="_2198" location="f13:752" file="f13" line="752"/>
  </Constructor>
  <Constructor id="_1755" name="__darwin_x86_exception_state64" artificial="1" throw="" context="_736" access="public" mangled="_ZN30__darwin_x86_exception_state64C1Ev *INTERNAL* " demangled="__darwin_x86_exception_state64::__darwin_x86_exception_state64()" location="f13:752" file="f13" line="752" inline="1"/>
  <PointerType id="_1756" type="_878c" size="32" align="32"/>
  <Field id="_1757" name="quot" type="_104" offset="0" context="_774" access="public" location="f11:88" file="f11" line="88"/>
  <Field id="_1758" name="rem" type="_104" offset="32" context="_774" access="public" location="f11:89" file="f11" line="89"/>
  <Destructor id="_1759" name="$_5" artificial="1" throw="" context="_774" access="public" mangled="_ZN6ldiv_tD1Ev *INTERNAL* " demangled="ldiv_t::~ldiv_t()" location="f11:90" file="f11" line="90" endline="90" inline="1">
  </Destructor>
  <OperatorMethod id="_1760" name="=" returns="_2200" artificial="1" throw="" context="_774" access="public" mangled="_ZN6ldiv_taSERKS_" demangled="ldiv_t::operator=(ldiv_t const&amp;)" location="f11:90" file="f11" line="90" endline="90" inline="1">
    <Argument type="_2201" location="f11:87" file="f11" line="87"/>
  </OperatorMethod>
  <Constructor id="_1761" name="$_5" artificial="1" throw="" context="_774" access="public" mangled="_ZN6ldiv_tC1ERKS_ *INTERNAL* " demangled="ldiv_t::ldiv_t(ldiv_t const&amp;)" location="f11:90" file="f11" line="90" endline="90" inline="1">
    <Argument type="_2201" location="f11:87" file="f11" line="87"/>
  </Constructor>
  <Constructor id="_1762" name="$_5" artificial="1" throw="" context="_774" access="public" mangled="_ZN6ldiv_tC1Ev *INTERNAL* " demangled="ldiv_t::ldiv_t()" location="f11:90" file="f11" line="90" inline="1"/>
  <Field id="_1763" name="nTestsMask" type="_371" offset="0" context="_775" access="public" location="f2:626" file="f2" line="626"/>
  <Field id="_1764" name="nFailures" type="_371" offset="32" context="_775" access="public" location="f2:627" file="f2" line="627"/>
  <Destructor id="_1765" name="XnBist" artificial="1" throw="" context="_775" access="public" mangled="_ZN6XnBistD1Ev *INTERNAL* " demangled="XnBist::~XnBist()" location="f2:625" file="f2" line="625" endline="625" inline="1">
  </Destructor>
  <OperatorMethod id="_1766" name="=" returns="_2202" artificial="1" throw="" context="_775" access="public" mangled="_ZN6XnBistaSERKS_" demangled="XnBist::operator=(XnBist const&amp;)" location="f2:625" file="f2" line="625" endline="625" inline="1">
    <Argument type="_2203" location="f2:625" file="f2" line="625"/>
  </OperatorMethod>
  <Constructor id="_1767" name="XnBist" artificial="1" throw="" context="_775" access="public" mangled="_ZN6XnBistC1ERKS_ *INTERNAL* " demangled="XnBist::XnBist(XnBist const&amp;)" location="f2:625" file="f2" line="625" endline="625" inline="1">
    <Argument type="_2203" location="f2:625" file="f2" line="625"/>
  </Constructor>
  <Constructor id="_1768" name="XnBist" artificial="1" throw="" context="_775" access="public" mangled="_ZN6XnBistC1Ev *INTERNAL* " demangled="XnBist::XnBist()" location="f2:625" file="f2" line="625" inline="1"/>
  <PointerType id="_1769" type="_2204" size="32" align="32"/>
  <PointerType id="_1770" type="_105" size="32" align="32"/>
  <Field id="_1771" name="__xmm_reg" type="_2170" offset="0" context="_805" access="public" location="f13:212" file="f13" line="212"/>
  <Destructor id="_1772" name="__darwin_xmm_reg" artificial="1" throw="" context="_805" access="public" mangled="_ZN16__darwin_xmm_regD1Ev *INTERNAL* " demangled="__darwin_xmm_reg::~__darwin_xmm_reg()" location="f13:211" file="f13" line="211" endline="211" inline="1">
  </Destructor>
  <OperatorMethod id="_1773" name="=" returns="_2205" artificial="1" throw="" context="_805" access="public" mangled="_ZN16__darwin_xmm_regaSERKS_" demangled="__darwin_xmm_reg::operator=(__darwin_xmm_reg const&amp;)" location="f13:211" file="f13" line="211" endline="211" inline="1">
    <Argument type="_2206" location="f13:211" file="f13" line="211"/>
  </OperatorMethod>
  <Constructor id="_1774" name="__darwin_xmm_reg" artificial="1" throw="" context="_805" access="public" mangled="_ZN16__darwin_xmm_regC1ERKS_ *INTERNAL* " demangled="__darwin_xmm_reg::__darwin_xmm_reg(__darwin_xmm_reg const&amp;)" location="f13:211" file="f13" line="211" endline="211" inline="1">
    <Argument type="_2206" location="f13:211" file="f13" line="211"/>
  </Constructor>
  <Constructor id="_1775" name="__darwin_xmm_reg" artificial="1" throw="" context="_805" access="public" mangled="_ZN16__darwin_xmm_regC1Ev *INTERNAL* " demangled="__darwin_xmm_reg::__darwin_xmm_reg()" location="f13:211" file="f13" line="211" inline="1"/>
  <Field id="_1776" name="nBus" type="_131" offset="0" context="_807" access="public" location="f2:529" file="f2" line="529"/>
  <Field id="_1777" name="nSlaveAddress" type="_131" offset="16" context="_807" access="public" location="f2:530" file="f2" line="530"/>
  <Field id="_1778" name="cpReadBuffer" type="_2207" offset="32" context="_807" access="public" location="f2:531" file="f2" line="531"/>
  <Field id="_1779" name="cpWriteBuffer" type="_2207" offset="192" context="_807" access="public" location="f2:532" file="f2" line="532"/>
  <Field id="_1780" name="nReadSize" type="_131" offset="352" context="_807" access="public" location="f2:533" file="f2" line="533"/>
  <Field id="_1781" name="nWriteSize" type="_131" offset="368" context="_807" access="public" location="f2:534" file="f2" line="534"/>
  <Destructor id="_1782" name="XnI2CReadData" artificial="1" throw="" context="_807" access="public" mangled="_ZN13XnI2CReadDataD1Ev *INTERNAL* " demangled="XnI2CReadData::~XnI2CReadData()" location="f2:528" file="f2" line="528" endline="528" inline="1">
  </Destructor>
  <OperatorMethod id="_1783" name="=" returns="_2208" artificial="1" throw="" context="_807" access="public" mangled="_ZN13XnI2CReadDataaSERKS_" demangled="XnI2CReadData::operator=(XnI2CReadData const&amp;)" location="f2:528" file="f2" line="528" endline="528" inline="1">
    <Argument type="_2209" location="f2:528" file="f2" line="528"/>
  </OperatorMethod>
  <Constructor id="_1784" name="XnI2CReadData" artificial="1" throw="" context="_807" access="public" mangled="_ZN13XnI2CReadDataC1ERKS_ *INTERNAL* " demangled="XnI2CReadData::XnI2CReadData(XnI2CReadData const&amp;)" location="f2:528" file="f2" line="528" endline="528" inline="1">
    <Argument type="_2209" location="f2:528" file="f2" line="528"/>
  </Constructor>
  <Constructor id="_1785" name="XnI2CReadData" artificial="1" throw="" context="_807" access="public" mangled="_ZN13XnI2CReadDataC1Ev *INTERNAL* " demangled="XnI2CReadData::XnI2CReadData()" location="f2:528" file="f2" line="528" inline="1"/>
  <Field id="_1786" name="hz" type="_18" offset="0" context="_812" access="public" location="f29:168" file="f29" line="168"/>
  <Field id="_1787" name="tick" type="_18" offset="32" context="_812" access="public" location="f29:169" file="f29" line="169"/>
  <Field id="_1788" name="tickadj" type="_18" offset="64" context="_812" access="public" location="f29:170" file="f29" line="170"/>
  <Field id="_1789" name="stathz" type="_18" offset="96" context="_812" access="public" location="f29:171" file="f29" line="171"/>
  <Field id="_1790" name="profhz" type="_18" offset="128" context="_812" access="public" location="f29:172" file="f29" line="172"/>
  <Destructor id="_1791" name="clockinfo" artificial="1" throw="" context="_812" access="public" mangled="_ZN9clockinfoD1Ev *INTERNAL* " demangled="clockinfo::~clockinfo()" location="f29:167" file="f29" line="167" endline="167" inline="1">
  </Destructor>
  <OperatorMethod id="_1792" name="=" returns="_2210" artificial="1" throw="" context="_812" access="public" mangled="_ZN9clockinfoaSERKS_" demangled="clockinfo::operator=(clockinfo const&amp;)" location="f29:167" file="f29" line="167" endline="167" inline="1">
    <Argument type="_2211" location="f29:167" file="f29" line="167"/>
  </OperatorMethod>
  <Constructor id="_1793" name="clockinfo" artificial="1" throw="" context="_812" access="public" mangled="_ZN9clockinfoC1ERKS_ *INTERNAL* " demangled="clockinfo::clockinfo(clockinfo const&amp;)" location="f29:167" file="f29" line="167" endline="167" inline="1">
    <Argument type="_2211" location="f29:167" file="f29" line="167"/>
  </Constructor>
  <Constructor id="_1794" name="clockinfo" artificial="1" throw="" context="_812" access="public" mangled="_ZN9clockinfoC1Ev *INTERNAL* " demangled="clockinfo::clockinfo()" location="f29:167" file="f29" line="167" inline="1"/>
  <Field id="_1795" name="sigev_notify" type="_18" offset="0" context="_827" access="public" location="f24:168" file="f24" line="168"/>
  <Field id="_1796" name="sigev_signo" type="_18" offset="32" context="_827" access="public" location="f24:169" file="f24" line="169"/>
  <Field id="_1797" name="sigev_value" type="_488" offset="64" context="_827" access="public" location="f24:170" file="f24" line="170"/>
  <Field id="_1798" name="sigev_notify_function" type="_2212" offset="96" context="_827" access="public" location="f24:171" file="f24" line="171"/>
  <Field id="_1799" name="sigev_notify_attributes" type="_2213" offset="128" context="_827" access="public" location="f24:172" file="f24" line="172"/>
  <Destructor id="_1800" name="sigevent" artificial="1" throw="" context="_827" access="public" mangled="_ZN8sigeventD1Ev *INTERNAL* " demangled="sigevent::~sigevent()" location="f24:167" file="f24" line="167" endline="167" inline="1">
  </Destructor>
  <OperatorMethod id="_1801" name="=" returns="_2214" artificial="1" throw="" context="_827" access="public" mangled="_ZN8sigeventaSERKS_" demangled="sigevent::operator=(sigevent const&amp;)" location="f24:167" file="f24" line="167" endline="167" inline="1">
    <Argument type="_2215" location="f24:167" file="f24" line="167"/>
  </OperatorMethod>
  <Constructor id="_1802" name="sigevent" artificial="1" throw="" context="_827" access="public" mangled="_ZN8sigeventC1ERKS_ *INTERNAL* " demangled="sigevent::sigevent(sigevent const&amp;)" location="f24:167" file="f24" line="167" endline="167" inline="1">
    <Argument type="_2215" location="f24:167" file="f24" line="167"/>
  </Constructor>
  <Constructor id="_1803" name="sigevent" artificial="1" throw="" context="_827" access="public" mangled="_ZN8sigeventC1Ev *INTERNAL* " demangled="sigevent::sigevent()" location="f24:167" file="f24" line="167" inline="1"/>
  <Field id="_1804" name="__sig" type="_104" offset="0" context="_831" access="public" location="f6:104" file="f6" line="104"/>
  <Field id="_1805" name="__cleanup_stack" type="_1991" offset="32" context="_831" access="public" location="f6:105" file="f6" line="105"/>
  <Field id="_1806" name="__opaque" type="_2216" offset="64" context="_831" access="public" location="f6:106" file="f6" line="106"/>
  <Destructor id="_1807" name="_opaque_pthread_t" artificial="1" throw="" context="_831" access="public" mangled="_ZN17_opaque_pthread_tD1Ev *INTERNAL* " demangled="_opaque_pthread_t::~_opaque_pthread_t()" location="f6:103" file="f6" line="103" endline="103" inline="1">
  </Destructor>
  <OperatorMethod id="_1808" name="=" returns="_2217" artificial="1" throw="" context="_831" access="public" mangled="_ZN17_opaque_pthread_taSERKS_" demangled="_opaque_pthread_t::operator=(_opaque_pthread_t const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_2218" location="f6:103" file="f6" line="103"/>
  </OperatorMethod>
  <Constructor id="_1809" name="_opaque_pthread_t" artificial="1" throw="" context="_831" access="public" mangled="_ZN17_opaque_pthread_tC1ERKS_ *INTERNAL* " demangled="_opaque_pthread_t::_opaque_pthread_t(_opaque_pthread_t const&amp;)" location="f6:103" file="f6" line="103" endline="103" inline="1">
    <Argument type="_2218" location="f6:103" file="f6" line="103"/>
  </Constructor>
  <Constructor id="_1810" name="_opaque_pthread_t" artificial="1" throw="" context="_831" access="public" mangled="_ZN17_opaque_pthread_tC1Ev *INTERNAL* " demangled="_opaque_pthread_t::_opaque_pthread_t()" location="f6:103" file="f6" line="103" inline="1"/>
  <Field id="_1811" name="__sigaction_u" type="_892" offset="0" context="_843" access="public" location="f24:276" file="f24" line="276"/>
  <Field id="_1812" name="sa_tramp" type="_2219" offset="32" context="_843" access="public" location="f24:277" file="f24" line="277"/>
  <Field id="_1813" name="sa_mask" type="_79" offset="64" context="_843" access="public" location="f24:278" file="f24" line="278"/>
  <Field id="_1814" name="sa_flags" type="_18" offset="96" context="_843" access="public" location="f24:279" file="f24" line="279"/>
  <Destructor id="_1815" name="__sigaction" artificial="1" throw="" context="_843" access="public" mangled="_ZN11__sigactionD1Ev *INTERNAL* " demangled="__sigaction::~__sigaction()" location="f24:275" file="f24" line="275" endline="275" inline="1">
  </Destructor>
  <OperatorMethod id="_1816" name="=" returns="_2220" artificial="1" throw="" context="_843" access="public" mangled="_ZN11__sigactionaSERKS_" demangled="__sigaction::operator=(__sigaction const&amp;)" location="f24:275" file="f24" line="275" endline="275" inline="1">
    <Argument type="_2221" location="f24:275" file="f24" line="275"/>
  </OperatorMethod>
  <Constructor id="_1817" name="__sigaction" artificial="1" throw="" context="_843" access="public" mangled="_ZN11__sigactionC1ERKS_ *INTERNAL* " demangled="__sigaction::__sigaction(__sigaction const&amp;)" location="f24:275" file="f24" line="275" endline="275" inline="1">
    <Argument type="_2221" location="f24:275" file="f24" line="275"/>
  </Constructor>
  <Constructor id="_1818" name="__sigaction" artificial="1" throw="" context="_843" access="public" mangled="_ZN11__sigactionC1Ev *INTERNAL* " demangled="__sigaction::__sigaction()" location="f24:275" file="f24" line="275" inline="1"/>
  <Field id="_1819" name="__fpu_reserved" type="_2128" offset="0" context="_856" access="public" location="f13:234" file="f13" line="234"/>
  <Field id="_1820" name="__fpu_fcw" type="_220" offset="64" context="_856" access="public" location="f13:235" file="f13" line="235"/>
  <Field id="_1821" name="__fpu_fsw" type="_390" offset="80" context="_856" access="public" location="f13:236" file="f13" line="236"/>
  <Field id="_1822" name="__fpu_ftw" type="_634" offset="96" context="_856" access="public" location="f13:237" file="f13" line="237"/>
  <Field id="_1823" name="__fpu_rsrv1" type="_634" offset="104" context="_856" access="public" location="f13:238" file="f13" line="238"/>
  <Field id="_1824" name="__fpu_fop" type="_192" offset="112" context="_856" access="public" location="f13:239" file="f13" line="239"/>
  <Field id="_1825" name="__fpu_ip" type="_445" offset="128" context="_856" access="public" location="f13:240" file="f13" line="240"/>
  <Field id="_1826" name="__fpu_cs" type="_192" offset="160" context="_856" access="public" location="f13:241" file="f13" line="241"/>
  <Field id="_1827" name="__fpu_rsrv2" type="_192" offset="176" context="_856" access="public" location="f13:242" file="f13" line="242"/>
  <Field id="_1828" name="__fpu_dp" type="_445" offset="192" context="_856" access="public" location="f13:243" file="f13" line="243"/>
  <Field id="_1829" name="__fpu_ds" type="_192" offset="224" context="_856" access="public" location="f13:244" file="f13" line="244"/>
  <Field id="_1830" name="__fpu_rsrv3" type="_192" offset="240" context="_856" access="public" location="f13:245" file="f13" line="245"/>
  <Field id="_1831" name="__fpu_mxcsr" type="_445" offset="256" context="_856" access="public" location="f13:246" file="f13" line="246"/>
  <Field id="_1832" name="__fpu_mxcsrmask" type="_445" offset="288" context="_856" access="public" location="f13:247" file="f13" line="247"/>
  <Field id="_1833" name="__fpu_stmm0" type="_585" offset="320" context="_856" access="public" location="f13:248" file="f13" line="248"/>
  <Field id="_1834" name="__fpu_stmm1" type="_585" offset="448" context="_856" access="public" location="f13:249" file="f13" line="249"/>
  <Field id="_1835" name="__fpu_stmm2" type="_585" offset="576" context="_856" access="public" location="f13:250" file="f13" line="250"/>
  <Field id="_1836" name="__fpu_stmm3" type="_585" offset="704" context="_856" access="public" location="f13:251" file="f13" line="251"/>
  <Field id="_1837" name="__fpu_stmm4" type="_585" offset="832" context="_856" access="public" location="f13:252" file="f13" line="252"/>
  <Field id="_1838" name="__fpu_stmm5" type="_585" offset="960" context="_856" access="public" location="f13:253" file="f13" line="253"/>
  <Field id="_1839" name="__fpu_stmm6" type="_585" offset="1088" context="_856" access="public" location="f13:254" file="f13" line="254"/>
  <Field id="_1840" name="__fpu_stmm7" type="_585" offset="1216" context="_856" access="public" location="f13:255" file="f13" line="255"/>
  <Field id="_1841" name="__fpu_xmm0" type="_805" offset="1344" context="_856" access="public" location="f13:256" file="f13" line="256"/>
  <Field id="_1842" name="__fpu_xmm1" type="_805" offset="1472" context="_856" access="public" location="f13:257" file="f13" line="257"/>
  <Field id="_1843" name="__fpu_xmm2" type="_805" offset="1600" context="_856" access="public" location="f13:258" file="f13" line="258"/>
  <Field id="_1844" name="__fpu_xmm3" type="_805" offset="1728" context="_856" access="public" location="f13:259" file="f13" line="259"/>
  <Field id="_1845" name="__fpu_xmm4" type="_805" offset="1856" context="_856" access="public" location="f13:260" file="f13" line="260"/>
  <Field id="_1846" name="__fpu_xmm5" type="_805" offset="1984" context="_856" access="public" location="f13:261" file="f13" line="261"/>
  <Field id="_1847" name="__fpu_xmm6" type="_805" offset="2112" context="_856" access="public" location="f13:262" file="f13" line="262"/>
  <Field id="_1848" name="__fpu_xmm7" type="_805" offset="2240" context="_856" access="public" location="f13:263" file="f13" line="263"/>
  <Field id="_1849" name="__fpu_rsrv4" type="_2222" offset="2368" context="_856" access="public" location="f13:264" file="f13" line="264"/>
  <Field id="_1850" name="__fpu_reserved1" type="_18" offset="4160" context="_856" access="public" location="f13:265" file="f13" line="265"/>
  <Destructor id="_1851" name="__darwin_i386_float_state" artificial="1" throw="" context="_856" access="public" mangled="_ZN25__darwin_i386_float_stateD1Ev *INTERNAL* " demangled="__darwin_i386_float_state::~__darwin_i386_float_state()" location="f13:233" file="f13" line="233" endline="233" inline="1">
  </Destructor>
  <OperatorMethod id="_1852" name="=" returns="_2223" artificial="1" throw="" context="_856" access="public" mangled="_ZN25__darwin_i386_float_stateaSERKS_" demangled="__darwin_i386_float_state::operator=(__darwin_i386_float_state const&amp;)" location="f13:233" file="f13" line="233" endline="233" inline="1">
    <Argument type="_2224" location="f13:233" file="f13" line="233"/>
  </OperatorMethod>
  <Constructor id="_1853" name="__darwin_i386_float_state" artificial="1" throw="" context="_856" access="public" mangled="_ZN25__darwin_i386_float_stateC1ERKS_ *INTERNAL* " demangled="__darwin_i386_float_state::__darwin_i386_float_state(__darwin_i386_float_state const&amp;)" location="f13:233" file="f13" line="233" endline="233" inline="1">
    <Argument type="_2224" location="f13:233" file="f13" line="233"/>
  </Constructor>
  <Constructor id="_1854" name="__darwin_i386_float_state" artificial="1" throw="" context="_856" access="public" mangled="_ZN25__darwin_i386_float_stateC1Ev *INTERNAL* " demangled="__darwin_i386_float_state::__darwin_i386_float_state()" location="f13:233" file="f13" line="233" inline="1"/>
  <Field id="_1855" name="nBus" type="_131" offset="0" context="_868" access="public" location="f2:521" file="f2" line="521"/>
  <Field id="_1856" name="nSlaveAddress" type="_131" offset="16" context="_868" access="public" location="f2:522" file="f2" line="522"/>
  <Field id="_1857" name="cpWriteBuffer" type="_2207" offset="32" context="_868" access="public" location="f2:523" file="f2" line="523"/>
  <Field id="_1858" name="nWriteSize" type="_131" offset="192" context="_868" access="public" location="f2:524" file="f2" line="524"/>
  <Destructor id="_1859" name="XnI2CWriteData" artificial="1" throw="" context="_868" access="public" mangled="_ZN14XnI2CWriteDataD1Ev *INTERNAL* " demangled="XnI2CWriteData::~XnI2CWriteData()" location="f2:520" file="f2" line="520" endline="520" inline="1">
  </Destructor>
  <OperatorMethod id="_1860" name="=" returns="_2225" artificial="1" throw="" context="_868" access="public" mangled="_ZN14XnI2CWriteDataaSERKS_" demangled="XnI2CWriteData::operator=(XnI2CWriteData const&amp;)" location="f2:520" file="f2" line="520" endline="520" inline="1">
    <Argument type="_2226" location="f2:520" file="f2" line="520"/>
  </OperatorMethod>
  <Constructor id="_1861" name="XnI2CWriteData" artificial="1" throw="" context="_868" access="public" mangled="_ZN14XnI2CWriteDataC1ERKS_ *INTERNAL* " demangled="XnI2CWriteData::XnI2CWriteData(XnI2CWriteData const&amp;)" location="f2:520" file="f2" line="520" endline="520" inline="1">
    <Argument type="_2226" location="f2:520" file="f2" line="520"/>
  </Constructor>
  <Constructor id="_1862" name="XnI2CWriteData" artificial="1" throw="" context="_868" access="public" mangled="_ZN14XnI2CWriteDataC1Ev *INTERNAL* " demangled="XnI2CWriteData::XnI2CWriteData()" location="f2:520" file="f2" line="520" inline="1"/>
  <Field id="_1863" name="__fpu_reserved" type="_2128" offset="0" context="_870" access="public" location="f13:562" file="f13" line="562"/>
  <Field id="_1864" name="__fpu_fcw" type="_220" offset="64" context="_870" access="public" location="f13:563" file="f13" line="563"/>
  <Field id="_1865" name="__fpu_fsw" type="_390" offset="80" context="_870" access="public" location="f13:564" file="f13" line="564"/>
  <Field id="_1866" name="__fpu_ftw" type="_634" offset="96" context="_870" access="public" location="f13:565" file="f13" line="565"/>
  <Field id="_1867" name="__fpu_rsrv1" type="_634" offset="104" context="_870" access="public" location="f13:566" file="f13" line="566"/>
  <Field id="_1868" name="__fpu_fop" type="_192" offset="112" context="_870" access="public" location="f13:567" file="f13" line="567"/>
  <Field id="_1869" name="__fpu_ip" type="_445" offset="128" context="_870" access="public" location="f13:570" file="f13" line="570"/>
  <Field id="_1870" name="__fpu_cs" type="_192" offset="160" context="_870" access="public" location="f13:571" file="f13" line="571"/>
  <Field id="_1871" name="__fpu_rsrv2" type="_192" offset="176" context="_870" access="public" location="f13:573" file="f13" line="573"/>
  <Field id="_1872" name="__fpu_dp" type="_445" offset="192" context="_870" access="public" location="f13:576" file="f13" line="576"/>
  <Field id="_1873" name="__fpu_ds" type="_192" offset="224" context="_870" access="public" location="f13:577" file="f13" line="577"/>
  <Field id="_1874" name="__fpu_rsrv3" type="_192" offset="240" context="_870" access="public" location="f13:579" file="f13" line="579"/>
  <Field id="_1875" name="__fpu_mxcsr" type="_445" offset="256" context="_870" access="public" location="f13:580" file="f13" line="580"/>
  <Field id="_1876" name="__fpu_mxcsrmask" type="_445" offset="288" context="_870" access="public" location="f13:581" file="f13" line="581"/>
  <Field id="_1877" name="__fpu_stmm0" type="_585" offset="320" context="_870" access="public" location="f13:582" file="f13" line="582"/>
  <Field id="_1878" name="__fpu_stmm1" type="_585" offset="448" context="_870" access="public" location="f13:583" file="f13" line="583"/>
  <Field id="_1879" name="__fpu_stmm2" type="_585" offset="576" context="_870" access="public" location="f13:584" file="f13" line="584"/>
  <Field id="_1880" name="__fpu_stmm3" type="_585" offset="704" context="_870" access="public" location="f13:585" file="f13" line="585"/>
  <Field id="_1881" name="__fpu_stmm4" type="_585" offset="832" context="_870" access="public" location="f13:586" file="f13" line="586"/>
  <Field id="_1882" name="__fpu_stmm5" type="_585" offset="960" context="_870" access="public" location="f13:587" file="f13" line="587"/>
  <Field id="_1883" name="__fpu_stmm6" type="_585" offset="1088" context="_870" access="public" location="f13:588" file="f13" line="588"/>
  <Field id="_1884" name="__fpu_stmm7" type="_585" offset="1216" context="_870" access="public" location="f13:589" file="f13" line="589"/>
  <Field id="_1885" name="__fpu_xmm0" type="_805" offset="1344" context="_870" access="public" location="f13:590" file="f13" line="590"/>
  <Field id="_1886" name="__fpu_xmm1" type="_805" offset="1472" context="_870" access="public" location="f13:591" file="f13" line="591"/>
  <Field id="_1887" name="__fpu_xmm2" type="_805" offset="1600" context="_870" access="public" location="f13:592" file="f13" line="592"/>
  <Field id="_1888" name="__fpu_xmm3" type="_805" offset="1728" context="_870" access="public" location="f13:593" file="f13" line="593"/>
  <Field id="_1889" name="__fpu_xmm4" type="_805" offset="1856" context="_870" access="public" location="f13:594" file="f13" line="594"/>
  <Field id="_1890" name="__fpu_xmm5" type="_805" offset="1984" context="_870" access="public" location="f13:595" file="f13" line="595"/>
  <Field id="_1891" name="__fpu_xmm6" type="_805" offset="2112" context="_870" access="public" location="f13:596" file="f13" line="596"/>
  <Field id="_1892" name="__fpu_xmm7" type="_805" offset="2240" context="_870" access="public" location="f13:597" file="f13" line="597"/>
  <Field id="_1893" name="__fpu_xmm8" type="_805" offset="2368" context="_870" access="public" location="f13:598" file="f13" line="598"/>
  <Field id="_1894" name="__fpu_xmm9" type="_805" offset="2496" context="_870" access="public" location="f13:599" file="f13" line="599"/>
  <Field id="_1895" name="__fpu_xmm10" type="_805" offset="2624" context="_870" access="public" location="f13:600" file="f13" line="600"/>
  <Field id="_1896" name="__fpu_xmm11" type="_805" offset="2752" context="_870" access="public" location="f13:601" file="f13" line="601"/>
  <Field id="_1897" name="__fpu_xmm12" type="_805" offset="2880" context="_870" access="public" location="f13:602" file="f13" line="602"/>
  <Field id="_1898" name="__fpu_xmm13" type="_805" offset="3008" context="_870" access="public" location="f13:603" file="f13" line="603"/>
  <Field id="_1899" name="__fpu_xmm14" type="_805" offset="3136" context="_870" access="public" location="f13:604" file="f13" line="604"/>
  <Field id="_1900" name="__fpu_xmm15" type="_805" offset="3264" context="_870" access="public" location="f13:605" file="f13" line="605"/>
  <Field id="_1901" name="__fpu_rsrv4" type="_2129" offset="3392" context="_870" access="public" location="f13:606" file="f13" line="606"/>
  <Field id="_1902" name="__fpu_reserved1" type="_18" offset="4160" context="_870" access="public" location="f13:607" file="f13" line="607"/>
  <Field id="_1903" name="__avx_reserved1" type="_2227" offset="4192" context="_870" access="public" location="f13:608" file="f13" line="608"/>
  <Field id="_1904" name="__fpu_ymmh0" type="_805" offset="4704" context="_870" access="public" location="f13:609" file="f13" line="609"/>
  <Field id="_1905" name="__fpu_ymmh1" type="_805" offset="4832" context="_870" access="public" location="f13:610" file="f13" line="610"/>
  <Field id="_1906" name="__fpu_ymmh2" type="_805" offset="4960" context="_870" access="public" location="f13:611" file="f13" line="611"/>
  <Field id="_1907" name="__fpu_ymmh3" type="_805" offset="5088" context="_870" access="public" location="f13:612" file="f13" line="612"/>
  <Field id="_1908" name="__fpu_ymmh4" type="_805" offset="5216" context="_870" access="public" location="f13:613" file="f13" line="613"/>
  <Field id="_1909" name="__fpu_ymmh5" type="_805" offset="5344" context="_870" access="public" location="f13:614" file="f13" line="614"/>
  <Field id="_1910" name="__fpu_ymmh6" type="_805" offset="5472" context="_870" access="public" location="f13:615" file="f13" line="615"/>
  <Field id="_1911" name="__fpu_ymmh7" type="_805" offset="5600" context="_870" access="public" location="f13:616" file="f13" line="616"/>
  <Field id="_1912" name="__fpu_ymmh8" type="_805" offset="5728" context="_870" access="public" location="f13:617" file="f13" line="617"/>
  <Field id="_1913" name="__fpu_ymmh9" type="_805" offset="5856" context="_870" access="public" location="f13:618" file="f13" line="618"/>
  <Field id="_1914" name="__fpu_ymmh10" type="_805" offset="5984" context="_870" access="public" location="f13:619" file="f13" line="619"/>
  <Field id="_1915" name="__fpu_ymmh11" type="_805" offset="6112" context="_870" access="public" location="f13:620" file="f13" line="620"/>
  <Field id="_1916" name="__fpu_ymmh12" type="_805" offset="6240" context="_870" access="public" location="f13:621" file="f13" line="621"/>
  <Field id="_1917" name="__fpu_ymmh13" type="_805" offset="6368" context="_870" access="public" location="f13:622" file="f13" line="622"/>
  <Field id="_1918" name="__fpu_ymmh14" type="_805" offset="6496" context="_870" access="public" location="f13:623" file="f13" line="623"/>
  <Field id="_1919" name="__fpu_ymmh15" type="_805" offset="6624" context="_870" access="public" location="f13:624" file="f13" line="624"/>
  <Destructor id="_1920" name="__darwin_x86_avx_state64" artificial="1" throw="" context="_870" access="public" mangled="_ZN24__darwin_x86_avx_state64D1Ev *INTERNAL* " demangled="__darwin_x86_avx_state64::~__darwin_x86_avx_state64()" location="f13:561" file="f13" line="561" endline="561" inline="1">
  </Destructor>
  <OperatorMethod id="_1921" name="=" returns="_2228" artificial="1" throw="" context="_870" access="public" mangled="_ZN24__darwin_x86_avx_state64aSERKS_" demangled="__darwin_x86_avx_state64::operator=(__darwin_x86_avx_state64 const&amp;)" location="f13:561" file="f13" line="561" endline="561" inline="1">
    <Argument type="_2229" location="f13:561" file="f13" line="561"/>
  </OperatorMethod>
  <Constructor id="_1922" name="__darwin_x86_avx_state64" artificial="1" throw="" context="_870" access="public" mangled="_ZN24__darwin_x86_avx_state64C1ERKS_ *INTERNAL* " demangled="__darwin_x86_avx_state64::__darwin_x86_avx_state64(__darwin_x86_avx_state64 const&amp;)" location="f13:561" file="f13" line="561" endline="561" inline="1">
    <Argument type="_2229" location="f13:561" file="f13" line="561"/>
  </Constructor>
  <Constructor id="_1923" name="__darwin_x86_avx_state64" artificial="1" throw="" context="_870" access="public" mangled="_ZN24__darwin_x86_avx_state64C1Ev *INTERNAL* " demangled="__darwin_x86_avx_state64::__darwin_x86_avx_state64()" location="f13:561" file="f13" line="561" inline="1"/>
  <Field id="_1924" name="ad_name_offset" type="_78" offset="0" context="_873" access="public" location="f25:133" file="f25" line="133"/>
  <Field id="_1925" name="ad_flags" type="_18" offset="32" context="_873" access="public" location="f25:134" file="f25" line="134"/>
  <Field id="_1926" name="ad_pad" type="_2128" offset="64" context="_873" access="public" location="f25:135" file="f25" line="135"/>
  <Destructor id="_1927" name="accessx_descriptor" artificial="1" throw="" context="_873" access="public" mangled="_ZN18accessx_descriptorD1Ev *INTERNAL* " demangled="accessx_descriptor::~accessx_descriptor()" location="f25:132" file="f25" line="132" endline="132" inline="1">
  </Destructor>
  <OperatorMethod id="_1928" name="=" returns="_2230" artificial="1" throw="" context="_873" access="public" mangled="_ZN18accessx_descriptoraSERKS_" demangled="accessx_descriptor::operator=(accessx_descriptor const&amp;)" location="f25:132" file="f25" line="132" endline="132" inline="1">
    <Argument type="_2231" location="f25:132" file="f25" line="132"/>
  </OperatorMethod>
  <Constructor id="_1929" name="accessx_descriptor" artificial="1" throw="" context="_873" access="public" mangled="_ZN18accessx_descriptorC1ERKS_ *INTERNAL* " demangled="accessx_descriptor::accessx_descriptor(accessx_descriptor const&amp;)" location="f25:132" file="f25" line="132" endline="132" inline="1">
    <Argument type="_2231" location="f25:132" file="f25" line="132"/>
  </Constructor>
  <Constructor id="_1930" name="accessx_descriptor" artificial="1" throw="" context="_873" access="public" mangled="_ZN18accessx_descriptorC1Ev *INTERNAL* " demangled="accessx_descriptor::accessx_descriptor()" location="f25:132" file="f25" line="132" inline="1"/>
  <Field id="_1931" name="fds_bits" type="_2232" offset="0" context="_878" access="public" location="f56:47" file="f56" line="47"/>
  <Destructor id="_1932" name="fd_set" artificial="1" throw="" context="_878" access="public" mangled="_ZN6fd_setD1Ev *INTERNAL* " demangled="fd_set::~fd_set()" location="f56:46" file="f56" line="46" endline="46" inline="1">
  </Destructor>
  <OperatorMethod id="_1933" name="=" returns="_2233" artificial="1" throw="" context="_878" access="public" mangled="_ZN6fd_setaSERKS_" demangled="fd_set::operator=(fd_set const&amp;)" location="f56:46" file="f56" line="46" endline="46" inline="1">
    <Argument type="_2234" location="f56:46" file="f56" line="46"/>
  </OperatorMethod>
  <Constructor id="_1934" name="fd_set" artificial="1" throw="" context="_878" access="public" mangled="_ZN6fd_setC1ERKS_ *INTERNAL* " demangled="fd_set::fd_set(fd_set const&amp;)" location="f56:46" file="f56" line="46" endline="46" inline="1">
    <Argument type="_2234" location="f56:46" file="f56" line="46"/>
  </Constructor>
  <Constructor id="_1935" name="fd_set" artificial="1" throw="" context="_878" access="public" mangled="_ZN6fd_setC1Ev *INTERNAL* " demangled="fd_set::fd_set()" location="f56:46" file="f56" line="46" inline="1"/>
  <Field id="_1936" name="__fpu_reserved" type="_2128" offset="0" context="_889" access="public" location="f13:271" file="f13" line="271"/>
  <Field id="_1937" name="__fpu_fcw" type="_220" offset="64" context="_889" access="public" location="f13:272" file="f13" line="272"/>
  <Field id="_1938" name="__fpu_fsw" type="_390" offset="80" context="_889" access="public" location="f13:273" file="f13" line="273"/>
  <Field id="_1939" name="__fpu_ftw" type="_634" offset="96" context="_889" access="public" location="f13:274" file="f13" line="274"/>
  <Field id="_1940" name="__fpu_rsrv1" type="_634" offset="104" context="_889" access="public" location="f13:275" file="f13" line="275"/>
  <Field id="_1941" name="__fpu_fop" type="_192" offset="112" context="_889" access="public" location="f13:276" file="f13" line="276"/>
  <Field id="_1942" name="__fpu_ip" type="_445" offset="128" context="_889" access="public" location="f13:277" file="f13" line="277"/>
  <Field id="_1943" name="__fpu_cs" type="_192" offset="160" context="_889" access="public" location="f13:278" file="f13" line="278"/>
  <Field id="_1944" name="__fpu_rsrv2" type="_192" offset="176" context="_889" access="public" location="f13:279" file="f13" line="279"/>
  <Field id="_1945" name="__fpu_dp" type="_445" offset="192" context="_889" access="public" location="f13:280" file="f13" line="280"/>
  <Field id="_1946" name="__fpu_ds" type="_192" offset="224" context="_889" access="public" location="f13:281" file="f13" line="281"/>
  <Field id="_1947" name="__fpu_rsrv3" type="_192" offset="240" context="_889" access="public" location="f13:282" file="f13" line="282"/>
  <Field id="_1948" name="__fpu_mxcsr" type="_445" offset="256" context="_889" access="public" location="f13:283" file="f13" line="283"/>
  <Field id="_1949" name="__fpu_mxcsrmask" type="_445" offset="288" context="_889" access="public" location="f13:284" file="f13" line="284"/>
  <Field id="_1950" name="__fpu_stmm0" type="_585" offset="320" context="_889" access="public" location="f13:285" file="f13" line="285"/>
  <Field id="_1951" name="__fpu_stmm1" type="_585" offset="448" context="_889" access="public" location="f13:286" file="f13" line="286"/>
  <Field id="_1952" name="__fpu_stmm2" type="_585" offset="576" context="_889" access="public" location="f13:287" file="f13" line="287"/>
  <Field id="_1953" name="__fpu_stmm3" type="_585" offset="704" context="_889" access="public" location="f13:288" file="f13" line="288"/>
  <Field id="_1954" name="__fpu_stmm4" type="_585" offset="832" context="_889" access="public" location="f13:289" file="f13" line="289"/>
  <Field id="_1955" name="__fpu_stmm5" type="_585" offset="960" context="_889" access="public" location="f13:290" file="f13" line="290"/>
  <Field id="_1956" name="__fpu_stmm6" type="_585" offset="1088" context="_889" access="public" location="f13:291" file="f13" line="291"/>
  <Field id="_1957" name="__fpu_stmm7" type="_585" offset="1216" context="_889" access="public" location="f13:292" file="f13" line="292"/>
  <Field id="_1958" name="__fpu_xmm0" type="_805" offset="1344" context="_889" access="public" location="f13:293" file="f13" line="293"/>
  <Field id="_1959" name="__fpu_xmm1" type="_805" offset="1472" context="_889" access="public" location="f13:294" file="f13" line="294"/>
  <Field id="_1960" name="__fpu_xmm2" type="_805" offset="1600" context="_889" access="public" location="f13:295" file="f13" line="295"/>
  <Field id="_1961" name="__fpu_xmm3" type="_805" offset="1728" context="_889" access="public" location="f13:296" file="f13" line="296"/>
  <Field id="_1962" name="__fpu_xmm4" type="_805" offset="1856" context="_889" access="public" location="f13:297" file="f13" line="297"/>
  <Field id="_1963" name="__fpu_xmm5" type="_805" offset="1984" context="_889" access="public" location="f13:298" file="f13" line="298"/>
  <Field id="_1964" name="__fpu_xmm6" type="_805" offset="2112" context="_889" access="public" location="f13:299" file="f13" line="299"/>
  <Field id="_1965" name="__fpu_xmm7" type="_805" offset="2240" context="_889" access="public" location="f13:300" file="f13" line="300"/>
  <Field id="_1966" name="__fpu_rsrv4" type="_2222" offset="2368" context="_889" access="public" location="f13:301" file="f13" line="301"/>
  <Field id="_1967" name="__fpu_reserved1" type="_18" offset="4160" context="_889" access="public" location="f13:302" file="f13" line="302"/>
  <Field id="_1968" name="__avx_reserved1" type="_2227" offset="4192" context="_889" access="public" location="f13:303" file="f13" line="303"/>
  <Field id="_1969" name="__fpu_ymmh0" type="_805" offset="4704" context="_889" access="public" location="f13:304" file="f13" line="304"/>
  <Field id="_1970" name="__fpu_ymmh1" type="_805" offset="4832" context="_889" access="public" location="f13:305" file="f13" line="305"/>
  <Field id="_1971" name="__fpu_ymmh2" type="_805" offset="4960" context="_889" access="public" location="f13:306" file="f13" line="306"/>
  <Field id="_1972" name="__fpu_ymmh3" type="_805" offset="5088" context="_889" access="public" location="f13:307" file="f13" line="307"/>
  <Field id="_1973" name="__fpu_ymmh4" type="_805" offset="5216" context="_889" access="public" location="f13:308" file="f13" line="308"/>
  <Field id="_1974" name="__fpu_ymmh5" type="_805" offset="5344" context="_889" access="public" location="f13:309" file="f13" line="309"/>
  <Field id="_1975" name="__fpu_ymmh6" type="_805" offset="5472" context="_889" access="public" location="f13:310" file="f13" line="310"/>
  <Field id="_1976" name="__fpu_ymmh7" type="_805" offset="5600" context="_889" access="public" location="f13:311" file="f13" line="311"/>
  <Destructor id="_1977" name="__darwin_i386_avx_state" artificial="1" throw="" context="_889" access="public" mangled="_ZN23__darwin_i386_avx_stateD1Ev *INTERNAL* " demangled="__darwin_i386_avx_state::~__darwin_i386_avx_state()" location="f13:270" file="f13" line="270" endline="270" inline="1">
  </Destructor>
  <OperatorMethod id="_1978" name="=" returns="_2235" artificial="1" throw="" context="_889" access="public" mangled="_ZN23__darwin_i386_avx_stateaSERKS_" demangled="__darwin_i386_avx_state::operator=(__darwin_i386_avx_state const&amp;)" location="f13:270" file="f13" line="270" endline="270" inline="1">
    <Argument type="_2236" location="f13:270" file="f13" line="270"/>
  </OperatorMethod>
  <Constructor id="_1979" name="__darwin_i386_avx_state" artificial="1" throw="" context="_889" access="public" mangled="_ZN23__darwin_i386_avx_stateC1ERKS_ *INTERNAL* " demangled="__darwin_i386_avx_state::__darwin_i386_avx_state(__darwin_i386_avx_state const&amp;)" location="f13:270" file="f13" line="270" endline="270" inline="1">
    <Argument type="_2236" location="f13:270" file="f13" line="270"/>
  </Constructor>
  <Constructor id="_1980" name="__darwin_i386_avx_state" artificial="1" throw="" context="_889" access="public" mangled="_ZN23__darwin_i386_avx_stateC1Ev *INTERNAL* " demangled="__darwin_i386_avx_state::__darwin_i386_avx_state()" location="f13:270" file="f13" line="270" inline="1"/>
  <Field id="_1981" name="__sa_handler" type="_199" offset="0" context="_892" access="public" location="f24:269" file="f24" line="269"/>
  <Field id="_1982" name="__sa_sigaction" type="_2237" offset="0" context="_892" access="public" location="f24:271" file="f24" line="271"/>
  <Destructor id="_1983" name="__sigaction_u" artificial="1" throw="" context="_892" access="public" mangled="_ZN13__sigaction_uD1Ev *INTERNAL* " demangled="__sigaction_u::~__sigaction_u()" location="f24:268" file="f24" line="268" endline="268" inline="1">
  </Destructor>
  <OperatorMethod id="_1984" name="=" returns="_2238" artificial="1" throw="" context="_892" access="public" mangled="_ZN13__sigaction_uaSERKS_" demangled="__sigaction_u::operator=(__sigaction_u const&amp;)" location="f24:268" file="f24" line="268" endline="268" inline="1">
    <Argument type="_2239" location="f24:268" file="f24" line="268"/>
  </OperatorMethod>
  <Constructor id="_1985" name="__sigaction_u" artificial="1" throw="" context="_892" access="public" mangled="_ZN13__sigaction_uC1ERKS_ *INTERNAL* " demangled="__sigaction_u::__sigaction_u(__sigaction_u const&amp;)" location="f24:268" file="f24" line="268" endline="268" inline="1">
    <Argument type="_2239" location="f24:268" file="f24" line="268"/>
  </Constructor>
  <Constructor id="_1986" name="__sigaction_u" artificial="1" throw="" context="_892" access="public" mangled="_ZN13__sigaction_uC1Ev *INTERNAL* " demangled="__sigaction_u::__sigaction_u()" location="f24:268" file="f24" line="268" inline="1"/>
  <PointerType id="_1987" type="_909" size="32" align="32"/>
  <ReferenceType id="_1989" type="_12" size="32" align="32"/>
  <ReferenceType id="_1990" type="_12c" size="32" align="32"/>
  <PointerType id="_1991" type="_15" size="32" align="32"/>
  <ReferenceType id="_1992" type="_15" size="32" align="32"/>
  <ReferenceType id="_1993" type="_15c" size="32" align="32"/>
  <ReferenceType id="_1994" type="_17" size="32" align="32"/>
  <ReferenceType id="_1995" type="_17c" size="32" align="32"/>
  <PointerType id="_1996" type="_330" size="32" align="32"/>
  <ReferenceType id="_1997" type="_20" size="32" align="32"/>
  <ReferenceType id="_1998" type="_20c" size="32" align="32"/>
  <ArrayType id="_1999" min="0" max="39u" type="_1139" size="320" align="8"/>
  <ReferenceType id="_2000" type="_22" size="32" align="32"/>
  <ReferenceType id="_2001" type="_22c" size="32" align="32"/>
  <ReferenceType id="_2002" type="_27" size="32" align="32"/>
  <ReferenceType id="_2003" type="_27c" size="32" align="32"/>
  <ReferenceType id="_2004" type="_35" size="32" align="32"/>
  <ReferenceType id="_2005" type="_35c" size="32" align="32"/>
  <ReferenceType id="_2009" type="_46" size="32" align="32"/>
  <ReferenceType id="_2010" type="_46c" size="32" align="32"/>
  <ReferenceType id="_2011" type="_54" size="32" align="32"/>
  <ReferenceType id="_2012" type="_54c" size="32" align="32"/>
  <ArrayType id="_2013" min="0" max="55u" type="_1139" size="448" align="8"/>
  <ReferenceType id="_2014" type="_56" size="32" align="32"/>
  <ReferenceType id="_2015" type="_56c" size="32" align="32"/>
  <ReferenceType id="_2016" type="_58" size="32" align="32"/>
  <ReferenceType id="_2017" type="_58c" size="32" align="32"/>
  <ReferenceType id="_2018" type="_66" size="32" align="32"/>
  <ReferenceType id="_2019" type="_66c" size="32" align="32"/>
  <ReferenceType id="_2020" type="_80" size="32" align="32"/>
  <ReferenceType id="_2021" type="_80c" size="32" align="32"/>
  <ReferenceType id="_2022" type="_96" size="32" align="32"/>
  <ReferenceType id="_2023" type="_96c" size="32" align="32"/>
  <ArrayType id="_2025" min="0" max="6u" type="_106" size="224" align="32"/>
  <ReferenceType id="_2026" type="_128" size="32" align="32"/>
  <ReferenceType id="_2027" type="_128c" size="32" align="32"/>
  <ReferenceType id="_2030" type="_173" size="32" align="32"/>
  <ReferenceType id="_2031" type="_173c" size="32" align="32"/>
  <ReferenceType id="_2039" type="_213" size="32" align="32"/>
  <ReferenceType id="_2040" type="_213c" size="32" align="32"/>
  <ReferenceType id="_2041" type="_220" size="32" align="32"/>
  <ReferenceType id="_2042" type="_220c" size="32" align="32"/>
  <ArrayType id="_2044" min="0" max="255u" type="_1139" size="2048" align="8"/>
  <ReferenceType id="_2045" type="_244" size="32" align="32"/>
  <ReferenceType id="_2046" type="_244c" size="32" align="32"/>
  <ArrayType id="_2047" min="0" max="127u" type="_1139" size="1024" align="8"/>
  <ReferenceType id="_2048" type="_257" size="32" align="32"/>
  <ReferenceType id="_2049" type="_257c" size="32" align="32"/>
  <ReferenceType id="_2050" type="_260" size="32" align="32"/>
  <ReferenceType id="_2051" type="_260c" size="32" align="32"/>
  <ReferenceType id="_2052" type="_265" size="32" align="32"/>
  <ReferenceType id="_2053" type="_265c" size="32" align="32"/>
  <ReferenceType id="_2054" type="_284" size="32" align="32"/>
  <ReferenceType id="_2055" type="_284c" size="32" align="32"/>
  <ReferenceType id="_2056" type="_294" size="32" align="32"/>
  <ReferenceType id="_2057" type="_294c" size="32" align="32"/>
  <ReferenceType id="_2058" type="_302" size="32" align="32"/>
  <ReferenceType id="_2059" type="_302c" size="32" align="32"/>
  <ReferenceType id="_2060" type="_303" size="32" align="32"/>
  <ReferenceType id="_2061" type="_303c" size="32" align="32"/>
  <PointerType id="_2062" type="_303" size="32" align="32"/>
  <ReferenceType id="_2063" type="_304" size="32" align="32"/>
  <ReferenceType id="_2064" type="_304c" size="32" align="32"/>
  <ReferenceType id="_2065" type="_305" size="32" align="32"/>
  <ReferenceType id="_2066" type="_305c" size="32" align="32"/>
  <ReferenceType id="_2067" type="_306" size="32" align="32"/>
  <ReferenceType id="_2068" type="_306c" size="32" align="32"/>
  <ReferenceType id="_2069" type="_309" size="32" align="32"/>
  <ReferenceType id="_2070" type="_309c" size="32" align="32"/>
  <ReferenceType id="_2071" type="_325" size="32" align="32"/>
  <ReferenceType id="_2072" type="_325c" size="32" align="32"/>
  <ReferenceType id="_2073" type="_330" size="32" align="32"/>
  <ReferenceType id="_2074" type="_330c" size="32" align="32"/>
  <PointerType id="_2075" type="_354" size="32" align="32"/>
  <ReferenceType id="_2076" type="_354" size="32" align="32"/>
  <ReferenceType id="_2077" type="_354c" size="32" align="32"/>
  <ReferenceType id="_2078" type="_375" size="32" align="32"/>
  <ReferenceType id="_2079" type="_375c" size="32" align="32"/>
  <ReferenceType id="_2082" type="_390" size="32" align="32"/>
  <ReferenceType id="_2083" type="_390c" size="32" align="32"/>
  <ReferenceType id="_2084" type="_393" size="32" align="32"/>
  <ReferenceType id="_2085" type="_393c" size="32" align="32"/>
  <ReferenceType id="_2086" type="_401" size="32" align="32"/>
  <ReferenceType id="_2087" type="_401c" size="32" align="32"/>
  <ReferenceType id="_2088" type="_412" size="32" align="32"/>
  <ReferenceType id="_2089" type="_412c" size="32" align="32"/>
  <Field id="_2090" name="w_Termsig" bits="7" type="_78" offset="0" context="_1304" access="public" location="f37:201" file="f37" line="201"/>
  <Field id="_2091" name="w_Coredump" bits="1" type="_78" offset="7" context="_1304" access="public" location="f37:202" file="f37" line="202"/>
  <Field id="_2092" name="w_Retcode" bits="8" type="_78" offset="8" context="_1304" access="public" location="f37:203" file="f37" line="203"/>
  <Field id="_2093" name="w_Filler" bits="16" type="_78" offset="16" context="_1304" access="public" location="f37:204" file="f37" line="204"/>
  <Destructor id="_2094" name="$_2" artificial="1" throw="" context="_1304" access="public" mangled="_ZN4wait3$_2D1Ev *INTERNAL* " demangled="wait::$_2::~$_2()" location="f37:199" file="f37" line="199" endline="199" inline="1">
  </Destructor>
  <OperatorMethod id="_2095" name="=" returns="_2276" artificial="1" throw="" context="_1304" access="public" mangled="_ZN4wait3$_2aSERKS0_" demangled="wait::$_2::operator=(wait::$_2 const&amp;)" location="f37:199" file="f37" line="199" endline="199" inline="1">
    <Argument type="_2277" location="f37:199" file="f37" line="199"/>
  </OperatorMethod>
  <Constructor id="_2096" artificial="1" throw="" context="_1304" access="public" mangled="_ZN4wait3$_2C1ERKS0_ *INTERNAL* " demangled="wait::$_2::$_2(wait::$_2 const&amp;)" location="f37:199" file="f37" line="199" endline="199" inline="1">
    <Argument type="_2277" location="f37:199" file="f37" line="199"/>
  </Constructor>
  <Constructor id="_2097" artificial="1" throw="" context="_1304" access="public" mangled="_ZN4wait3$_2C1Ev *INTERNAL* " demangled="wait::$_2::$_2()" location="f37:199" file="f37" line="199" inline="1"/>
  <Field id="_2098" name="w_Stopval" bits="8" type="_78" offset="0" context="_1305" access="public" location="f37:220" file="f37" line="220"/>
  <Field id="_2099" name="w_Stopsig" bits="8" type="_78" offset="8" context="_1305" access="public" location="f37:221" file="f37" line="221"/>
  <Field id="_2100" name="w_Filler" bits="16" type="_78" offset="16" context="_1305" access="public" location="f37:222" file="f37" line="222"/>
  <Destructor id="_2101" name="$_3" artificial="1" throw="" context="_1305" access="public" mangled="_ZN4wait3$_3D1Ev *INTERNAL* " demangled="wait::$_3::~$_3()" location="f37:218" file="f37" line="218" endline="218" inline="1">
  </Destructor>
  <OperatorMethod id="_2102" name="=" returns="_2278" artificial="1" throw="" context="_1305" access="public" mangled="_ZN4wait3$_3aSERKS0_" demangled="wait::$_3::operator=(wait::$_3 const&amp;)" location="f37:218" file="f37" line="218" endline="218" inline="1">
    <Argument type="_2279" location="f37:218" file="f37" line="218"/>
  </OperatorMethod>
  <Constructor id="_2103" artificial="1" throw="" context="_1305" access="public" mangled="_ZN4wait3$_3C1ERKS0_ *INTERNAL* " demangled="wait::$_3::$_3(wait::$_3 const&amp;)" location="f37:218" file="f37" line="218" endline="218" inline="1">
    <Argument type="_2279" location="f37:218" file="f37" line="218"/>
  </Constructor>
  <Constructor id="_2104" artificial="1" throw="" context="_1305" access="public" mangled="_ZN4wait3$_3C1Ev *INTERNAL* " demangled="wait::$_3::$_3()" location="f37:218" file="f37" line="218" inline="1"/>
  <ReferenceType id="_2105" type="_417" size="32" align="32"/>
  <ReferenceType id="_2106" type="_417c" size="32" align="32"/>
  <ReferenceType id="_2107" type="_419" size="32" align="32"/>
  <ReferenceType id="_2108" type="_419c" size="32" align="32"/>
  <ReferenceType id="_2109" type="_440" size="32" align="32"/>
  <ReferenceType id="_2110" type="_440c" size="32" align="32"/>
  <ReferenceType id="_2111" type="_441" size="32" align="32"/>
  <ReferenceType id="_2112" type="_441c" size="32" align="32"/>
  <ReferenceType id="_2113" type="_450" size="32" align="32"/>
  <ReferenceType id="_2114" type="_450c" size="32" align="32"/>
  <ReferenceType id="_2116" type="_459" size="32" align="32"/>
  <ReferenceType id="_2117" type="_459c" size="32" align="32"/>
  <ArrayType id="_2119" min="0" max="191u" type="_1139" size="1536" align="8"/>
  <ReferenceType id="_2120" type="_476" size="32" align="32"/>
  <ReferenceType id="_2121" type="_476c" size="32" align="32"/>
  <ReferenceType id="_2122" type="_477" size="32" align="32"/>
  <ReferenceType id="_2123" type="_477c" size="32" align="32"/>
  <ReferenceType id="_2126" type="_488" size="32" align="32"/>
  <ReferenceType id="_2127" type="_488c" size="32" align="32"/>
  <ArrayType id="_2128" min="0" max="1u" type="_18" size="64" align="32"/>
  <ArrayType id="_2129" min="0" max="95u" type="_1139" size="768" align="8"/>
  <ReferenceType id="_2130" type="_500" size="32" align="32"/>
  <ReferenceType id="_2131" type="_500c" size="32" align="32"/>
  <ArrayType id="_2132" min="0" max="7u" type="_1139" size="64" align="8"/>
  <ReferenceType id="_2133" type="_504" size="32" align="32"/>
  <ReferenceType id="_2134" type="_504c" size="32" align="32"/>
  <ReferenceType id="_2135" type="_506" size="32" align="32"/>
  <ReferenceType id="_2136" type="_506c" size="32" align="32"/>
  <PointerType id="_2137" type="_233" size="32" align="32"/>
  <ArrayType id="_2138" min="0" max="2u" type="_280" size="24" align="8"/>
  <ArrayType id="_2139" min="0" max="0u" type="_280" size="8" align="8"/>
  <ReferenceType id="_2140" type="_507" size="32" align="32"/>
  <ReferenceType id="_2141" type="_507c" size="32" align="32"/>
  <ReferenceType id="_2142" type="_510" size="32" align="32"/>
  <ReferenceType id="_2143" type="_510c" size="32" align="32"/>
  <ReferenceType id="_2144" type="_533" size="32" align="32"/>
  <ReferenceType id="_2145" type="_533c" size="32" align="32"/>
  <ReferenceType id="_2146" type="_547" size="32" align="32"/>
  <ReferenceType id="_2147" type="_547c" size="32" align="32"/>
  <ReferenceType id="_2148" type="_552" size="32" align="32"/>
  <ReferenceType id="_2149" type="_552c" size="32" align="32"/>
